[
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/vulnerabilities-found-in-amosconnect-8-maritime-communications-systems", "date": "October 27, 2017", "title": "Vulnerabilities Found in AmosConnect 8 Maritime Communications Systems ", "articleContent": ["Severe vulnerabilities have been discovered in the AmosConnect 8 software used in thousands of ships worldwide. The communications platform is best known for providing ships at sea with narrowband satellite communications, email, fax and interoffice communication. However, security researchers from IOActive revealed ", " that could potentially allow attackers to access systems and any stored data.", "According to the researchers, flaws in the platform’s login forms make them vulnerable to ", ", which are when a malicious actor injects data into a form to force an error message that provides certain information about the server.", "On the AmosConnect 8, an attacker with network access can use the SQL attack to obtain login credentials of other users. The server apparently stores the usernames and passwords in plaintext, which makes them much easier to steal.", "The platform also has a built-in backdoor that allows full system privileges, which allows an attacker to execute arbitrary code on the server remotely. Any data stored on this server could be potentially exposed, and attackers could also leverage access to enter any connected networks. This is particularly sensitive since international shipping companies deal with confidential customer data and private transportation information.", "Attacks on the shipping industry have been steadily making headlines as hackers experiment with different ways to make a profit. There are ", " of hacker-pirates snooping on the shipping schedule of certain goods to find the most valuable vessel to hijack.", " say that Inmarsat, the makers of AmosConnect, have already addressed the security issues and issued a patch for the vulnerability. The company has discontinued version 8.0 and advised customers to roll back to the earlier AmosConnect 7.0 instead.", "Like many other industries, shipping companies are transitioning and adopting more modern features. In this situation, the custom software they use needs to be designed with security in mind, especially with the rising number of cyber threats. Companies should also keep their systems ", " to protect them against known and widespread threats."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/coinhive-s-dns-server-compromised-thanks-to-weak-password", "date": "October 26, 2017", "title": "Coinhive’s DNS Server Compromised Thanks to Weak Password", "articleContent": ["Coinhive is an enterprising company that gives websites an alternative to earning revenue through ad bombardment with a Monero-mining JavaScript code that website owners can embed on their site. The code allows site owners to use their visitor’s CPU power to mine the cryptocurrency Monero. Coinhive keeps a percentage of the mined Monero, and the rest goes to the owners of the sites containing the script. ", "On October 24, the Coinhive team ", " that their account for their DNS provider was accessed by a malicious actor on October 23. Hackers hijacked Coinhive’s DNS records and modified them to redirect requests for ", " to another server.", "According to the Coinhive announcement, “this third party server hosted a modified version of the JavaScript file with a hardcoded site key. This essentially let the attacker ‘steal’ hashes from our users.”", "The company has apologized for the incident, which was reportedly caused by a weak password that was probably leaked in the ", "—of course, this is not the first time", ". Coinhive mentions that they are actually using 2FA and unique passwords, but neglected to update their older account with their DNS provider.", "The announcement emphasized that no account information was leaked and the company's web and database servers were not accessed. The company plans to reimburse users by crediting all sites with an additional 12 hours of their daily average hashrate.", "This incident highlights the importance of ", ". Using complex and unique passwords is a must, and enterprises must take advantage of all security features their service provider offers. Here are some other tips:"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/turning-your-data-against-you-cybercrime", "date": "October 26, 2017", "title": "Turning Your Data Against You: Cybercrime’s New Norm?", "articleContent": ["Data analysis helps uncover patterns, correlations, and other valuable information that can aid businesses and decision makers. In cybersecurity, data analysis also plays an ", " crucial role in detecting threats. But what if data analysis is used to perpetrate cybercrime?", "In late August this year, a French researcher ", " a large-scale and publicly accessible spambot named Onliner that ", " an estimated 80 million compromised email servers to distribute spam, fingerprint potential victims, and infect them with the information-stealing ", ". Onliner used ", " accounts in total, amassed from previous ", " such as the ", " breach.", "Data is the currency in today’s ", ", and Onliner demonstrated how profitable it is for bad guys. Perhaps the ever-significant value of data is also what's driving the extent and increased sophistication of cyberattacks. In the past, cybercriminals made off with relatively small amounts of data that they reuse for their own modest benefit, like committing ", ".", "Nowadays, cybercriminals are going after bigger data—possibly to cast a wider net and consequently turn in more profit—and using more ", " to steal them. The newer the technology is for processing, managing, and storing data, the more attractive it is for cybercriminals to hack and exploit.", "The sheer volume and variety of data that enterprises (and end users) create, manage, and store—along with the speed with which they change hands—makes them ideal targets for data theft. Cybercriminals and threat actors, in turn, can repurpose this data or resell them in the underground.", "How exactly can data be repurposed for cybercrime? The scenario isn’t exactly new, but it's certainly becoming more prevalent: a cybercriminal either steals credentials stored in the cloud or exploits a vulnerability to hack into repositories that store them. The alternatives? ", " or salvage dumps of publicly leaked data, then sift through and isolate valuable data, such as credentials or other personally identifiable information.", "These credentials are ultimately employed to laterally move within the network to steal more data, hold them hostage through encryption, or infect the infrastructure these credentials are tied to with malware.", "In June 2016, the accounts and personal details compromised in the 2012 LinkedIn data breach were ", " to fabricate legitimate-looking phishing emails. They came with a Word document embedded with malicious macro code that retrieved and ran the ZeuS Panda banking Trojan. ", ", a Master Boot Record-overwriting ransomware that ", " the San Francisco Municipal Transportation Agency in 2016, was ", " to have been executed using exposed/unsecured remote desktops, given how it’s easy to buy credentials to compromised servers in the ", ".", "Misusing data this way isn’t just limited to large-scale, spray-and-pray campaigns. In fact, the theft, purchase, and harvest of certain credentials are more of an end-to-end strategy. This means cybercriminals and threat actors can be especially purposeful when choosing victims to attack. In October 2017, customer banking credentials, amassed via phishing campaigns, were ", " to distribute ", " emails to the targeted bank’s employees that installed a backdoor into the bank’s systems and networks.", "The ", " is also in the crosshairs, with attacks that leverage the way smart devices collect, process, and analyze data. Last February, smart—but unsecured—teddy bears were reported to have ", " 800,000 account credentials (and 2 million audio recordings), which made the rounds in the underground. Cybercriminals looked to make more profit by holding the database for ransom.", "Data is certainly changing the way enterprises do business. In today’s increasingly connected world, even the simplest or seemingly smallest piece of information, such as an ", ", can be utilized by a cybercriminal to ", " spam campaigns for profit. For users: ", "Cybercriminals can misuse your own data against you, so make sure that the information you share won't expose you to malware and cyberattacks.", "Here are some defensive measures that information security professionals and system administrators can do to secure their organization’s data:"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/internet-of-things/security-risks-in-a-technology-driven-world", "date": "October 18, 2017", "title": "Security Risks in a Technology-Driven World", "articleContent": ["Technology has certainly changed how the world works, influencing almost every aspect of modern life. But while modern technology undeniably brings a number of advantages across multiple sectors, it also has its share of downsides. The interconnectivity that ties all devices and systems to the internet has invited malicious forces into the mix, exposing users and businesses to a wide range of threats. How do you stay safe and secure?", "Your mobile phone's alarm wakes you up in the morning, but you get up to check updates from your social media network. News and updates used to come via the morning paper and conversations over the phone. More than a decade later, scanning social media feeds is the new norm for a lot of people.", "When you leave home for work, the thought of commuting comes with a feeling of dread because of expected traffic and pollution. Modern transportation network companies like Uber and Lyft found a", "to increase the per capita utility of a car, reduce congestion and carbon emission, and eliminates the need for parking spaces. The power of interconnectivity has provided car-sharing and car-pooling services an online platform that connects passengers to commercial drivers, which makes life more convenient for people who commute to work.", "Businesses started embracing the Bring Your Own Device (BYOD) trend over the past few years, allowing them to save or redirect some resources to other avenues of their organization. Employees can bring their own personal devices to the workplace that they can use for their day-to-day tasks. In return, the organization enjoys the efficiency and productivity that these devices provide the workforce without having to pay for them.", ", on the other hand, have replaced humans in many large-scale production and manufacturing activities around the world because of their efficiency and accuracy. These mechanical, programmable devices can now be seen in industrial sectors, making cars, fabricating airplane parts, assembling food products, and even providing critical public services.", "The abovementioned examples are just some of the ways we have adopted or integrated new technology into our daily lives. While we reap the benefits and convenience they bring, we should also be aware that threats, like technology, are always evolving."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/mobile-safety/sockbot-malware-found-on-google-play-can-ensnare-devices-to-a-ddos-botnet", "date": "October 20, 2017", "title": "Sockbot Malware Found on Google Play can Ensnare Devices to a DDoS Botnet", "articleContent": ["Eight applications hosted on Google Play were ", " infected with the Sockbot malware (detected by Trend Micro as ANDROIDOS_TAPJOY.OPD), which not only generates illicit advertising revenue for its developers but can also zombify the infected device as part of a botnet. The apps were reportedly downloaded between 600,000 and 2.6 million times, mostly by users in the U.S., followed by those in Russia, Ukraine, Brazil, and Germany.", "The apps posed as mods for the popular game Minecraft: Pocket Edition, allowing players to customize the appearance of their characters. However, the apps were found to have been surreptitiously generating ad revenue for their developer, and have since been taken down from Google Play.", " to the security researchers, the app will connect covertly to a command and control (C&C) server on port 9001, which will request the app to open a socket via the Socket Secure (SOCKS) protocol. It will then connect to the IP address and port specified by the C&C server. After a connection is established, the app connects to another developer-specified server that issues a list of ads and related metadata (i.e., advertisement type, screen size name). Using the SOCKS proxy, the app will connect to an ad server and launch ad requests.", "The researchers note that Sockbot’s mechanisms can be expanded to exploit network-based vulnerabilities. And with Sockbot’s hijacking capability, the infected devices can be used to launch ", " (DDoS) attacks.", "Sockbot’s code and key strings were obfuscated and encrypted, making it more challenging to detect. They attributed the apps to a developer going by handle FunBaster, who was said to have signed each app with different developer keys to bypass static analysis.", "Socksbot is not the first to misuse the SOCKS protocol or make use of Android apps to generate illegitimate revenue. ", ", a malware that emerged last September 2016, used the SOCKS proxy to access the internal, corporate networks to which compromised mobile devices connected. ", " took this up a notch in April 2017 by also abusing the SOCKS protocol, setting proxies to conduct reconnaissance when accessing the vulnerable services and networks of the affected device. MilkyDoor also integrated remote port forwarding through the Secure Shell (SSH) tunnel, enabling the malware to encrypt its malicious traffic and payloads.", "At least 3,000 apps were Trojanized with DressCode, 400 of which were found on Google Play. 200 MilkyDoor-infected Android apps were also found, one of which had between 500,000 and a million Google Play downloads. Like Socksbot, both DressCode and MilkyDoor masqueraded as recreational apps—games, mods and skins, themes, phone optimization boosters, Doodle, style guides and e-books to children.  They can be surmised as legitimate apps that were repackaged, Trojanized, then republished in Google Play.", "Indeed, ensuring ", " is crucial given the significant impact of these types of malware. Organizations adopting ", " programs should balance maintaining flexibility in business operations and ensuring their privacy and security. Here are some best practices, especially for enterprises:"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/protecting-yourself-from-bad-rabbit-ransomware", "date": "October 25, 2017", "title": "Protecting Yourself from Bad Rabbit Ransomware ", "articleContent": [" is a new ransomware currently spreading across Eastern Europe. ", " reports are saying that it is targeting mainly media organizations in Russia and infrastructure and transportation services in the Ukraine. Initial analysis shows that it bears some similarities to Petya, which was a ransomware caused widespread damage in June. BadRabbit uses an exploit that targets Server Message Block (SMB) vulnerabilities. ", "Here’s what we know:", "Detailed solutions for Bad Rabbit ransomware can be found on our"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/internet-of-things/high-tech-highways-securing-the-future-of-transportation", "date": "October 24, 2017", "title": "High-Tech Highways", "articleContent": ["View Cyberattacks Against Intelligent Transportation Systems", "As technology continues to become more and more connected to the internet, the infrastructures that our daily lives rely upon also follow suit. One manifestation of this are Intelligent Transportation Systems (ITS), the application of advanced and emerging technologies in transportation to save lives, time, money, and the environment. From autonomous vehicles to Smart Roads, ITS makes it realistic to imagine fully integrated and connected traffic systems in the future.", "However, all internet-enabled technologies are open to the threat of cyberattacks, which could cause commerce disruption and revenue loss and also pose significant safety risks. This scenario is especially true when it comes to ITS. The already demonstrated and proven possibility of ITS being attacked is the main premise of our latest research paper, “Cyberattacks Against Intelligent Transportation Systems: Assessing Future Threats to ITS.” In it we discuss in detail the threats that ITS-integrated traffic infrastructure will face down the line, from attacks that deny the flow of data and information to actual disruption of functions and services. The paper also offers our recommendations, both short term and long term, on what needs to be done to secure an ITS against those very threats.", "In the map below, we show a full-fledged Intelligent Transportation System. Click on the icons to see the different components as well as the potential threats that can target them.", "For details on the ITS ecosystem, guidelines on protecting it from cyberattacks, and more, read the research paper: “", "”\r\n\r\n\r\n", "\r\n        "]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/millions-of-networks-compromised-by-new-reaper-botnet", "date": "October 24, 2017", "title": "Millions of Networks Compromised by New Reaper Botnet", "articleContent": ["A new and growing botnet called Reaper or Troop (detected by Trend Micro as ELF_IOTREAPER.A) has been found currently affecting more than ", ". According to the security researchers from Check Point and Qihoo 360 Netlab, the botnet they discovered is more sophisticated and potentially more damaging than ", ". Reaper actually uses some of the code from the Mirai malware but uses a different method for compromising devices.", " or took advantage of unsecured devices with default or weak passwords. Reaper is more aggressive, using exploits to take over devices and enlist these with their command and control server. Reports note that there are already ", " just on standby, waiting to be processed by Reaper’s C&C servers.", "Reaper uses a combination of ", " targeting known Internet of Things (IoT) vulnerabilities. These attacks affect many popular router brands as well as IP cameras, Network Attached Storage devices, and servers.", "So far the Reaper botnet hasn't been used to launch a DDoS attack, as ", " famously did last year. But Reaper is capable of more complex attacks. It integrates a", ". This allows the operator to deliver code modules for tasks such as DDoS, traffic proxying or other attacks. The report notes that the botnet is not particularly aggressive, but it could quickly change and potentially cause damage on an even larger scale than Mirai.", "IoT devices like ", " and ", " are particularly susceptible to exploits. Users should check with their vendors to see if there are any available updates. They should also make it a point to regularly update all connected devices in their homes. Also, simply using a strong password will do a lot to secure IoT devices commonly targeted by hackers.", " and ", " offer effective protection for this threat, with security features that can detect malware at the endpoint level. To protect IoT devices like home routers, security solutions like Trend Micro Home Network Security can check internet traffic between the router and all connected devices. Enterprises can use ", " which is a network appliance that monitors all ports and over 105 different network protocols to discover advanced threats and targeted attacks."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/internet-of-things/vulnerabilities-found-in-kids-smartwatches-pose-security-risks", "date": "October 19, 2017", "title": "Vulnerabilities Found in Kids’ Smartwatches Pose Security Risks", "articleContent": ["Wearable internet-of-things (IoT) devices like smartwatches can help parents keep an eye on their children while also providing them the independence and connectivity they need for their lifestyle and activities. But if you’re planning on buying one for your kid, make sure that the device and its applications won't compromise your kid’s security—online or otherwise.", "Security researchers and the Norwegian Consumer Council recently released their findings on several smartwatches designed for kids and reported several vulnerabilities that can compromise privacy and security. According to their ", ", these security flaws can allow other parties to surreptitiously track the wearer’s whereabouts, eavesdrop on voice messages, and steal personally identifiable information on the device.", "The researchers tested three smartwatches, one of which had a user base of ", ". The two others are products sold worldwide under different brand names. These smartwatches feature real-time GPS tracking and can do two-way calls. According to the Norway-based ", ", a stranger can easily “take control of the watch and track, eavesdrop on, and communicate with the child. They will be able to track the child as it moves or make it look like the child is somewhere it is not. Some of the data is transmitted and stored without encryption.”", "The report also noted the poor implementation of the SOS and phone number whitelisting functions in one of the devices they tested. The notifications transmitted when the wearer leaves a certain area were also unreliable. The Norwegian Consumer Council added that some of the applications in the smartwatches didn’t have an End User License Agreement (EULA), or terms and conditions, which are breaches of the country’s Marketing Control Act and the Personal Data Act.", "Indeed, new technologies are redefining how people—especially youngsters—interact. While IoT devices such as smartwatches demonstrate the ease and convenience these technologies bring, they also come with security risks. And for parents, it’s important to balance the need to be more connected, the benefits of providing children more ways for learning and recreation, and the significance of protecting privacy. Apply ", " when using IoT devices for your kids: help them practice online safety, research the device before purchasing it, enable and set up the device’s security features/settings, and more importantly, gauge how the device handles and processes personal data.", "The consumer group already notified Norwegian Data Protection Authority, which accordingly informed the smartwatches’ importers and manufacturers. They’ve been advised that some of these flaws have already been patched and that the concerned companies are working to improve their device’s security."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/mobile-safety/best-practices-securing-your-mobile-device", "date": "October 10, 2017", "title": "Best Practices: Securing Your Mobile Device", "articleContent": []},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/vulnerabilities-and-exploits/vulnerability-in-key-fob-can-let-hackers-open-subaru-cars", "date": "October 16, 2017", "title": "Vulnerability in Key Fob Can Let Hackers Open Subaru Cars", "articleContent": ["Electronics designer ", " recently ", " a vulnerability in the key fob system that car manufacturer Subaru uses for several of its vehicles. When exploited successfully, it can enable hackers or thieves to clone the key fob to the access the vehicle. ", "Dubbed as the “fobrob” exploit, Wimmenhove noted that the flaw is relatively easy to exploit. Normally, a key fob will send out code as rolling or hopping codes, which keyless entry cars process to unlock doors. These rolling codes are designed to be random to deter their reuse, but Wimmenhove notes that Subaru’s implementation of the algorithm used to generate the code in the keys is flawed, with predictable or sequential codes, rather than randomized. Hackers need only a $25 device to capture the packets of data sent by the car key and retrieve the rolling lock and unlock codes the data generates. These codes can then be duplicated on a Raspberry Pi. ", "Affected models include Subaru Baja (2006), Subaru Forester (2005–2010), Subaru Impreza (2004–2011), Subaru Legacy (2005–2010), and Subaru Outback (2005–2010). Wimmenhove also ", " the exploit for the vulnerability in a Subaru Forester. ", "As of this writing, Subaru has yet to acknowledge the issue or respond to requests for comment. Wimmenhove told BleepingComputer, “I did [reach out]. I told them about the vulnerability and shared my code with them. They referred me to their ‘partnership’ page and asked me to fill in a questionnaire.” ", " ", "Vehicle hacking is an ", " as cars become smarter, relying on the internet to provide a gamut of features for its users. And Subaru is just among the many other manufacturers affected by car hacking. As early as 2015, smart car features such as ", ", ", ", and ", " services, as well as other digital/", " (i.e., ", " used in ", ") have been used as doorways into a targeted and exposed car. ", "In August, a ", " from the ", ", Linklayer Labs, and Trend Micro Forward-looking Threat Research (FTR) team took a closer look at the vulnerabilities affecting the Controller Area Network (CAN bus). The CAN standard is an internal, message-based vehicle network that enables the car’s microcontrollers and devices to communicate with each other via applications. The research elaborated how the CAN bus vulnerabilities can disable a device connected to the car’s network such as airbags, parking sensors, and other safety systems. Given that a number of car manufacturers use this protocol, the security flaws have tangible effects on the vehicles’ virtual and physical security, and affect the integrity of the components that power many of their functions.", " ", "But as automobiles become one of the new frontiers for hackers given the latest technologies introduced to them to make them smarter, note its ", ". Additionally, car manufacturers are taking the initiative by updating or ", " the applications they integrate in the vehicles they manufacture, and launching programs to better detect vulnerabilities in their vehicles. Last 2016, U.S.’ Automotive Information Sharing and Analysis Center (Auto-ISAC) ", " with automobile makers in setting up ", " for smart car security. The European Union did the same by ", " the development of security standards and multi-process certification to ensure data privacy in Internet of Things (IoT) devices, including smart cars."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/business-process-compromise-bpc-attack-hits-banks-in-post-soviet-countries", "date": "October 13, 2017", "title": "Business Process Compromise (BPC) Attack Hits Banks in Post-Soviet Countries ", "articleContent": ["Financial institutions are one of the major targets of ", " (BPC) attacks, as seen in the ", " in which $81 million was stolen during a sophisticated attack by abusing the bank’s internal processes. In another recent incident, another BPC attack targeted banks across multiple post-Soviet states, with losses totaling roughly $40 million.", "BPC attacks involve manipulation of a legitimate internal process. In these latest attacks, the attackers combined real-life fraud with cyberattacks to pull off the heist. The first part involved the abuse of the Overdraft Limit (OD), which refers to the amount that debit card users can access beyond what is actually contained in their account. In this scenario, attackers sent various individuals to sign up for bank accounts with debit cards. The debit cards were then forwarded to the perpetrators, who were located in various countries throughout Europe.", "The attackers also used a phishing campaign to target bank employees, aiming to install malware (Detected by Trend Micro as ", ") on their systems. This malware gives attackers a backdoor into the bank’s network and systems. Once inside, the attackers will then use the banks’ VPN credentials to gain access to the network of third-party payment processing providers, after which they will drop various malware, including a monitoring tool that allows access to infrastructure that controls card management. Additional software, the legitimate monitoring tool", ", was also installed to capture screenshots and keystrokes, among others.", "The sophisticated planning and implementation of the heist make it a perfect example of how a BPC attack works. These attacks are a growing problem for organizations, as information from 2013 to 2015 shows that organizations have lost at least $3.1 billion to BPC attacks—a number that is likely much higher today.", "All organizations from large banks to SMBs are potentially vulnerable to BPC attacks. However, there are ways to prevent or minimize the impact of BPC attacks:"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/new-kovter-campaign-spreads-via-malicious-advertisements-in-pornhub", "date": "October 11, 2017", "title": "New KOVTER Campaign Spreads via Malicious Advertisements in Pornhub", "articleContent": ["A new variant of KOVTER (Detected by Trend Micro as TROJ_KOVTER.AUSKKM and TROJ_KOVTER.AUSKKL) was seen being spread ", " perpetrated by a malvertising group called KovCoreG.  ", "The new variant was apparently spread via adult pornography website Pornhub, prompting visitors with a malvertising pop-up from the advertising network Traffic Junky. The pop-up message spoofs an urgent update—a popular tactic that involves fake browser updates or fake Adobe Flash updates to coerce the user into clicking. The “browser update” leads to malicious Javascript files, while the “Flash update” leads to malicious HTML Application (HTA) files. These files would then install KOVTER on the user’s system. KOVTER’s campaign ultimately results in typical ", " activity, involving pay-per-click online advertising to generate money via fake traffic and clicks.", " saw the campaign spreading across Yahoo! websites under similar circumstances, right down to the use of fake browser and Flash updates as hooks for users to download malicious files. Both Pornhub and Traffic Junky have already taken down the KOVTER-related advertisements.", "KovCoreG specifically targeted the US, the UK and Australian users via the use of both ISP and geographical-based filters, where potential victims number in the millions. In addition, a second check was created to evade analysis. This check involves determining whether the user’s IP address also passed the ISP and geographical filters. If the check fails, the downloaded JS and HTA files will not execute.", "KOVTER has seen many changes, ", " as a police ransomware before eventually evolving into a click fraud malware. Recent campaigns also saw KOVTER being distributed as a fileless malware, which made it more difficult to detect and analyze. Back in August, ", " saw it spread via spam emails. This new campaign sees it turning to malvertising on popular websites to spread—more proof that this trojan will likely see further evolutions as the actors behind it constantly find new methods and avenues to spread it.", "Users can protect themselves from ", " attacks by avoiding suspicious links or pop-ups that appear on their browsers. In this specific campaign, it is highly improbable that a browser or Flash update will be advertised on a pornography website. Even in less-obvious scenarios, users should generally avoid clicking on any links unless they are certain that the link leads to a legitimate or trusted website. In fact, users should regularly update their software via official channels without the need for a special “prompt” or advertisement.", "Adblocker plug-ins can also prevent unwanted advertisements from being displayed on user systems. However, this might also prevent legitimate revenue-generating ads from appearing, thus proper configuration of these types of plug-ins are needed.", "For defending against malvertising campaigns in general, users can employ security solutions that help prevent these kinds of attacks, such as ", ", which protects consumers via a multi-layered defense that delivers highly effective and efficient protection against ever-evolving threats. ", " also protect businesses against these types of threats by providing threat protection techniques designed to eliminate security gaps across multiple users and end-points."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/the-middle-eastern-and-north-african-underground-where-culture-and-cybercrime-meet", "date": "October 10, 2017", "title": "The Middle Eastern and North African Underground: Where Culture and Cybercrime Meet", "articleContent": ["View Digital Souks: A Glimpse into the Middle Eastern and North African Underground", "How much are ", " port numbers in the cybercriminal underworld? In the Middle Eastern and North African ", ", they’re free. ", "Their underground marketplaces aren’t profit-driven like ", ", or ", ". There's an ironic confluence of ideology and cybercrime in this region, where the “spirit of sharing” and sense of brotherhood are the apparent forces behind the distribution of crimeware. ", " ", "We also noticed how cultural pleasantries preceded and concluded all kinds of murky business transactions. Ideology often influences what is sold and traded, motivating the kind of activities that transpire within its forums and sites. Many have dedicated sections espousing their beliefs, grouped with how-to guides on encryption, programming, and reverse engineering. ", "Our look into these digital souks also revealed how the Middle Eastern and North African underground is not a ", "’s, but more cautious like the ", ". Potential customers are barred from window-shopping, for instance, and viewing links or full forum posts requires an account. Registration is a lengthy process that involves paying for one’s membership in bitcoins and getting through the language barrier. English-based forums and sites do exist, but there are certain regional variances.", "The products and services that have become cybercriminal staples across the world are also available in the Middle East and North African underground—credit card dumps, online accounts, credentials, and malware. Stolen identities abound here, in bundles that include passport scans and copies of driver’s license and local utility bills. The marketplaces are also rife with do-it-yourself kits that provide the resources that even beginners can use to launch their own cybercriminal business. Developers typically sell their malware either as a single binary, or a bundle of binary and builder; and in some cases, access to a command-and-control (C&C) infrastructure.", " ", "Regionalized hosting spaces and access to Remote Desktop Protocol (RDP) servers are offered, along with cashout services that include stolen physical goods. Of note are mobile devices and disposable SIM cards whose purchase in many Middle Eastern and North African countries requires a passport, biometric registration, or personally identifiable document.Other offerings include purportedly secure virtual private networks as well as advanced worms and remote access Trojans. Social media is also abused to peddle contraband. The notorious ", " ", " is sold for $50. Other well-known families are sold, such as ", ", which we saw peddled by a cybercriminal from the Russian underground. ", "How much do these products and services cost? What are their real-world implications? And more importantly, what is their underground’s outlook in the grander scheme of cybercrime? Read about it in on our latest addition to our cybercriminal underground research series, “", "."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/vulnerabilities-and-exploits/vulnerabilities-in-wpa2-reportedly-expose-wi-fi-enabled-devices-to-eavesdropping", "date": "October 16, 2017", "title": "Vulnerabilities in WPA2 Reportedly Expose Wi-Fi-Enabled Devices to Eavesdropping", "articleContent": ["Several security flaws in the Wi-Fi Protected Access 2 (WPA2) protocol were recently ", ", which can reportedly expose wireless devices to Key Reinstallation AttaCK (KRACK), a proof-of-concept exploit that compromises WPA2’s encryption mechanism. KRACK involves “manipulating and replaying cryptographic handshake messages”—the process of establishing parameters for systems and devices to communicate with each other. ", "WPA2 is used to secure Wi-Fi-enabled devices and hardware through authorization and encryption mechanisms. If successfully carried out, KRACK can enable attackers to eavesdrop on the network traffic traversing between the device and Wi-Fi access point. ", " noted that the advisory issued by the United States Computer Emergency Readiness Team (US-CERT) to certain organizations described the vulnerabilities to be related to the handshake used to generate the key that encrypts the traffic. The key, when resent multiple times, can be reused, even if it’s supposed to be a nonce (that is, it can only be used once). ", " ", "Ars Technica quoted, “US-CERT has become aware of several key management vulnerabilities in the 4-way handshake of the Wi-Fi Protected Access II (WPA2) security protocol. The impact of exploiting these vulnerabilities includes decryption, packet replay, TCP connection hijacking, HTTP content injection, and others. Note that as protocol-level issues, most or all correct implementations of the standard will be affected.” ", "According to the researchers, 41% of Android devices are susceptible to variants of KRACK, while Linux systems are also heavily impacted. Apple, Windows, OpenBSD, MediaTek, and Linksys devices were also noted to be affected by the vulnerabilities. The security flaws have been designated with the following CVE identifiers:", " ", " ", " and Frank Piessens, the researchers who uncovered the vulnerabilities, are scheduled to present their findings at the ", " ACM Conference on Computer and Communications Security (CCS). Both also have other researches on WPA2 security: their latest research took cues from the previous findings they ", " at the Black Hat Conference held last August. It detailed the logical implementation flaws in certain protocols used in Wi-Fi handshakes and the countermeasures that can be used against them. Last year, they ", " a research paper on how group keys in WPA2/802.11 can be decrypted and misused. ", " ", "Given the potential impact of the vulnerabilities, IT/system administrators, information security professionals, and end users are recommended to adopt best practices to mitigate possible attacks on Wi-Fi networks and devices:"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/vulnerabilities-and-exploits/google-home-mini-speaker-discovered-eavesdropping-on-home-user", "date": "October 12, 2017", "title": "Google Home Mini Speaker Discovered Eavesdropping on Home User ", "articleContent": ["Of all the potential horror stories that dissuade users from adopting Internet of Things (IoT) devices, one of the most common is the unauthorized monitoring of their private lives. One similar incident involving Google’s Home Mini speaker was discovered by Artem Russakovskii of ", ", who reported that the device was listening and recording all the sounds it picks up in its vicinity.", "The Home Mini speaker was just recently unveiled during an event in San Francisco, which was attended by members of the media. The bug was discovered after Russakovskii, who was given a review unit, started noticing unusual behavior with the device, such as constantly interrupting TV shows to answer unrequested queries. After checking his Google activity page, Russakovskii noticed audio clips recording the sounds in his home. While it’s normal for clips of audio queries to be recorded, other sounds in the house are not.", "Google was contacted regarding this matter, and the company identified the problem as being related to the touch panel, which is used to activate the Assistant via a long press. Google has already updated the Home Mini speaker’s software to disable the functionality that causes the bug. All the Home Mini speaker's recordings uploaded to Google's services have also been deleted.", "It’s also fortunate for both Google and potential buyers that this bug—which was found in early-release units for press and reviewers—was caught this early, as the Home Mini speaker will not officially hit stores until October 19. Still, this incident shows that there are still many issues that plague IoT devices, one of which is the issue of privacy.", "Although this bug was clearly non-malicious, IoT devices have had a history of being used for malicious purposes. Perhaps the most notorious of which was the ", ", which turned infected devices into \"zombies\" for a botnet. 2017 saw the ", ", another botnet that used IP cameras to pull off Distributed Denial-of-Service (DDoS) attacks.", "The Google Home Mini is an example of a voice-enabled device that's often integrated into homes for controlling home functions. Unfortunately, this functionality brings about potential security and privacy problems, especially if an attacker manages to gain control of one. Manufacturers also often use these devices to collect and store data, including voice and sound files as well as user habits, sometimes without knowledge from the user.", "While the Google Home Mini speaker issue was due to a manufacturer error, users themselves can protect themselves from IoT-based attacks by implementing a few easy security measures:", "Connected devices can be protected using security solutions such as ", ", which can check internet traffic between the router and all connected devices.  It comes with web protection and deep packet inspection, leveraging the right capabilities that can weed out potential threats before they enter the home."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/ransomware-recap-dark-web-ransomware-economy-on-fire", "date": "October 17, 2017", "title": "Ransomware Recap: Dark Web Ransomware Economy on Fire", "articleContent": ["According to a security firm’s ", ", 2017 has seen a 2,502 percent growth in the ", " dark web economy. The same research also found over 6,300 places where cybercriminals had advertised ransomware services, along with over 45,000 ads.", "The researchers that delved into the dark web for ransomware operators or ransomware related services found that the dark web's ransomware economy grew from $249,287.05 in 2016 to $6,237,248.90 in 2017. The booming ransomware economy can be attributed to the emergence of Bitcoin for ransom payment, and the obscure nature of Tor, which helps cybercriminals mask their illegal activities. Since the transaction flow of Bitcoin is almost untraceable, identifying the account holder is nearly impossible. These two factors have allowed ransomware operators to hide underground, ultimately contributing to the growing ransomware economy.", "In addition, the research also finds ransomware entrepreneurs earning as much as $100,000 yearly by selling their product. That amount is a far cry from the roughly $69,000 that legitimate software developers earn, according to figures from PayScale.com.", "Here are the other notable ransomware stories:", "Critroni or Curve-Tor-Bitcoin (CTB) Locker or ", " ransomware was also seen being peddled in a Turkish underground forum by a Russian cybercriminal going by the handle ", ". This malware notably utilizes elliptic curve cryptography instead of the commonly used RSA or AES. Moreover, CTB-Locker uses Tor to mask its C&C communications to hide from law enforcement agencies.", "Another variant was also discovered arriving in spam emails that contain HTML attachments. The email subject is about a delivered invoice, with a message that tells the recipient to open the attached file. The HTML attachment has the filename of 'A_[Random Numbers].html', and is already detected as ", ".’", "A new BTCWare ransomware variant is ", " making the rounds, targeting victims by hacking into poorly protected remote desktop services and then manually installing the ransomware. Appending encrypted files with a .[email]-id-id.payday extension name, this variant uses a ", " feature that makes the affected files impossible to crack.", "BTCWare’s ransom note advises victims to pay a certain amount in bitcoin to regain access to the encrypted files; the specific price will depend on how fast they write to the ransomware operator. The note also warns victims to avoid attempting to decrypt their files with the help of third parties as it could increase the amount of the ransom payment.", "Meanwhile, Polsky (detected as Ransom_POLSKY.A) is a new ransomware variant written in Polish. Encrypting files via the AES-256 algorithm, Polsky demands $100 for the necessary decrypt key. The variant also warns that the ransom payment will double to $200 if the ransom is not paid within four days."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/vulnerabilities-and-exploits/adobe-patches-zero-day-vulnerability-used-in-cyberespionage", "date": "October 17, 2017", "title": "Adobe Patches Zero-day Vulnerability Used in Cyberespionage", "articleContent": ["Adobe has released an emergency/out-of-band security update (", ", for versions 27.0.0.159 and 27.0.0.130) for Adobe Flash Player for Windows, Macintosh, Linux, and Chrome OS. The update addresses a ", " (CVE-2017-11292) that researchers found actively exploited by a group of threat actors known as BlackOasis. ", "According to researchers, BlackOasis exploits CVE-2017-11292 to distribute the information-stealing malware FinSpy, a", "(detected by Trend Micro as BKDR_FINSPY.A, TROJ_FRS.0NA003JC17, and WORM.Win32.TRX.XXPE002FF019). Last September, the group used a separate remote code execution (RCE) vulnerability (", ") to deliver a variant of the spyware, which is ", " being sold by its developers and operators as a suite of surveillance software. Researchers note that the attacks they’ve observed in the wild are targeting Windows machines. ", "BlackOasis’s attack involves the use of ", " emails sent to targets of interest. These malicious emails are attached with a Flash exploit within an ActiveX object embedded in a Word document. The infection chain is multi-stage, using several scripts to retrieve, decrypt, and execute the payload. ", " is a memory corruption flaw that can let an attacker execute arbitrary code on a vulnerable system when successfully exploited. Attackers can lure victims with specially crafted Flash content. While it’s currently reported to be used in targeted attacks, its public disclosure is likely to make others employ it for their own cybercriminal activities. In fact, some of the other vulnerabilities that BlackOasis use in their campaigns have been employed by other cyberespionage and cybercriminal groups:", "BlackOasis uses sociopolitical themes as social engineering lures. Like other cyberespionage groups such as BlackTech, ", ", and ", ", BlackOasis employs decoy documents to divert the would-be victim’s attention away from their ulterior motive: steal confidential, mission-critical information. The researchers that monitored BlackOasis note that it is currently targeting ", " politicians and United Nations officers, as well as journalists and activists. BlackOassis’s activities and FinSpy were also observed in Russia, the U.K., Afghanistan, Iraq, Iran, and African countries. ", "Indeed, vulnerabilities are the bread and butter for many targeted attacks, and ", " in defending against them. In the first half of 2017, ", " were reported and disclosed via Trend Micro’s Zero Day Initiative, 92 of which were from Adobe—a number that's markedly higher than that of the second half of 2016. Enterprises need to balance their need for maintaining the infrastructure that drives their organizational operations, and the significance of securing them. Defense in depth provides layers of protection against threats that take advantage of security gaps. Some of the best practices to defend against these types of threats include:"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/details-on-past-data-breaches-from-disqus-bitly-and-kickstarter-revealed", "date": "October 10, 2017", "title": "Details on Past Data Breaches from Disqus, Bitly and Kickstarter Revealed", "articleContent": ["This past weekend saw three data breach revelations. Blog comment hosting service Disqus announced that a  past data breach affecting millions of user accounts occurred, while details on 2014 data breaches from link management platform Bitly and crowdfunding platform Kickstarter were also disclosed.", "The largest number of affected users came from the Disqus hack, which occurred in 2012. The company ", " that 17.5 million email addresses were exposed due to the hack, which included information such as usernames, sign-up and last login dates in plain text, as well as salted passwords hashes using SHA-1. Some of the information included in the hacked user database date back to 2007.", "The breach was discovered after researcher Troy Hunt of data breach tracker ", " initially disclosed to Disqus on October 5 that their information was possible exposed. Immediately after, the company obtained the affected data to verify and analyze, after which it started contacting users and resetting the passwords of the accounts included in the breach.", "Disqus stated in their blog post that the exposed data is neither widely distributed nor easily available. However, they recommended that all users—even those whose account information was not in the database—change passwords for security purposes.", "Additional information culled by ", " revealed more breaches that affected 9 million Bitly users and 5.2 million Kickstarter users. Both of these breaches apparently occurred in 2014. Although both companies had already acknowledged the breaches in separate ", ", neither actually listed the number of accounts affected. Bitly did post guidelines for their users to protect them from the potential effects of the breach—notably by changing their API keys and OAuth tokens, while Kickstarter users were encouraged to change their passwords.", "In order to secure their accounts further, all users of online services—and not just those who are potentially affected by data breaches—should make it a habit to change passwords regularly.  This greatly minimizes the chance that an attacker who has access to user information can access the actual accounts. For users with multiple accounts, the use of a ", " provides an efficient method for tracking and managing both user IDs and passwords from a single application."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/best-practices-how-to-secure-your-social-media-accounts", "date": "October 04, 2017", "title": "Best Practices: How to Secure Your Social Media Accounts", "articleContent": ["The most popular social media platforms have billions of users, and the number keeps getting bigger every year. The juggernauts of the field—Facebook, YouTube and Instagram to name a few—have gone beyond their initial purpose of sharing, entertainment, and communication. Now, enterprises see them as valid advertising tools and users have built careers out of sharing content. Not only that, other applications are using major social media accounts to validate user identity—you can sign up for different apps and games just ", ". And employers now routinely ", " on social media, using it as a type of character check.  ", "Because of the multi-purpose aspect of social media platforms, they become valuable tools that the average person spends approximately ", " on every day, according to a recent study. Because they are such ubiquitous platforms, and being linked to an increasing number of applications on phones and other devices, it becomes even more necessary to secure them.", "Below are some best practices for social media management for users and enterprises.  ", "The different social media platforms have security features that you should take advantage of. Here are some tips for ", ":", "Social media is also used as the public face of enterprises or even entrepreneurs who use it as an advertising tool or an avenue to establish their brand. Hackers sometimes take over a company’s social media to ", ", gain followers, or even spread a specific message. This form of ", " is an ongoing problem, especially with Twitter accounts.", "Here are some tips to keep ", ":", "One of the biggest issues facing social media platforms is their role in the distribution of fake news. Some platforms have already started addressing the subject and are ", ", but there are still a lot of ways to use social media for spreading fake news. Cyberpropaganda has been around for years, but 24/7 social media platforms allowed opportunistic hackers to manipulate public perception quickly and efficiently. Twitter bots push fake stories in campaigns that are big enough to sway public opinion, fake Facebook stories are designed to catch likes and spread news, and popular platforms in other countries deploy similar tactics as well. News is easily created but difficult to verify. ", "Because the platforms themselves are having a hard time managing fake news, users become the first line of defense. You have to protect yourself from being a victim of fake news, and also work to stop spreading misinformation.", "To check if a story is real, do the following:", "Of course, there is always a chance that you could be compromised by a hacker—even after following best practices. Secure your social media accounts with comprehensive and multilayered protection. Effective and comprehensive security solutions can help you enjoy your digital life safely. ", " secures multiple devices, helps manage passwords, and guards against the most prevalent online threats."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/-ransomware-recap-is-redboot-really-a-wiper", "date": "October 02, 2017", "title": " Ransomware Recap: Is Redboot Really a Wiper?   ", "articleContent": ["The ", " known as Redboot (detected by Trend Micro as RANSOM_REDBOOT.A) leaves victims little hope of recovery as early analysis shows that, along with file encryption, it also alters the master boot record (MBR) and repartitions the hard drive. Because of its ability to cause irreversible damage, Redboot could be classified as a wiper rather than a ransomware. However, ", " say that the authors have confirmed the ransomware is still being developed and will be released in October.", "Redboot is a compiled AutoIT executable that will extract five files (assembler.exe, boot.asm, main.exe, overwrite.exe, and protect.exe) into the directory where the launcher was executed. Using these files, it will overwrite the computer’s current master boot record, scan and encrypt files, and also block system tools (like Task Manager) used to help analyze and stop infection. With no distinct way to restore the MBR or the partition, victims of this ransomware are likely to lose their data.", "We observed ", " in a recent spam campaign, opening up the possibility of a victim being infected with two kinds of ransomware from one source. But a larger spam campaign was also detected targeting millions of users. The campaign uses different kinds of spam mail, some from companies sending invoices and others with more generic senders and unidentified attachments.", " ", " ", "The attacks were scattered across the globe, but according to the Trend Micro Smart Protection Network (SPN), the prime targets were ", ". On September 18, a variant of Locky started using .yckol (\"locky\" reversed) as an extension for encrypted files. Their ransom also went down to .25 Bitcoin (around US$1,000), possibly because of the rising value of BTC.", "Bad guys are updating existing ransomware variants and developing new families. SamSam, a crypto-ransomware that we last ", ", has a new variant that now appends .myransext2017 to the files it encrypts. The CypherPy ransomware (detected by Trend Micro as RANSOM_CYPHERPY) and BlackMist (detected by Trend Micro as RANSOM_BLACKMIST) are two new families that have been recently spotted. InfinityLock (detected by Trend Micro as RANSOM_INFINITYLOCK) is a new family as well, with a gimmick that shows the hacker supposedly encrypting the victim’s files in “real time”.", "Meanwhile, Sapnupuas (detected by Trend Micro as RANSOM_SAPNUPUAS and also called nRansom) is a particularly contentious ransomware that is not after ransom money but asks for nude photos instead. Recently the ransomware developers made even more outlandish demands, asking victims to murder ten people and send them a video.", "Ransomware will continue to spread, and developers are expected to keep developing their tools and aim at new targets. To defend against the steady tide of evolving ransomware variants, enterprises and users should ", " and invest in multilayered security solutions. "]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/vulnerabilities-and-exploits/wordpress-woes-a-fake-plugin-and-three-zero-day-vulnerabilities-found", "date": "October 03, 2017", "title": "WordPress Woes: A Fake Plugin and Three Zero-Day Vulnerabilities Found ", "articleContent": ["A ", " containing a backdoor and ", "—all affecting the high-profile blogging platform WordPress—were recently discovered. The backdoor was discovered masquerading as ", ", which is a fairly popular tool (with over 100,000 installs) designed to fight spam. The three-zero day exploits, which are being exploited in the wild, were tracked down by security analysts of WordPress’ security plugin Wordfence.", "Tagged as X-WP-SPAM-SHIELD-PRO, the backdoor can ", " disable other security-related tools, steal data, and add a hidden admin account. Security researchers ", " the fake plugin had a seemingly legitimate structure and file names, but they are actually fake. In addition, the backdoor can allow attackers to upload anything to the site.", "One of the files in the plugin has ‘class-social-facebook.php,’ which, on the surface, looks like it blocks potential unwanted Facebook spam. But further analysis revealed that it was designed to break the website, potentially making it unusable. This is done by listing all the active plugins within the app installation", " and then disabling all of them. Two other files named ‘class-term-metabox-formatter.php’ and ‘class-admin-user-profile.php’ can be used by attackers for data gathering purposes.", "Another file called ‘plugin-header.php’ was designed to add an additional administrator account to the site, which allows the attacker to delete the exploit files, while also revealing the username, password, and the email that can be used to login to the compromised website.", "The fake plugin also possesses code that it can use to ping home, notifying attackers each time an administrator activates it on the website.", "Meanwhile, websites that utilize certain plugins may be exposed to potential attacks after zero-days were found in three separate WordPress plugins: Appointments, RegistrationMagic-Custom Registration Forms, and Flickr Gallery.", "Called PHP Object Injection Vulnerability Severity 9.8, the vulnerability allows attackers to manipulate a vulnerable website into fetching a remote file (a PHP backdoor) and save it to their preferred location. The scheme doesn’t require authentication or elevated privileges. For websites that run Flickr Gallery, it only takes sending the exploit as a POST request to the site’s root URL to get the job done. For Appointments and RegistrationMagic-Custom Registration Forms, the request would go to admin-ajax.php. If the attacker gains access to the plugins’ backdoor, it's possible to take control of the vulnerable site.", "The discovered vulnerabilities have been ", " in the following versions:", "IT professionals and web developers/programmers can mitigate threats that may abuse web-based platforms like WordPress through the following best practices:", "Trend Micro’s endpoint solutions such as ", "™ ", ", and ", "™ ", " protect end users and businesses from these threats by detecting and blocking malicious files and all related malicious URLs."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/by-the-numbers-are-your-smart-home-devices-being-used-as-cryptocurrency-miners", "date": "October 05, 2017", "title": "By the Numbers: Are Your Smart Home Devices Being Used as Cryptocurrency Miners? ", "articleContent": ["Most people are familiar with malware that encrypt files for ransom or attempts to steal information, but now cybercriminals are devoting resources to directly chasing cryptocurrency. This way, they can bypass any obstacles and directly go for a decentralized—and rapidly appreciating—currency that guarantees anonymity.", "Trend Micro data shows that more and more home devices are being compromised—in fact, we detected over 90% more home network mining activities in September compared to July. Historically, compromised devices are comprised of ", " that can become part of botnets that can be used for distributed denial-of-service attacks. Now, these devices, which include home routers, IP cameras, and even smartphones, are being turned into cryptocurrency miners.", "Often the owners aren’t even aware that their devices have been compromised. A slight performance lag may be the only hint that the device is being used to line criminals’ pockets.", "Bitcoin value has seen a meteoric rise over the past few months, from a value of roughly US$1,000 in April to over ", " at the time of writing. A number of ", " were discovered around the time the currency started to appreciate. One example used the known ", ". It first hit South America in May 2017 and attacks are still ongoing. The collective computing power from the infected machines, and the rising value of cryptocurrencies, allow for significant profits. In August 2017, we saw a cryptocurrency miner using the same exploit used in the WannaCry and Petya ", ".", "[READ: ", "]", "As many have noted, it takes a huge amount of ", ", and the rising value will only motivate attackers to pursue it directly using more aggressive means. With attacks like ransomware, criminals only receive the amount that the victim is able or willing to pay. Mining cuts out the middleman and allows them to take the profit directly.", "Most IoT devices are known to be vulnerable to a range of malware types. Most famously, the malware ", " (mostly home devices), creating the largest botnet ever recorded. A ", " began to spread in April 2017.", "[READ: ", "] ", "Unsecured home routers are typically used as the malware's entry point into a network. Most of the smart devices are connected to your router, and as such the router becomes ", ". If the router is compromised, the other devices connected to it could easily be compromised and turned into bots used to mine cryptocurrency.", "Typically these routers come with default credentials (usernames and passwords) that are easily bypassed. The first step is to change the default credentials and use more complicated passwords. Here are other tips:", "As cryptocurrency miners creep into the home, more and more smart devices are turned into unwilling accomplices. Cybercriminals steal resources to fund their operations or simply get rich. As the currency continues to gain legitimacy and rise in value, we should expect cybercriminals to ramp up their mining activities. To better protect users from IoT malware and similar threats, the ", " solution features web protection and deep packet inspection capabilities.", "Updated image with the latest data from Trend Micro Intrusion Prevention System "]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/yahoo-all-three-billion-user-accounts-affected-in-2013-data-breach", "date": "October 04, 2017", "title": "Yahoo!: All Three Billion User Accounts Affected in 2013 Data Breach                 ", "articleContent": ["Yahoo! ", " that all three billion of its user accounts were compromised in a 2013 data breach. This new number easily dwarfs an earlier figure of ", ". Yahoo! has already sent notifications to the additional user accounts that were affected.", "An ", " revealed that all Yahoo! user accounts existing at the time of the 2013 breach were affected. The stolen user account information may have included names, email addresses, telephone numbers, dates of birth, hashed passwords (using MD5) and, in some cases, encrypted or unencrypted security questions and answers. ", "Similar to Yahoo!’s preceding statements regarding the data breach, the investigation maintains that the user account information that was stolen excluded passwords in clear text, payment card data, or bank account information. Experts, however, suspect the security of the aforementioned data because they believe it was only protected with outdated and easy-to-crack encryption.", "After disclosing the increased number of affected accounts, Chandra McMahon, Chief Information Security Officer of Verizon, assured users that ", "Many data breach incidents highlight the need for strict and effective policies on data management and protection. User information that may include PII is a natural target for cybercriminals because it can be abused in a number of ways. Companies who store user data like Yahoo! should implement strict security policies since the data they collect has become valuable targets for hackers.", "Meanwhile, users could prevent their data from being stolen by paying attention to their ", ", especially when it comes to ", ". Just to be sure, users should visit Yahoo!’s ", " for tips on how to secure accounts. They could also follow these best practices to mitigate potential damage caused by a data breach:"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/vulnerabilities-and-exploits/apache-tomcat-spotted-with-vulnerabilities", "date": "October 05, 2017", "title": "Apache Tomcat Spotted with Vulnerabilities", "articleContent": ["Vulnerabilities in Apache Tomcat, which is ", " as the world's most widely used web application server used in over 70 percent of enterprise data centers, were uncovered and patched the past few weeks. Among these are two remote code execution (RCE) vulnerabilities that allow remote attackers to execute arbitrary code, and one that can be exploited to bypass security constraints and view sensitive information.", "Apache Tomcat developers ", " the discovery of the most recent bug on October 3. According to the developers, the vulnerability designated as ", " affects systems that have the HTTP PUT method enabled, which can be done by setting the", " initialization parameter of the Default servlet to ", ". CVE-2017-12617 allows attackers to upload a malicious JSP file to a targeted server using a specially crafted request. Subsequently, the server would execute the code in the JSP file when the file is requested. According to a ", ", an attacker would not be able to upload a malicious file if the ", "initialization parameter is set to ", ".", "Here’s the list of affected versions and the links to their respective fixes:", "To mitigate the risk of exploitation, users of the product were advised to upgrade to later versions where the vulnerability is fixed.  ", "Addressed on September 19 before the emergence of CVE-2017-12617, ", " is similar to the former, which existence it owes to the incomplete fix for the latter. This vulnerability was found in Apache Tomcat versions 7.0.0 to 7.0.79, and users were ", " to upgrade to version ", " or later.", "The other vulnerability, ", ", is an issue that stems from the ", " or misuse of the VirtualDirContextfeature", " which should not be utilized in production environments, but only to ease development with IDEs without needing to fully republish jars in WEB-INF/lib. The vulnerability can bypass security constraints or view the source code of JSPs for resources served by the VirtualDirContext using a specially crafted request.", "Attackers generally require access to a vulnerable machine to deploy attacks remotely. Aside from timely application of patches, users can prevent threats that may exploit Apache Tomcat vulnerabilities by reviewing access to critical systems and ensuring policies and perimeter security is up-to-date."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/vulnerabilities-and-exploits/new-macos-high-sierra-leaks-users-apfs-volume-passwords", "date": "October 06, 2017", "title": "New macOS High Sierra Leaks Users’ APFS Volume Passwords", "articleContent": ["Apple just released a supplemental update for the recently launched macOS High Sierra 10.13 operating system to address various bug fixes, ", " that leaks a user’s password. A ", " from Brazil discovered the flaw in High Sierra, which features a new file system called Apple File System (APFS). Users who have installed the latest High Sierra version are advised to patch to prevent potential compromise on their operating systems.", "Affecting Macs with a solid-state drive (SSD), High Sierra leaks passwords for encrypted APFS volumes through the password hint. APFS is the default file system in macOS High Sierra for Mac computers with all-flash storage. When macOS High Sierra is installed on the Mac volume of an SSD or any other all-flash storage device, that volume is automatically converted to APFS. While APFS is ", " to feature strong encryption and improved file system fundamentals, it was apparently not big on protecting user passwords.", "Developer Matheus Mariano ", " that the password leakage happens after using the Disk Utility to add a new encrypted APFS volume to the container. Whenever a new APFS volume is added, users are asked to enter a password and, optionally, write a hint for it.", "Upon mounting the new volume, the user will be asked to enter the password. This is the part where Mariano noticed that when the ", " button is clicked, it displays the actual password set by the user and not the hint. No password will be shown if the user did not provide a password hint when creating a new volume.", "For those who see their password instead of a password hint for an encrypted APFS volume, Apple provides a ", ":"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/vulnerabilities-and-exploits/siemens-update-addresses-critical-vulnerability-found-in-measuring-device", "date": "October 09, 2017", "title": "Siemens Update Addresses Critical Vulnerability Found in Measuring Device", "articleContent": ["Siemens recently ", " that addresses a vulnerability found in one of their measuring devices that could potentially allow an attacker to bypass built-in authentication measures and take control of the machine. Discovered by researcher Maxim Rupp,", " affects the ", ", a multichannel measuring device that allows users to monitor their energy consumption via easily installed sensors. The device then displays measurements for current, voltage, and power on either a web browser or an app that is available for both iOS and Android.", "A successful exploit of the vulnerability in the product’s integrated web server gave an unauthenticated remote attacker administrative control over the device via the web interface.", "The company advised users of 7KT PAC1200 devices to update their firmware to version 2.03, which fixes the vulnerability. The ", ", which also issued an advisory regarding the vulnerability, also provided the following recommendations to mitigate the effects of CVE-2017-9944 and other similar vulnerabilities:", "Industrial devices are crucial to an organization’s operation, thus securing these devices should be of utmost importance. While there are a number of ways ", ", there are also ", " that can be implemented to protect industrial control systems. These include:"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/-spam-bec-ransomware-the-continuing-abuse-of-email-by-old-and-new-threats", "date": "September 28, 2017", "title": " Spam, BEC, Ransomware: The Continuing Abuse of Email by Old and New Threats ", "articleContent": ["Opening an email didn’t seem as harmful as it sounds like before the advent of email threats. The current reality, however, couldn’t be more different. Many businesses across the globe have suffered through hefty payouts, paralyzed systems, and damaged reputations after simply opening an email with malicious content. The scope of attacks and the rampant rate with which the abuse of email managed to inflict on businesses and users points to the effectiveness of email-borne threats.", "Email remains a major infection vector for malware threats, with attackers ", " to employ schemes such as the bogus invoice or supplier swindle and employ keylogger malware or HTML pages in phishing emails to trick employees and executives. Similarly, ", " operators ", " to utilize email to spread their malware. Just last week, a sizeable spam ", " was detected distributing the latest Locky variant alongside another ransomware called FakeGlobe, launching ", " in a single day. ", "Email’s favorite poison, spam, is evidently the common denominator of major attacks the past few years. The latest Locky outbreak is a testament to how far spam has come since its first incarnation as annoying text strings, when email was ", " to advertise products and services for phishing purposes or to drive recipients to compromised or malicious sites. While in the beginning, spam was relatively less harmful to its recipients, it has now evolved to deliver more serious threats.", " ransomware, which was also sent in spam emails, continues to thrive this year with its new defense mechanisms and refashioned encryption routines. Spammers have also ", " capitalized on the ", " outbreak by sending emails claiming to protect and recover systems, but they just steal recipients’ data. Other new and old email-borne threats with fresh routines have also come out in 2017, and it may be a cause for concern. Historically, these threats were mostly distributed via spam emails.", " (detected as Ransom_LOCKY.DLDTATN, Ransom_LOCKY.TH817, Ransom_LOCKY.DLDTATT, and Ransom_LOCKY.AJA), a new ", " ransomware variant, was discovered sporting a new arrival vector.  The variant arrives as an email with a ZIP compressed attachment that contains a Visual Basic Script (VBS) or JavaScript file", " which initiates a downloader that reaches out to its C&C servers to download the ransomware. Another ransomware variant, ", " (detected by Trend Micro as Ransom_REYPTSON.B), is a threat that manipulates a popular email application to send malicious email directly to its potential victims. It was discovered abusing the free email program Mozilla Thunderbird to infect email recipients. The variant scans Mozilla Thunderbird for Simple Mail Transfer Protocol (SMTP) credentials, collects any it finds, and sends them to its remote servers.", "Meanwhile, a ", " version of the banking Trojan Emotet (", ") can log into email services using a stolen account name and password to distribute spam. This renders traditional anti-spam techniques useless because the email is sent from a legitimate email address. TrickBot, another banking Trojan which is an iteration of older malware ", ", is equipped with ", " designed to steal data saved by Microsoft Outlook by opening relevant registry keys.", "Old tricks also get a makeover via a typical phishing tactic that uses ", " instead of a macro. Discovered two months ago, this new threat targeted energy facilities in the U.S. with emails containing fake resumes or environmental reports in Word documents that can silently harvest the user's credentials if opened.", "Data from the Trend Micro Smart Protection Network™ reveals a notable increase in the number of blocked spam emails since 2011, which means that spam threats can be expected to be even more prevalent. Last year’s number almost doubled from 2015 with 75 billion spam emails blocked, and this year, Smart Protection Network already recorded 34.4 billion blocked spam threats for the first half of 2017.", "In comparison to 2016’s 25.6 billion, there is a strong indication that distribution of spam threats is going to be more widespread in the second half of 2017. If the numbers for the second half of the year are on track to surpass last year’s 49.1 billion, it will overtake 2016’s numbers. It’s also possible that it could equal, or even exceed, the spam record of 2011.", "Business email compromise (", ", while not new, continues its upward trajectory, causing an increasing number of victims and business losses. In 2016, BEC attacks cost businesses worldwide ", ", while the Federal Bureau of Investigation (FBI) said that the global losses due to BEC have currently reached $5.3 billion.", "There's a new emerging ", " involving the use of HTML pages instead of executable files. In this scheme, the page asks the recipient to enter their username and password to view the document file.", "Email-based threats, whether it is BEC, spam, or the many other new and forthcoming threats, should be seen for what it is: a security issue that is as alarming as the malware that uses it to profit or steal from its victims.", "It is highly recommended to build a culture of security to combat email threats as it is an important communication tool for business organizations. Cybercriminals will use different kinds of", " to coerce potential victims into downloading files or giving out sensitive information", " so it is important to educate employees on ", ". Network administrators should also ensure that ", ", including ", " and ", ", are properly configured. In addition, IT professionals should adopt security measures such as Sender Policy Framework (SPF), Sender ID, DomainKeys Identified Mail (DKIM) and Domain-based Message Authentication, Reporting & Conformance (DMARC) to prevent the spoofing the company domain.", "[", "]", "The rise of spam levels along with new e", "mail-borne threats also calls for a multilayered and proactive approach to security—from the ", ", ", ", ", ", and ", ". Trend Micro endpoint solutions such as ", "™ ", " and ", "™ ", " can protect users and businesses from these threats by detecting malicious files, and spammed messages as well as blocking all related malicious URLs. ", " ", "™ has an email inspection layer that can protect enterprises by detecting malicious attachment and URLs.", "™ ", " is a no-maintenance cloud solution that delivers continuously updated protection to stop spam, malware, spear phishing, ransomware, and advanced targeted attacks before they reach the network. It protects Microsoft Exchange, ", ", Google Apps, and other hosted and on-premises email solutions.", "™ ", "™ with ", "™ endpoint security infuses high-fidelity machine learning with other detection technologies and global threat intelligence for comprehensive protection against advanced malware."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/retefe-banking-malware-starts-leveraging-eternalblue", "date": "September 28, 2017", "title": "Retefe Banking Malware Starts Leveraging EternalBlue", "articleContent": ["A recent upgrade in the propagation capabilities of the Retefe banking Trojan (detected by Trend Micro as TROJ_RETEFE.ASUAN), as well as a few other developments in the banking malware landscape this month, shows how malware developers are ramping up their operations.", "A recent ", " details how the developers behind Retefe added a new functionality to the malware that leverages ", " (addressed by ", "), an infamous exploit connected to ", " and ", " ransomware attacks. Retefe is not the first banking Trojan to upgrade its propagation techniques—", " also took inspiration from the WannaCry and Petya outbreaks.", "Security researchers noted that this new spate of Retefe campaigns has been spreading across different regions over the past few months. Typically this malware targets users in Austria, Sweden, Switzerland, Japan and recently the United Kingdom. The malware is distributed by malicious emails with “.lnk” shortcuts. If the attachment is opened and permission is given, a PowerShell command is triggered to download a self-extracting archive hosted on a remote server. Within the archive is an obfuscated JavaScript installer that implements the EternalBlue exploit, Eternal Blue then downloads a PowerShell script which installs Retefe. Most other banking Trojans use fake login pages on top of legitimate sites to steal credentials, but Retefe works by modifying the computer’s proxy settings and redirecting traffic to malicious sites hosted on remote servers.", " note that on September 20, the implementation of EternalBlue was modified and the module responsible for lateral spreading was removed, “thus avoiding an infinite spreading loop”.", "Early this month, a new banking Trojan called ", " was also ramping up operations and spreading through third-party app stores. This particular malware targets banking and social apps. Once installed, it uses an overlay to steal user credentials that it passes to a remote server. Red Alert 2.0 also blocks incoming calls from banks, presumably to block verification attempts and notifications.", "This month also saw the ", ". This malware is quite similar to Red Alert: it uses fake overlay screens to steal user credentials and is also capable of ", ". Another consequence is that the malware can bypass SMS-based 2-factor authentication. The newer BankBot targets legitimate apps from banks based in 27 different countries, and ten United Arab Emirates (UAE) banking apps were added to their list.", "Cybercriminals are constantly developing and adding functionality to their malware, and users should be equally vigilant. EternalBlue is a known exploit, and a patch has been available since March 2017. Users can stay protected by keeping their operating systems updated and using multilayered solutions.", "Email and web gateway solutions such as", " and ", " can prevent malware from ever reaching end users. At the endpoint level, ", " deliver several capabilities like high fidelity machine learning, web reputation services, behavior monitoring, and application control, and vulnerability shielding that minimize the impact of this threat. ", "will also be effective in monitoring processes or events that trigger malicious activity.", " can detect connections to malicious C&C and help quickly identify the impacted machines on networks, while ", " can stop MS17-010 exploits from the network through its IPS technology.", "For small businesses, ", " offers cloud-based email gateway security through Hosted Email Security. Its endpoint protection also delivers several capabilities such as behavior monitoring and real-time web reputation in order detect and block ransomware.", "All solutions are powered by ", " endpoint security, which infuses high-fidelity machine learning with other detection technologies and global threat intelligence for comprehensive protection against advanced malware."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/a-look-at-the-threats-to-air-gapped-systems", "date": "September 28, 2017", "title": "A Look at the Threats to Air-Gapped Systems", "articleContent": ["Air-Gapping is a security measure in which organizations such as the military or utility providers physically disconnect portions of their IT infrastructure from their networks to protect their most critical systems from internet-based attacks . The idea behind air gapping is simple: a physically disconnected device can neither be infected by malware that is propagated via the internet nor can it be affected by command-and-control (C&C) traffic. In theory, air-gapped computers are much more secure than connected systems.  ", "Air-gapped systems typically fall into two categories:", "While this entry applies to both situations, it will deal primarily with the first example, as these are the ones that require extra security given their critical nature.", "Compromising an air-gapped system could allow an attacker to steal data ", " the system via data exfiltration.  One example of how this can be accomplished is through the use the use of sound, which has been ", " for transmitting data—the use of the ", " and ", " are more extreme examples of this. A determined cybercriminal can also use unconventional attack methods to infiltrate air-gapped systems— researchers from Israel's Ben-Gurion University of the Negev and Shamoon College of Engineering demonstrated how this can be done. ", " that could “bridge” air-gapped systems via the infrared capabilities of compromised surveillance cameras.", "While these kinds of attacks are certainly possible, attacks on air-gapped systems will more likely involve a tactic that has proven to be effective in nearly all kinds of malware attacks: social engineering. By tricking an individual with access to the air-gapped network into inserting a physical drive, an attacker can bypass all the complicated steps needed to pull off an attack successfully.", "Protecting air-gapped systems involves a multilayered approach to security that starts from the physical setup of the system to the people that interact with it on a regular basis. Here are some strategies that organizations can implement to ensure that their air-gapped systems are secured:", "While air-gapped systems are certainly more secure by virtue of fewer attack avenues, it doesn’t necessarily mean that these systems are foolproof or that they are automatically safe simply by being disconnected from the network. Organizations that employ these kinds of systems should address all possible", " in security to ensure that their air-gapped infrastructure is indeed secure."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/tracking-device-information-for-over-500-000-vehicles-leaked-online", "date": "September 22, 2017", "title": "Tracking Device Information for Over 500,000 Vehicles Leaked Online", "articleContent": ["Data breaches have been hot on the news, with the ", " affecting as many as 143 million people. In ", ", information for car tracking devices coming from the database vehicle recovery and tracking service company SVR Tracking were leaked online.", "SVR (short for “stolen vehicle records”) provides constant monitoring and surveillance of customer vehicles via a tracking device which is attached to an inconspicuous location in the vehicle. This device allows continuous live tracking of the vehicle—up to every two minutes in motion—for as far back as the past 120 days through proprietary software on any device with a live internet connection.", "The leaked repository contains over 500,000 records—including user credentials, Vehicle Identification Numbers (VIN), the exact location of the tracking device, and other collected data. What this means is that anyone who has access to SVR’s database will be able to track the location of any specific vehicle within the previous 120 days. In addition, information regarding the company’s customers and reseller networks were also exposed in the leak.", "The reason for the leak was apparently a misconfigured Amazon Web Services (AWS) S3 bucket that was publicly accessible for some time before the breach occurred. As of the time of this publication, the repository has already been blocked from public access.", "While internet-connected vehicles provide a number of benefits for its users, it also has its own share of downsides, not only with database issues as seen in this leak, but also for ", ". In this instance, where the issue is with a company that handles highly sensitive data, greater emphasis should be made on protecting databases, as any leak or breach can be disastrous, not only for the company but also for their customers.", "Organizations can help prevent this from occurring by the ", ":"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/back-to-school-a-crash-course-on-cybersecurity", "date": "September 24, 2017", "title": "Back to School: A Crash Course on Cybersecurity", "articleContent": ["View Infographic: Back to School: A Crash Course on Cybersecurity", "A previous consumer survey by Trend Micro found that an average college student owns seven tech devices ranging from personal computers and laptops to tablets, smartphones and IoT gadgets. But for an age group that’s known for being tech-savvy, most aren’t paying much attention to securing their privacy and personal information. ", "College lifestyle, too, tends to expose students to threats. Even a seemingly innocuous bit of personal data you give when filing for classes, handing over schoolwork, or setting up your online college account can be used as doorways to infect your devices with malware. ", "Your smartphone is more valuable than you might think—it can be a cybercriminal goldmine of contacts, messages, credentials, financial and personal data, browsing history, and more. Personally identifiable information and credentials pulled from it can be sold in cybercriminal underground marketplaces, used to fake your identity, or rack up fraudulent purchases in your name. ", "The same survey revealed that 65% of surveyed individuals have experienced getting their devices infected with malware, while a further 45% have clicked on malicious URLs or visited unknown/suspicious websites in the past. Indeed, while the rest will see young adults preparing for the next semester and college campus-bound, cybercriminals see them as fresh meat. ", "What can incoming students do to improve their cybersecurity? ", "Cover your bases and adopt best practices. ", " is as widespread as ever, and has, in fact, affected a number of ", " and ", " worldwide. So practice security hygiene: ", " and keep your devices patched and updated. Social media scams abound; strengthen your passwords, and be more prudent when handling unknown or unsolicited emails or text messages. And of course, ensure the ", " of your devices. Investing in security solutions that can seamlessly manage your data while protecting them from malware can also help."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/mobile-safety/go-keyboard-apps-collect-send-user-data-remote-servers", "date": "September 25, 2017", "title": "GO Keyboard Apps Collect and Send User Data to Remote Servers", "articleContent": ["Security researchers recently ", " that two popular Android apps under the GO Keyboard label were collecting user data and transmitting it to a remote server. These same apps were also detected executing code from a third-party server without users’ knowledge. Identified as ", " and ", ", they have 2 million to 5 million installations each.", "In the app’s Google Play page, the developers state a privacy policy:", " ", "The apps' actual activity contradicts the statement. According to news ", ", they collect sensitive user information and dispatch the data back to servers in China. The information includes Google email addresses, language, IMSI, location, network type, screen size, Android version and build number, and the device model.", "The apps also communicate with tracking networks and execute code from a remote server. Google ", " (like dex files) from sources other than Google Play, but the researchers ", " that both keyboard apps do so. They note that some of the apps’ downloaded plugins have been marked as adware or potentially unwanted apps (PUA) by Trend Micro and other security vendors.", "It is unusual for this type of app—millions installed and rated 4.4 or higher—to be suspicious. But their actions clearly violate the policies outlined in Google’s ", " and can be classified as malicious behavior. It only shows that users have to be judicious about the apps they install on their phones and follow ", " for mobile safety. Users also have to be wary of the permissions they grant to apps—the more permissions they have, the more data they can collect. Keyboard apps have access to everything that is typed and can be tweaked to become keyloggers.", "[READ: ", "]", "Both apps are still available on Google Play at the time of writing. The researchers notified Google about their findings, but the company has not replied.", "To combat mobile threats, it is important to find the right security solution for all your devices. End users can benefit from multilayered mobile security solutions such as ", " (available on", "). And ", " includes Mobile Security and proactive protection for up to 5 PC, Mac, Android and iOS mobile devices. Trend Micro’s ", "e (MARS) already covers Android and iOS threats using leading sandbox and machine learning technology. It can protect users against malware, zero-day and known exploits, privacy leaks, and application vulnerability."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/virtualization-and-cloud/verizon-s-internal-data-exposed-on-unprotected-aws-server", "date": "September 26, 2017", "title": "Verizon’s Internal Data Exposed on Unprotected AWS Server", "articleContent": ["2017 has seen several major data leaks that were directly caused by misconfigured cloud servers. In July it was ", " that World Wrestling Entertainment left the information of 3 million fans exposed on an Amazon Web Services (AWS) S3 server—the data was unprotected and stored in plain text. In that same month, as many as ", " as an Israeli-based firm left the data unprotected on an AWS server. And just last week, vehicle recovery company ", "—Vehicle Identification Numbers (VIN), the location of the tracking device on the vehicles and user credentials were all exposed again on a misconfigured storage server.", "On September 22, reports disclosed that ", " as 100MB of information from the internal Verizon system called Distributed Visions Services (DVS) was left unprotected on an AWS S3 server. The DVS system was used for retrieving billing information on Verizon Wireless applications. The researchers involved found usernames, passwords, and Outlook messages from internal communications. They also found sensitive communications and proprietary information in the database—information that could be used to gain deeper access into Verizon’s internal network.", "Simple internal errors could have caused these repeated leaks. It's possible that mistakes were made when setting up the access controls for the AWS S3 storage server buckets. Administrators often give users wide-ranging permissions and allowing almost anyone with AWS credentials to access their data.", "Because of the cloud’s rapid growth, many organizations use the applications without properly securing them. Recent ", " say that poor configuration is the chief culprit for lost data on cloud services. And as more and more enterprises are ", ", effective solutions become a necessity.", "Organizations that rely on the cloud for a large portion of their databases can look into cloud-centric solutions such as ", ", which delivers a blend of cross-generational threat defense techniques that have been optimized to protect physical, virtual, and cloud workloads. It also features ", ", the market share leader in server security, protecting millions of physical, virtual, and cloud servers around the world."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/shift-in-atm-malware-landscape-to-network-based-attacks", "date": "September 26, 2017", "title": "A Shift in the ATM Malware Landscape: From Physical to Network-based Attacks", "articleContent": ["View Cashing in on ATM Malware: A Comprehensive Look at Various Attack Types", "There is no way around it: Compromising automated teller machines (ATMs) could be seen by criminals as hitting the mother lode. Oftentimes there would be reports of unauthorized cash-outs, and upon investigation, skimmers and other attacks by physical means would be the usual suspects.", "Over the years, ATM thefts have been undertaken in a variety of ways: from blowing up safes to gluing on skimmers and attaching fake keypads to installing malware executables. In particular, the use of malware in attacking ATMs has seen considerable adoption among cybercriminals, and one of the primary factors contributing to its sustained use is the fact that many of the targeted machines still use outdated operating systems. Such systems no longer receive critical security updates, so in the most basic sense, system vulnerabilities are not addressed, let alone resolved.", "Among cybercriminals who use malware to attack and steal cash from ATMs, gaining physical access has become perhaps the most common approach. However, these criminals have found an even more nefarious infection vector, where no removable drives are inserted and no incriminating footages or fingerprints are found. There is no indication that the ATMs have been physically tampered with, but still, the machines are found to have been emptied of cash. The machines do not even have to be stationed on shady streets, remote locations, or other unsecured spots to be thus compromised.", "Cybercriminals, in their ceaseless attempt to rake in profits, have found another way to target ATMs: via the bank’s network. It is worth noting that the first entry into the network is usually by social engineering, making bank employees the weakest link in this infection chain. Network-based ATM heists are far more elaborate than physical attacks, but they have proved to be a more profitable money-making scheme.", "Trend Micro and ", "’s European Cybercrime Center (EC3) have collaborated to examine how ATM malware, as a formidable threat, has evolved over the years and continued to gain stealthier features that target a multitude of ATMs.", "[READ: ", "]", "We have known ", " traditional physical access-based attacks on ATMs since ", " when the malware ", ". With such malware, once physical access is gained, the cybercriminals take advantage of the USB port or the CD-ROM drive to infect the ATM. In some cases, they could also connect an external keyboard to be able to operate the machine.", "Since then, different types of ATM malware have entered the scene with their respective capabilities, including dispensing cash or “jackpotting” in its most stripped-down design and often exhibiting the cybercriminals’ penetrating technical know-how on ATMs. In 2016, Trend Micro worked with Europol’s EC3 and uncovered a new ", ". The malware, launched via an executable file, is capable of emptying safes for attackers to net heaps of cash.", "The installation of ATM malware, as represented below, often requires physical access to the targeted machine. Once the malware is installed, the cyber crooks send commands to the machine through the eXtensions for Financial Services (XFS) middleware in order to dispense cash.", "Now, banking institutions should be vigilant not only of malware infection due to poor physical ATM security, but also about the very real possibility of attackers infiltrating their networks.", "Recently, a seeming spate of remotely orchestrated attacks had swept a number of ATMs in different countries. In these attacks, cybercriminals compromised the internal networks of banks in order to infiltrate the ATM infrastructure. Interestingly enough, though, a sophisticated technique like this has not been reported yet in bigger regions such as the United States and Canada.", "A notorious example is the malware ", " in Thailand and reportedly stole around 12 million baht. The attack was coordinated in such a way that the criminals first hacked into the bank’s network and then proceeded to distribute the malware to the ATMs. What is particularly noteworthy here is that Ripper was the first of its kind to infect ATMs without the perpetrators’ having to physically open the machines.", "While network-based attacks require more work than do physical attacks, their appeal lies in allowing cybercriminals to extract cash on command without having to seek out the targeted ATMs. They involve phishing emails, containing malicious executables, to bank employees. Once the malware gets executed, banks’ internal networks are penetrated. Criminals use this network access to move laterally within the banks’ network and control ATMs — even simultaneously infecting multiple machines in a single attack. Some malware families even have self-deleting capabilities, effectively dissolving most traces of the criminal activity.", "To dive deeper into the latest malware developments, the perpetrators of the attacks, and how the digital ATM threat is being leveraged by criminals, see our comprehensive joint report with Europol’s EC3, "]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/mobile-safety/-remote-wi-fi-exploit-for-ios-and-android-released", "date": "September 27, 2017", "title": " Remote Wi-Fi Exploit for iOS and Android Released", "articleContent": ["A researcher from Google Project Zero recently ", " a remote code execution exploit that can potentially take over a range of devices with Broadcom Wi-Fi chips. The exploit was tested on the iOS 10.2 platform, and the researcher added that all versions up to iOS 10.3.3 should be vulnerable as well. The exploit could also affect Android devices and other devices with Broadcom chips.", "The exploit is rooted in ", " and could permit an attacker to insert a backdoor and arbitrarily write commands.The vulnerability is in the firmware of Broadcom chips and allows attackers to trigger a heap overflow. This exploit is similar to ", ", a widely-discussed zero-day that was exposed earlier this year.", "The researcher ", " the severity of attacks related to these types of chips, which are capable of handling Wi-Fi related events without delegating to the host operating system. There have already been", " about how these Wi-Fi controllers are promising avenues for attacking a smartphone because they don’t have strict protections, unlike the core OS or “kernel” of modern phones that are tightly secured.", "Apple’s ", " released last week addressed this vulnerability, and the company released a fix for the tvOS as well. Google patched the vulnerability with their ", ", released on September 5.", "Bad guys will never stop trying to find different ways to attack or exploit hardware or software flaws. Manufacturers are advised to take more precautions with third parties that supply their parts, or ensure that the OS has policies in place that can limit the damage these parts can cause if they have exploitable vulnerabilities.", "To improve mobile security, users can strengthen their defenses with comprehensive solutions like", " (available on ", ") and ", " devices (available on the ", "). ", "(MARS) already covers Android and iOS threats using leading sandbox and machine learning technology. It can protect users against malware, zero-day and known exploits, privacy leaks, and application vulnerability."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/internet-of-things/routex-malware-found-exploiting-remote-access-vulnerability-in-netgear-routers", "date": "September 14, 2017", "title": "RouteX Malware Found Exploiting Remote Access Vulnerability in Netgear Routers", "articleContent": ["A remote access and command execution vulnerability (CVE-2016-10176) was recently ", " actively exploited by RouteX, a malware that targets Netgear routers. RouteX is designed to turn an infected router into a Socket Secure (SOCKS) proxy that in turn limits access to the device to the attacker. RouteX also allows an attacker to conduct credential stuffing—a ", " that uses hacked credentials to gain unauthorized access to other user accounts. The attacks are reportedly targeting Fortune 500 businesses. ", " is a security flaw in certain Netgear routers and modem routers that, when successfully exploited, provides the attacker remote access to the vulnerable devices. It also enables hackers to recover the device's passwords and carry out command execution. A firmware/software patch for this vulnerability has been available as early as January 2017. ", " ", "By turning the infected device into a SOCKS proxy server, it essentially becomes a middleman that reroutes the communications or traffic between the attacker and his targets of interest. Not only does this provide the hacker a springboard to launch further attacks, but it also anonymizes the hacker by obfuscating the source from which the cybercriminal activities are originating. ", "The tactic is nothing new. Android malware such as ", " and ", " used the SOCKS protocol to gain access to a business’ internal networks that infected mobile devices connected to. Even internet-of-things (IoT) malware, such as the IP camera-infecting ", ", had a similar routine. RouteX differs in that after setting a SOCKS proxy, it adds Linux firewall rules to prevent other malware from exploiting the same vulnerability and restrict access to the router to certain IP addresses most likely controlled by the attackers. ", " ", "RouteX also has a notable cybercriminal past. Security researchers who uncovered the malware have found links—mainly command-and-control (C&C) domains and splash screen—to a certain hacker who purportedly made RouteX’s predecessor, an ", " targeting Ubiquiti Networks devices. ", "RouteX further exemplifies the risks of an unsecure router or IoT device. Last December 2016, an attack that leveraged a command injection vulnerability resulted in an outage of ", " of Deutsche Telekom’s routers. Zombie armies of Mirai-infected routers and other IoT devices were also behind the record distributed denial of service (DDoS) attacks against DNS provider ", ".", "An unsecure router can result in high-profile websites taken offline, devices rendered unusable, or even stolen data. Indeed, ", " is as important as protecting an organization’s perimeter. RouteX demonstrated how a vulnerable router could be used to target corporate networks and assets. They can also be used to get to the devices connected to it and the data stored on them. But more importantly, manufacturers play ", " in securing the internet-connected devices they create, and should accordingly practice security by design when developing their products."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/bashware-attack-targets-windows-system-for-linux-wsl", "date": "September 18, 2017", "title": "Bashware Attack Targets Windows System for Linux (WSL) ", "articleContent": ["Microsoft introduced a compatibility layer for Windows 10 called the", "—set to arrive in October 2017—that would allow Linux applications to run in Windows without the need to use virtualization. While this move made life easier for users who regularly use both Windows and Linux systems, it seems that a new technique that leverages WSL could allow attackers to bypass security solutions installed in the user’s system.  ", "First discovered by Check Point, this technique, dubbed as \"Bashware\" is able to work because many security solutions in Windows are not designed to deal with Linux malware. This discrepancy abuses what is essentially the foundation of WSL—“", "”, which are containers that allow the use of Linux’s Executable and Linkable Format (ELF) binaries on the Windows 10 OS.", "Attackers that use the Bashware technique will first load WSL components on the target system and enable developer mode. Bashware will then download and extract Linux from Microsoft’s servers. The final step in the process involves the installation of Wine, which allows Windows applications to run on UNIX-based operating systems. The attacker can then use Windows malware to infect the system, while rendering them undetectable by traditional security software by initiating them via pico processes.", "According to its researchers, the use of Bashware is like a very relevant threat—by using a legitimate Windows process, attackers are seemingly able to infect systems without being detected by security systems.", "It should be noted, however, that there are many hurdles to get to before attackers can target systems. For Bashware to work, not only would a system administrator need to enable developer mode (which is not enabled by default), they also have to both install the component and WSL. The chances that all of these would happen is certainly low, especially given the niche user base for something like WSL.", "In addition, many organizations have not yet migrated to Windows 10, as ", ". And even for organizations that use Windows 10, end users will still have to install WSL and run the processes needed for Bashware, eliminating a large amount of casual users.", "Currently, Bashware is more of a Proof of Concept (PoC) than an actual threat. However, this does not mean that users can play it safe against potential threats such as this. As stated earlier, this attack works under very specific scenarios—many of which users initiate themselves.", "One way to minimize the risks is to refrain from downloading and installing WSL unless its usage is actually needed. Users should also regularly update their systems as this will not only help in the event that Microsoft releases a patch that will address Bashware, it will also protect their computers from malicious threats in general."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/the-pirate-bay-uses-miner-to-generate-monero-digital-currency", "date": "September 19, 2017", "title": "The Pirate Bay Uses Miner to Generate Monero Digital Currency", "articleContent": ["The Pirate Bay (TPB), perhaps the most popular torrent-hosting website, is often used to download software and media – many of which are illegally uploaded. However, users might have gotten more than they bargained for, as the website was discovered to be using the computers of its visitors to generate coins for the Monero digital currency as a means of additional income.", "In", ", the site’s administrators mentioned that they were testing a JavaScript miner in order to generate enough revenue to get rid of all the ads on the site. The post also mentioned that a small mistake in the code resulted in the usage of all the CPU power of its visitors. This has been corrected to allow only 20-30% usage instead. Users found code in the website that points to a service called ", " as the miner TPB uses.", "Reception to the move has been mixed, with some users applauding it as a means of generating more income while others were annoyed that their computer resources were being used without their knowledge. In general, most users agreed, however, that The Pirate Bay should have been more transparent about the implementation of the miner and should have given users the option whether to donate CPU power or not.", "Monero is an interesting choice of cryptocurrency for The Pirate Bay, as while the cryptocurrency itself is legitimate, it has also been involved in recent malware attacks. Back in May, the Adylkuzz trojan (detected by Trend Micro as TROJ_COINMINER.WN) leveraged the EternalBlue vulnerability – the same one used by WannaCry — ", ". ", " have been on the rise of late, as they make popular targets for cybercriminals who prefer the convenience and anonymity they offer over non-digital currencies.", "For users, the effect of cryptocurrency malware can be widespread. It can result in decreased system performance and can also expose users to various risks, including", " In order to mitigate the impact of cryptocurrency malware as well as the unwanted use of computer resources for cryptocurrency mining, Trend Micro suggests the following best practices:", " "]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/what-can-others-learn-in-the-wake-of-the-equifax-breach", "date": "September 19, 2017", "title": "What can Others Learn in the Wake of the Equifax Breach?", "articleContent": ["Equifax announced earlier this month that it was hit by a ", ". The ", " reportedly affected 145.5 million US customers of the credit reporting company, as their social security numbers, addresses, birth dates and other personally identifiable information (PII) were stolen by hackers. 15.2 million records from UK customers were also targeted.", "The breach has shone a spotlight on the need for strict and effective policies on data management and protection. Sensitive personal data like PII is a particularly tempting target for criminals because it can be abused in a number of ways. Companies who store customer data should have strict policies and be very vigilant about their security since the data they collect is becoming an increasingly valuable commodity for hackers.", "Listed below are some general guidelines and best practices that organizations should take note of.", "According to the", " Equifax put up to manage the crisis, attackers took advantage of the known vulnerability Apache Struts CVE-2017-5638 to access the data. The vulnerability is not new; it was publicly disclosed in the beginning of ", " and was ", " soon after. Some experts noted that it ", ", which might be why many organizations did not update their systems accordingly. The vulnerability was already being exploited in March to compromise web servers of large institutions — attacks were “highly reliable and trivial to carry out,” ", ". CVE-2017-5638 was classified as a critical vulnerability with remote code execution risks, and was actively being exploited. Taking those factors into consideration, it should have been a priority to patch for any organization despite the difficulties involved.", "Patching may involve operational disruptions or additional resources, but the benefits outweigh the inconveniences. Any organization, be it a small business or a large multinational, should create an ", " that fits its enterprise. Organizations that store PII or other sensitive data should be even more careful and always be wary of current threats; ", " and can be prevented through updated patches.", "The sheer amount of data stored by organizations requires some form of data management and classification. Sensitive and valuable data, of course, should be given priority in terms of security — and a prime example of sensitive and valuable is PII. Protecting the PII of employees and customers should be top of mind for any organization.", "There are ", ". Here are some tips:", "Authenticating an individual is a necessary part of most businesses, and there are many different identifiers that can be used. Most financial institutions like Equifax rely on social security numbers (SSN). But the Equifax breach has highlighted the complications of using SSN as a standard way of authenticating a person’s identity, which was never its intended use. Even the Social Security Administration has noted that the ", ". As stated on its website: “The universality of SSN ownership has in turn led to the SSN’s adoption by private industry as a unique identifier. Unfortunately, this universality has led to abuse of the SSN. Most notoriously, the SSN is a key piece of information used to commit identity theft.”", "Privacy and security experts have recommended more ", ". There are biometric options as well as tokens and unique passwords that can be given to each individual. In any case, businesses should look into alternative methods of authenticating customers’ identities, and the authentication process must have more variation and must not rely heavily on one specific identifier.", "Organizations often have huge troves of data that they share with their partners or even third parties that help them with their operations. Sometimes the data is simply sent over standard communication lines or accessed through shared portals.", "Organizations need to be vigilant about whom they share data with and who can access their databases. ", "or otherwise participate in organizations’ operations should be vetted and verified to make sure their security is up to par. Any failings or shortcomings in this respect can lead to incidents like the 2014 breach of personal and payment information of more than 100 million Target customers, which reportedly ", " as its entry point.", "In a data-driven economy, proper protection and management is a necessity for all organizations, regardless of size. As we have seen, inadequate practices can lead to devastating and long-lasting repercussions for the customers as well as the businesses involved. ", "Solutions such as ", ", ", " and ", " can protect companies by detecting malicious files that are used as infiltration methods during data breaches. ", " and ", " solutions also detect and prevent breaches anywhere on your network to protect an organization’s critical data and reputation. All solutions are powered by ", " endpoint security, which infuses high-fidelity machine learning with other detection technologies and global threat intelligence for comprehensive protection against advanced malware.", "Updated with new data from Equifax investigation regarding the number of records targeted"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/equifax-breach-what-to-do-and-what-to-watch-out-for", "date": "September 18, 2017", "title": "The Equifax Breach: What to Do Now and What to Watch Out For", "articleContent": ["Equifax, one of the major credit reporting companies that calculates credit scores for financial institutions and insurance companies, reported a massive security breach on September 7, 2017. The company reportedly ", " that included the Social Security numbers, birth dates, and home addresses of 145.5 million US citizens, including a number of driver’s license numbers, credit card numbers and dispute documents. In the UK, Equifax reported that 15.2 million records were targeted. Although the number might not be as large as some of the previous mega-breaches, the type of data stolen exposes affected users to a number of risks. The data can be used in identity theft scams, tax fraud, social security fraud and many other serious attacks.", "In response to the breach, Equifax has set up a ", " with information about the event, allowing concerned individuals to check if they are affected by clicking on “Potential Impact” tab. Those who want to check should make sure they're using a secure computer and a secured connection when doing this.  Equifax has also offered a free year of TrustedID, which provides credit monitoring and identity theft protection. Initially, the company’s policy included a clause that customers who signed up for TrustedID could not participate in legal action against Equifax, but that statement has been removed from their site.   ", "Here are other steps we recommend you to take if you are affected:       ", "The Equifax breach was reported in early September, but ", " the breach could have ", ". That means that for more than three months, the data of 143 million people was left exposed and they were unable to take the necessary steps to protect themselves.", "It’s not clear what the hackers have done or are planning to do with the data. Historically, we’ve seen this type of data traded in underground markets, where different criminals use them for different purposes. Certain information from the hack (SSN, birthdate, driver’s license) are classified as Personally Identifiable Information (PII), which is highly valuable to cybercriminals because it can be used in many different ways.", "Whether you are directly affected by this specific breach or not, here are some threats to watch out for: ", "It is best to err on the side of caution and be watchful of any unusual emails or calls. For ", ", check that the links in the email are legitimate and that the content looks professional. Also, any unsolicited contact is suspicious—you should initiate the contact and receive a reply.    ", "In the case of fake websites, users should know: the site should be secure (using ", "), and the domain should be correctly spelled. Sometime scammers will put up sites that look genuine at first glance, but are actually slightly misspelled versions of a legitimate site.", "Due to the nature of the data involved, users will have to be proactive and diligent about mitigating attacks and scams. The versatility of the stolen PII allows cybercriminals to get creative with their actions, and users should be prepared.  ", "Trend Micro offers solutions to combat phishing and fake websites. ", " provides multi-device protection so that users can freely and safely go about their business in the digital world. Maximum Security also includes ransomware protection, blocks malicious links in email and IM, and provides anti-spam filters as well as effective anti-phishing features. ", "Updated with new data from Equifax investigation regarding the number of records targeted."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/security-technology/best-practices-deploying-an-effective-firewall", "date": "September 14, 2017", "title": "Best Practices: Deploying an Effective Firewall", "articleContent": ["In early August, malware ", " the computer network and systems of a transmission plant in North Carolina. It was a potentially costly attack, as the factory stood to lose $270,000 for every hour that it wasn’t manufacturing and shipping its automotive parts to plants across the U.S. Fortunately, the facility had a ", " standing between the factory’s crown jewels and hackers, blocking the malware when it tried to exit their network. ", "Just like the structure they were named after, firewalls are the first line of defense against cybercriminals. They check, control, and block incoming or outgoing network traffic. Data traversing in and out of your systems must first pass through the firewall, scrutinizing them or blocking them if they don’t meet specified criteria. ", "But maintaining your company’s firewall can be daunting especially if the network it protects has arrays of clients, endpoints, servers, and other devices, each of which has their own connection requirements. If improperly managed or deployed, a firewall can leave gaps in your organization’s security that attackers can use to infiltrate your network. Gartner even ", " that in the next three years, 99% of firewall breaches would be caused by misconfigurations.", "There is no panacea for building a hacker-proof firewall, but there are things that can be done to streamline its management. Every organization has unique and specific requirements but these can provide you with a starting point for managing your firewall—so you and your company don’t get burned. ", "Firewalls can be network or host-based. Network firewalls are arrayed on the gateways—computers routing traffic from a workstation to an external network—such as those within local and wide area networks (LANs/WANs) or intranet. Host-based firewalls, which became significant when it was integrated into Windows XP back in 2004, are positioned in communication endpoints and part of your operating system (OS) or security application. ", "They vary depending on where communication originates and where it is inspected and intercepted. Weigh your options and define your security needs. What do your networks and systems require? What kind of transactions transpire within your networks? Will they have the resources to run it? Who will manage your firewall? Will it be enough to contain and prevent incursions? ", "The same concept applies when deploying firewalls. Applying the principle of least privilege reduces the firewall’s attack surface. Deny all incoming and outgoing traffic by default first, then build up your rules by enabling only the services whose traffic you want in and out. Disable services or software that aren’t needed and limit the applications that run on the firewall.  ", "Periodically spring-clean your firewall’s policies to maximize its performance and eliminate conflicting rules. But more importantly, it lets you audit your firewall’s architecture and streamline it if needed. ", "The SANS Institute has a ", " of rulesets that can serve as your benchmark. Ensure that your firewall enables ", " filters and user and management permission rules, i.e., allowing HTTP to a public web server or Simple Network Management Protocol (SNMP) traps to network management servers. Make your firewall more efficient by running noise rules—dropping unwanted traffic. Rules that notify IT/system administrators of suspicious traffic are recommended. Log the traffic for analysis; back these logs up and store them in secure repositories.", "An effective firewall doesn’t just involve creating the right policies, but also proactively analyzing the connections and filtering packets of data that pass through it. Ensure that your rules can identify the conditions within the connection, predict what it will entail, and detect disruptions in a normal connection. You can use these as your starting points when filtering traffic: direction, (inbound/outbound), protocol (TCP/UDP/ICMP/ICMPv6), as well as destination computer and ports. ", "Many of today’s software and applications don’t employ standard ", "—nodes of communication for a specific process or service. Many malware also use them as entry points: ", ", and the other malware after it—", " and certain ", "—used Port 445. Enforce port restrictions, but balance the business need to access certain services. The SANS Institute also has a ", " of ports that can be blocked. It’s also recommended that your firewall can inspect and classify the traffic by applications on the ports that you permit, open or use. ", "Make sure that administrators, risk/compliance managers, and information security professionals who maintain the firewall know the policies configured. Opening a port can contradict corporate or security policy, for instance, and in-house ", " or those provisioning certain services may also request changes to firewall policies. Make sure that everyone is in the loop and following good documentation practices. Define the purpose of opening a new port or what the new rule is for, and who will be affected by the changes. These considerations help mitigate misconfigurations and conflicting rules in your firewall. ", "As hackers and threat actors fine-tune their attacks, so must the technologies that protect the data and systems they're after. Firewalls are also now being incorporated with other functionalities such as deep packet inspection—which examines the packet of data for malware and other defined policies—as well as ", " and detection systems. ", "Firewalls can be an effective preventive measure against threats, but they shouldn't the only layer of protection. Firewalls can’t protect you from email-based threats and unauthorized access to devices, for instance. While they help secure your networks and systems by validating and blocking suspicious traffic, they are just a starting point for building your organization’s cybersecurity defenses."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/ransomware-recap-crypshed-spoofs-amazon-in-ransomware-campaign", "date": "September 15, 2017", "title": "Ransomware Recap: CRYPSHED Spoofs Amazon in Ransomware Campaign", "articleContent": ["A variant of the CRYPSHED ransomware has been found being spread via emails that are purportedly sent as a dispatch confirmation from Amazon. The email itself is very deceptive, with a header containing an “amazon.co.uk” domain that could trick many users into believing its legitimacy. However, ", ", as it leads to a domain that differs from the one Amazon uses, using the following format:", " “AmazonSignIn.html” is injected into the vulnerable web servers, after which it will display a fake login page:"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/red-alert-2-0-android-trojan-spreads-via-third-party-app-stores", "date": "September 20, 2017", "title": "Red Alert 2.0 Android Trojan Spreads Via Third Party App Stores", "articleContent": ["A ", " have been discovered using a banking trojan named after a video game. Dubbed Red Alert 2.0 (Detected by Trend Micro as ANDROIDOS_BANKER) by its creators, this new malware tricks users into downloading it by hiding in third-party app stores as fake versions of legitimate applications such as WhatsApp, Viber, and updates for both Android and Flash Player.", "Once a user downloads one of these malicious apps into their devices and opens it, a popup overlay will appear prompting the user to enter their login credentials. The credentials are then sent to a command-and-control (C&C server) that the attackers control.", "Red Alert 2.0 will block incoming calls from banks, presumably to block verification attempts. The malware also intercepts SMS text messages, sending messages to the attackers for future use. By disrupting the device’s actual communication capabilities, the attackers can maximize the time spent doing malicious activities.", "According to its researchers, Red Alert 2.0 is being peddled on hacking forums for $500—a low price that could make it attractive to a large number of potential attackers.", "Red Alert 2.0 can target mobile devices that are running Android versions of up to 6.0, which was released two years ago, but it is currently confined to third party app stores. No versions of the malicious apps carrying the malware have been detected on the official Google Play Store as of the time of publication.", "This is not the first time that malware is being spread via third party app stores, ", ". Users are advised to ", ", as the lack of security regulations could expose them to malware. In addition, users should also disable the “Allow installation of apps from unknown sources” as a further security measure, and only enable it when they are sure of the legitimacy of the download source. In general, Android users should be wary of whatever they download—whether from third party app stores of even the official Google Play Store itself. If an app seems to be suspicious, perhaps it is best to refrain from downloading it."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/massive-locky-campaign-targets-millions-of-users", "date": "September 21, 2017", "title": "Massive LOCKY Campaign Targets Millions of Users", "articleContent": ["After ", " that saw LOCKY being dropped along with FAKEGLOBE, a potentially larger campaign is underway, using spam emails to infect users with a LOCKY ", " variant (Detected by Trend Micro as RANSOM_LOCKY.TH918).  As of the time of this publication, the number of spam emails that were sent already number in the millions.", "The campaign uses ", ". The first one is a fake email, allegedly sent by the Multi-Level Marketing (MLM) Company Herbalife International, in which a tax invoice for a supposed order placement is sent to the user in the form of a file archive:", "The second spam email also uses a malicious archive to deliver the malware. However, it comes with a generic “copier” sender without any other indication as to what the spam email is about:", "A third spam email involving LOCKY was also used in the campaign, this time allegedly sent by a “voicemail” service:", "These spam emails all come with an archive file that uses a .7z extension. Contained within these files is a malicious VBS (Detected by Trend Micro as ", ") that, when executed by the user, downloads the LOCKY ransomware.", "Trend Micro Smart Protection Network (SPN) data revealed that Chile was the main target of the “Herbalife” spam attacks, hitting Chile (41%) and Japan (21%). The “copier” spam attacks hit India (18%),  followed by the US (17%) and Japan (14%). The “vmservice” attacks followed the same patterns, with India at the top (24%), followed by the US (13%) and Japan (12%).", "The full coverage for the attacks can be seen in the Heat Maps below:", "The different spam emails also peaked at different times, with the “copier” spam sending out the most spam mail from the afternoon of September 18 to early morning September 19. It started to intensify at 4pm UTC time, or 9:30pm in India, which was the country most affected by the attacks.. This was followed by the “Herbalife” spam, which was most prominent from the morning of September 19 and continued through the night. The third spam email, involving “vmservice”, started on the afternoon of September 20 and lasted until September 21. Interestingly, this attack also started peaking at 4PM UTC—similar to the “copier” attacks.", "While the behavior of LOCKY itself remains unchanged, the scope of the attack and the rapidness with which it managed to spread points to effectiveness of spam for propagating ransomware.  LOCKY itself has had a history of being delivered via spam, as seen in previous campaigns such as the one ", ", as well as the ", ".", "To protect their systems from ", " and ", " attacks, users are recommended to use the following best practices:"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/internet-of-things/blueborne-bluetooth-vulnerabilities-expose-billions-of-devices-to-hacking", "date": "September 13, 2017", "title": "BlueBorne: Bluetooth Vulnerabilities Expose Billions of Devices to Hacking", "articleContent": ["Using a Bluetooth-enabled device? You might want to check if you're leaving the Bluetooth connection turned on. Regardless if it's a laptop, smartphone or any Internet of Things (IoT) device, they may be vulnerable to malware attacks that can remotely hijack them—without requiring user interaction. ", "IoT security firm Armis ", " what they've named “BlueBorne,” a set of vulnerabilities in the implementation of Bluetooth in various operating systems (OS): Android, Linux, iOS, and Windows. If successfully exploited, they can enable attackers to remotely hijack the device. The security flaws can also let attackers jump from one Bluetooth-enabled device to another. Exploiting BlueBorne could allow an attacker to execute malicious code, steal data, and carry out Man-in-the-Middle attacks. ", "BlueBorne is a bevy of the following vulnerabilities:", "The security researchers who uncovered BlueBorne estimate that 5.3 billion devices with Bluetooth capabilities are affected. Bluetooth, a specification for wireless connection, is used almost everywhere—it’s integrated into over ", " that stream multimedia content, transmit data, and broadcast information between electronic devices. ", "BlueBorne demonstrates airborne cyberattacks. An attacker can sniff, intercept or redirect the traffic between Bluetooth-enabled devices to access their data, for instance. Armis explained in their analysis, “By probing the device, the attacker can determine which operating system his victim is using, and adjust his exploit accordingly. The attacker will then exploit a vulnerability in the implementation of the Bluetooth protocol in the relevant platform and gain the access he needs to act on his malicious objective.” ", "However, certain conditions have to be met before these vulnerabilities can be exploited:", "Several patches are available addressing the vulnerabilities. Microsoft has released one for ", " as part of their ", ". Google also addressed CVE-2017-0781, CVE-2017-0782, CVE-2017-0783, and CVE-2017-0785 through their ", " for September. iOS 9.3.5 and AppleTV devices with version 7.2.2 and lower are affected—released in August and December 2016, respectively—but those running iOS 10 are immune from CVE-2017-14315. Updates are now underway for the flaws identified in Linux. ", "Patching and keeping the OS updated help mitigate attacks that may weaponize these vulnerabilities. Adopt best practices for ", ". Enforce more ", " in the workplace. If you haven’t patched your device yet, it won’t hurt to turn Bluetooth off by default and use it only when needed. Note that apart from Nexus and Pixel, updates on Android devices are fragmented, so users need to check with their manufacturer for their availability."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/internet-of-things/465k-pacemakers-syringe-infusion-pumps-vulnerable-to-hacking", "date": "September 11, 2017", "title": "465K Pacemakers, Syringe Infusion Pumps Vulnerable to Hacking", "articleContent": ["The U.S. Food and Drug Administration (FDA) recently issued an ", " amid reports of security flaws identified in 465,000 implantable cardiac pacemakers. These devices, which utilize radio frequency (RF) for communications, were recalled for a ", " that patches the vulnerabilities. ", " to the U.S.’ Industrial Control Systems Cyber Emergency Response Team (ICS-CERT), the vulnerabilities identified “may allow a nearby attacker to gain unauthorized access to a pacemaker and issue commands, change settings, or otherwise interfere with the intended function of the pacemaker.” The flaws involve compromising or bypassing the pacemaker’s authentication algorithm, unrestricted RF commands that can be issued, and unencrypted patient information transmitted to programmers and home monitoring units. The flaws could change pace settings and deplete the device’s battery, for instance. ", "Similar incidents are likely to become more common as medical devices become more connected. On September 7, ICS-CERT issued a similar ", ", and this time the vulnerabilities ", " a wireless syringe infusion pumps that are used worldwide, especially in acute care settings (i.e., neonatal and pediatric intensive care). When successfully exploited, the flaws can enable “a remote attacker to gain unauthorized access and impact the intended operation of the pump.” The vulnerabilities ", " buffer overflows, hardcoded credentials for establishing wireless connections, and improper certificate validation and access control. ", "Healthcare organizations increasingly rely on online platforms to provide care and perform critical operations. But bad guys are doing the same, exploiting security gaps in these platforms and turning them into cash cows. A recent hacking ", " in Albany, New York further illustrated the risks when the Schuyler County’s 911 emergency system was disrupted. The intrusions reportedly kept trying various passwords until it accessed their system—which resembles brute-force logins and dictionary attacks. If compromised, the network could’ve been the hackers’ doorway to sensitive, mission-critical, and personally identifiable data. ", "Indeed, keeping intruders at bay has become a significant facet of a healthcare organization’s bottom line. In the first half of 2017, for instance, hacking (and malware attacks) were major causes of externally reported ", " in the U.S. Non-profit Privacy Rights Clearinghouse has already recorded 195 incidents of data breaches from January to August 2017. ", "As such, healthcare organizations should proactively integrate multilayered ", " against cyberattacks that threaten the privacy and security of the data and medical devices. Organizations also need to proactively gauge their impact, and employ the response and remediation strategies needed for them. ", "Apart from the ", " that they ", ", the pacemaker’s manufacturer is also communicating with the relevant authorities, global regulators and security experts to “strengthen protections against unauthorized access to its devices.” The wireless syringe infusion pump’s manufacturer is doing the same and currently working on rolling out a security update. ICS-CERT recommends monitoring and logging network traffic as well deploying ", " and ", " to mitigate risks. "]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/cerber-ransomware-found-on-a-u-s-government-website", "date": "September 08, 2017", "title": "Cerber Ransomware Found on a U.S. Government Website", "articleContent": []},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/mobile-safety/android-toast-vulnerability-can-expose-users-to-overlay-attacks", "date": "September 12, 2017", "title": "Android Toast Vulnerability Can Expose Users to Overlay Attacks", "articleContent": ["Security researchers ", " end users about an Android vulnerability that can lead to what they’ve called a “toast overlay” attack. In this attack scenario, users can be tricked into installing malware that superimposes images over other apps and certain parts of the device’s controls and settings. ", "In an overlay attack, a malicious application draws a window atop other running windows or apps. A successful exploit can allow an attacker to deceive the user into clicking on a malicious window. ", "What does this mean? An image of a seemingly benign “OK” or “Continue Installation” icon, for instance, can be displayed over a hidden button that will surreptitiously grant it device privileges. It can also be used to install a malicious information-stealing app—or even hijack the screen and lock the user out ala ransomware. ", " ", "Overlay attacks are not new, and mitigations that have been rolled out in various Android operating systems (OS) made them difficult to execute. Malicious apps that employ them must explicitly ask for the user’s permission, and they must be installed from Google Play. ", "However, the recent vulnerability provides a way to successfully carry out an overlay attack. It leverages a flaw in Toast, a feature in Android used to display notifications and messages over other applications. The analysis also draws on research published by the Institute of Electrical and Electronics Engineers (IEEE) called “", "”, which was presented at the last Black Hat security conference. The research demonstrated how overlay attacks could be carried out by abusing the alerts and notification features in Android’s Accessibility Service. ", " ", "All versions of Android are vulnerable except the latest, Oreo. Android Nougat has a precaution in that Toast notifications can only be displayed for 3.5 seconds. Note, however, that this can be ", " by putting the notifications on a timed loop. This means an attacker can disguise his malicious content as long as needed. Additionally, Toast doesn’t need the same permissions as other windows in Android, and it’s even possible to ", " Toast to overlay the entire screen. ", " ", "A patch for the flaw (CVE-2017-0752) was recently released as part of the ", ". While researchers note they have yet to see the attack in the wild, that doesn’t mean it’s not worth updating your device given its attack chain. A malicious app that employs this method only needs to be installed on your device and granted accessibility permissions. ", "Practice good ", ". Among them: keeping your OS and apps updated, and downloading only from the official Google Play or trusted sources. Apart from Nexus and Pixel devices, updates on other Android devices are still fragmented, so users should contact their device’s OEM for their availability. Organizations should also enforce stronger patch management policies to improve the ", ". "]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/security-technology/windows-kernel-bug-found-can-be-abused-to-reportedly-bypass-security-systems", "date": "September 11, 2017", "title": "Windows Kernel Bug Found, can be Abused to Reportedly Bypass Security Systems", "articleContent": ["A bug in the Windows kernel made the news last week after it was found that it could purportedly prevent anti-virus (AV)/security software from identifying malware. All versions of Windows since Windows 2000’s release are reportedly affected. ", "The programming error lies in the Application Programming Interface (API) ", ", which registers a driver-supplied callback whenever an image is loaded or mapped into memory. ", "programmatically informs application developers of newly registered drivers, for instance. And since the routine can also determine if a ", " (PE) image—a common file format in many malware—are loaded into memory, it became one of the mechanisms integrated to security solutions to check for malicious code. ", "Omri Misgav, the security researcher that uncovered the bug, said that an attacker can exploit the error in a way that ", " will return an invalid name. It can, in turn, bypass AV solutions or similar security mechanisms by forging the name of the module loaded in the kernel and disguise it as legitimate. ", "While the error in the API can be abused to bypass AV solutions and host-based intrusion detection, Misgav told ", " that they haven’t tested any specific security software against the bug. “We are aware that some vendors do use this mechanism, however at this point in time we cannot say if and how the use of the faulty [PsSetLoadImageNotifyRoutine] information affects them.” ", "“We [also] contacted MSRC [Microsoft Security Response Center] about this issue at the beginning of this year,” Misgav added, “They did not deem it as a security issue.” ", "Trend Micro is aware of the Windows kernel error reported to Microsoft by enSilo. The kernel bug does not affect any of Trend Micro’s proactive and defensive security solutions; supported Trend Micro products do not rely on the API involved. Trend Micro has its own implementation for monitoring behavior and logging events. Our behavior-monitoring technology helps in reporting system events of interest to other modules, and is used to augment Trend Micro’s solutions. More information about the issue can be found in this ", "."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/hacking-groups-attack-more-than-20-thousand-mongodb-databases", "date": "September 07, 2017", "title": "Hacking Groups Attack More than 20 Thousand MongoDB Databases", "articleContent": ["A new barrage of ransom attacks targeted MongoDB databases, affecting tens of thousands of servers. Multiple hacking groups are ", " behind the attacks, with one of them already compromising ", ".", "The attackers targeted publicly accessible databases running with default settings, deleting the data and replacing it with a ransom note that reads:", "Late last year, MongoDB databases were also subjected to attacks, affecting at least ", ".", "It is ", " that such databases are being targeted on the internet. The attacks on MongoDB aren’t isolated incidents; ElasticSearch, Hadoop, and other sources of publicly accessible data were also hit by similar attacks this year. There's profit in going after data; it has value in the underground, and ransomware attacks have also proven how victims are willing to pay.", "According to a ", " spreadsheet that GDI Foundation chairman Victor Gevers and fellow researcher Dylan Katz are updating, payments of over 24 BTC (US$110,100) had been received by the hackers, with 275 listed transactions.", "To ", " attacks against MongoDB, users should follow what’s written on the program’s ", ". The list discusses the proper way of enforcing authentication, enabling access control, and limiting network exposure. Using the most popular installer for MongoDB (RPM) should also be considered as it limits network access to local host by default.", "Users should rethink if they really want to deploy a publicly accessible data source that is directly connected to the internet. If it is the right design choice, understanding the technology and services in their solution stack is the next step to a strong defense. Limiting the privileges of front-end identities making requests should be considered, as well as making sure that each session uses a unique ID instead of a having single ID for the entire application.", "After determining what and where to deploy applications, basic testing should be done to ensure that they're configured properly. As part of regular deployment testing, basic tests should be run to see if services are accessible from appropriate places."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/research-and-analysis/threat-reports/roundup", "date": null, "title": "2017 Midyear Security Roundup: The Cost of Compromise", "articleContent": []},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/vulnerabilities-and-exploits/down-and-exposed-are-your-maintenance-policies-leaving-your-systems-vulnerable", "date": "September 12, 2017", "title": "Down and Exposed: Are your Maintenance Policies Leaving your Systems Vulnerable?", "articleContent": ["Machines need regular maintenance, not just to make sure the usual wear and tear hasn’t damaged the machine but also to do routine updates and checks. The more complicated the machinery, the more intensive the maintenance process is. ", "The maintenance process will usually require access to the machine and all the connected systems used to manage the operations—for example, a modern water pump is connected to pipes that deliver water, as well as a control system to monitor and adjust pressure and flow. During routine maintenance, both the hardware and software are vulnerable when normal operations and security protocols are paused or switched to another mode so that updates or fixes can be applied. ", "A 2016 incident in Taipei proves how the maintenance period can be a very effective avenue of attack. ", " say that a disgruntled employee took advantage of routine maintenance to install malware on the software managing YouBike, which is a biking service that operates throughout the country. The bikes became inoperable as a result, costing the enterprise US $662,910 in damages and lost revenue. The engineer was caught and charged by the Taichung District Prosecutors’ Office in Taiwan.", "Besides the fact that, during maintenance, there are little to no security measures in place—even fundamental layers like application control or whitelisting—there are also other issues that could potentially be exploited.", "Cyber threats affecting enterprises ", ", which should encourage organizations to rethink their security measures across all aspects of their business, especially the maintenance of machinery that is integral to operations. Maintenance policies should be restructured, security solutions added, and machines in general should be updated so they can receive proper maintenance. ", "Below are some specific solutions that should be considered:", "For some standalone PCs or closed systems, anti-malware software cannot be installed, malware scanning with the latest malware pattern file is difficult, and malware infections can still occur via USB flash drives or other devices brought inside. ", " is a malware scanning and cleanup tool designed as a USB flash drive for environments where an internet connection is not available or anti-malware software cannot be installed. And", " can be used for smart whitelisting protection that can keep the system still locked under maintenance, and just allow approved software to be updated.", "Organizations can also use ", " to monitor machines connected to a network. Using specialized detection engines and custom sandbox analysis, Deep Discovery Inspector identifies advanced and unknown malware, ransomware, zero-day exploits, command and control (C&C) communications, and evasive attacker activities. TippingPoint’s ", " provides actionable security intelligence, shielding against vulnerabilities and exploits, and defending against known and zero-day attacks. Solutions, such as ", " and ", ", powered by XGen™ security, use a combination of technologies such as deep packet inspection, threat reputation, and advanced malware analysis to detect and block attacks and advanced threats."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/virtualization-and-cloud/best-practices-backing-up-data", "date": "September 07, 2017", "title": "Best Practices: Backing Up Data", "articleContent": ["In a data-driven world where information is often a company’s most valuable asset, protecting data is more important than it’s ever been. In one of the most significant ", " of 2017, the WannaCry outbreak caused massive damage—", "—to businesses around the world. The estimate doesn't just account for the lost data, but also from its related consequences like the loss of productivity and data restoration costs. Operating systems, software, and even hardware can be replaced, but data is not so easily recoverable or replaceable. While there are solutions that can completely or partially recover lost data, these are often neither ", " nor do they work for every kind of circumstance. What companies need to understand is that the most effective solution to prevent data loss is also the most obvious one: backing up data.", "Everyone who stores data on a device—whether it’s consumer databases, employee files, medical records or even simple photographs of memorable events—", ". However, organizations are often the ones who have the most to lose when it comes to data loss, as this often results in consequences that can affect production and services.", "As mentioned earlier, a company's data is now considered one of its most valuable assets, so it should make sense to do everything possible to protect it. Just as a business owner will purchase insurance to protect their physical business assets, a backup acts as “insurance” against data loss incidents. Backing up ensures that data is easily recoverable and operations aren't affected as much.", "One of the most important steps in creating an effective backup plan is to figure out how often data needs to be backed up. Ideally, organizations should be backing up their data as often as their resources can allow. While many companies, especially smaller businesses, can make do with a daily backup, those that deal with constantly changing data, such as financial organizations, should back up even more frequently—sometimes as much as several times a day.  Companies can look into software that automatically backs up data at selected intervals to make the process easier to manage.", "The importance of the data should dictate how often backups are done. Companies with limited time and resources should prioritize backing up their most important files, such as databases. Non-essential data and personal user files can be backed up less frequently.", "The standard ", ".", "Why is it called the 3-2-1 rule? Because it involves the following:", "If a company needs to back up a database of customer information that is essential to their business, following the 3-2-1 rule means saving at least three copies of their database (rule #1) in two different backup formats (rule #2). For instance, they can store a copy of the database in an internal hard drive and two copies in an external device.", "The third step involves keeping a copy offsite. This prevents losing copies of the database in case of an event such as a natural disaster. One of the most common examples of an offsite backup is through the use of the cloud. Another alternative is to keep a physical copy in another secure location.", "There is no single most effective method for backing up data, as each method has its own unique set of advantages and disadvantages.", "External devices such as USB drives and external hard drives are often the cheapest and simplest way to ", " data. They are easy to use, transportable, are relatively fast when backing up smaller amounts of data, and provide ample amounts of storage space. They are also offline, which means that they are isolated from potential attacks coming from the internet.", "However, external devices can also get damaged, lost or stolen. For example, an office fire can burn down external hard drives storing vital information that is needed to run the business. Without another backup, this data is essentially lost.", "Another method of backing up data is to store it in the cloud. This method provides several advantages: for one, it doesn’t use a physical device, thus the data stored in the cloud is protected from physical loss. Cloud backup is also automated, which means that as long as the device or computer storing the original data is connected to the internet, it will continuously and automatically sync files to the cloud – saving both time and resources. Furthermore, many cloud providers use technology such as ", " and ", " for added security.", "Cloud backup can take more time, however, as the speed of backing up is limited by the bandwidth of the user doing the backup. In addition, by virtue of being connected to the internet, cloud-based storage solutions ", "be affected by attacks that target the service provider, such as Distributed Denial of Service (DDoS) campaigns.", "Given each method’s advantages and disadvantages, it’s clear why a combined backup strategy like the 3-2-1 rule is important, as it takes advantage of each method’s strengths while minimizing weaknesses via multiple layers of protection.", "A large number of data loss incidents can be prevented—or at least mitigated—by the proper backup of data files. It is an aspect of security that organizations should prioritize given the importance of data in their operations.", "Every March 31, the world celebrates what is known as ", ", which serves as a reminder of the importance of backing up to protect data. However, it should also be a reminder that backing up isn't something one only does on a single day of the year: backing up data should be performed on a regular basis as part of a company’s culture of security."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/new-locky-variant-lukitus-distributed-in-23-million-emails", "date": "September 04, 2017", "title": "New Locky Variant Lukitus Distributed in 23 Million Emails ", "articleContent": ["Lukitus either arrives as an email with a ZIP compressed attachment that contains a Visual Basic Script (VBS) or JavaScript file (detected as JS_NEMUCOD.TH822 and JS_NEMUCOD.ELDSAUJM), a Microsoft Word document, or a spoofed Dropbox notification. The operators behind Lukitus were discovered sending spams that contain common subjects like \"please print,” \"documents,” \"photo,” \"images,” \"scans,\" and \"pictures.”", " was the top infection vector among the ransomware threats we detected and blocked in 2016, accounting for 79 percent of the total. It is highly recommended for users and enterprises to have an ", " solution that checks for email reputation, web reputation of the embedded links, file attachments, as well as macros in Microsoft Office documents.", "In addition, users and enterprises can adopt ", " to lower or eliminate the risk of ransomware infection.", "Enterprises can benefit from a multi-layered, step-by-step approach in order to best mitigate the risks brought by these threats. Email and web gateway solutions such as ", " and ", " prevent ransomware from ever reaching end users. At the endpoint level, ", " deliver several capabilities like high-fidelity machine learning, behavior monitoring and application control, and vulnerability shielding that minimizes the impact of this threat. ", " and ", " detect ransomware on networks, while ", " stops ransomware from reaching enterprise servers–whether physical, virtual or in the cloud. Trend Micro products’ use of ", " also protects environments from unidentified threats and zero-day attacks. It performs a behavioral analysis on unknown or low-prevalence processes to determine if an emerging or unknown threat like Lukitus is attempting to infect your network.", "For small businesses, ", " offers cloud-based email gateway security through Hosted Email Security. Its endpoint protection also delivers several capabilities such as behavior monitoring and real-time web reputation in order detect and block ransomware. ", "For home users, ", " provides strong protection against ransomware by blocking malicious websites, emails, and files associated with this threat. "]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/hackers-exploit-instagram-api-flaw-to-steal-information-from-verified-users", "date": "August 31, 2017", "title": "Hackers Exploit Instagram API Flaw to Steal Information from Verified Users  ", "articleContent": ["High profile users of the popular social media platform Instagram were alerted late August after the company discovered that hackers had gained access to specific users’ contact information. Instagram confirmed that the hackers managed to obtain email addresses and phone numbers of some prominent users by exploiting a bug in the app’s API. On August 31, it was ", " that the hackers actually collected the stolen information and created a searchable database dubbed “Doxagram”. Currently, they are charging US $10 per search. ", "In response to the API exploit, Instagram did not confirm the number or specific accounts that were affected. According to ", ", only high profile users were targeted. It is possible that the hackers wanted to abuse the channels with the most followers for some kind of stunt—just this past week we’ve already seen ", ". In a ", ", the company emphasized that “no account passwords were exposed. We fixed the bug swiftly and are running a thorough investigation.”", "Although Instagram maintains that user passwords were not compromised, this doesn’t negate the severity of the hack. Email addresses and phone numbers are used as login credentials and backups for many different accounts—and not just on social media platforms. It is entirely possible for an attacker to hijack someone’s phone and access shopping profiles or even banking accounts linked to that number. The fact that most online accounts are accessed and even verified through mobile devices makes phone numbers quite valuable.", "As more attackers target online accounts, users have to be aware of the security measures available to them. Some tips for managing your online accounts:", "Users and enterprises can benefit from mobile security solutions such as ", " (available on ", ") and also", ". ", " provides businesses with device, compliance, and application management, data protection, and configuration provisioning. It also protects devices from attacks that leverage vulnerabilities, prevents unauthorized access to apps, as well as detecting and blocking malware and fraudulent websites.", "Article was updated with news regarding \"Doxagram\""]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/ransomware-recap-ransomware-development-kit-for-mobile-peddled-underground", "date": "September 04, 2017", "title": "Ransomware Recap: Ransomware Development Kit for Mobile Peddled Underground ", "articleContent": ["The Internal Revenue Service (IRS) has issued a message ", " the public about a ", " campaign that uses a bogus email to impersonate the IRS and the Federal Bureau of Investigation (FBI). This is not the first scheme to ever use the tactic, it's been proven to have been effective before. The ransomware business has been profitable enough to assume that the \"industry\" will only continue to expand. A ", " is already making rounds on underground forums. This one, however, will not require users with coding skills to use. It's been designed to allow users to build their own file-locking malware with an Android phone.", "The Trojan Development Kit (TDK) app, which is downloadable from hacking discussion boards for free, comes with an interface that allows users to easily create their own variants. After filling out forms, the user only needs to press the 'create' button to initiate a conversation with the app developer for payment.  It was ", " that the TDK samples were directed at Chinese-speaking users.", "Like the ransomware-as-a-service (RaaS) ", ", ransomware development kits for mobile devices could contribute to the increasing cases of ransomware infections. For instance, the emergence of a ", " was created using the Android integrated development environment (AIDE), a program used to develop Android apps directly on an Android device. This particular variant even redirects victims to a QQ forum where users are invited to create their own custom ransomware for a fee.", "Here are other notable ransomware stories:", "Defray is a new ransomware variant discovered ", " healthcare, education, manufacturing, and technology organizations using ", ". The attackers used a Word document with an embedded OLE packager object that installs the ransomware when clicked.", "FlatChestWare is a ", "-based variant that arrives as a Win32 executable file. The ransomware variant also prompts a bogus 'Windows Update' dialog box, which is intended to trick users into restarting their endpoints.", "When the 'Restart now' button is clicked, the machine will reboot and subsequently display a ransom note. The lock screen has an animated image of an umbrella-carrying girl on the left, and a note on the right. FlatChestWare encrypts files that include Microsoft Office documents, as well as audio and video file formats.", "Users and enterprises can adopt ", " to lower or eliminate the risk of ransomware infection."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/two-million-cex-customer-data-exposed", "date": "September 05, 2017", "title": "Two Million CeX Customer Data Exposed", "articleContent": []},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/vulnerabilities-and-exploits/new-apache-struts-vulnerability-could-be-worse-than-poodle", "date": "September 06, 2017", "title": "New Apache Struts Vulnerability Could Be Worse than POODLE ", "articleContent": ["The critical Remote Code Execution (RCE) vulnerability ", " was recently ", " in Apache Struts 2, a popular open-source framework used to build and deploy Java-based web applications. RedMonk analyst Fintan Ryan stated that at least 65 percent of the Fortune 100 companies use web applications built with the framework, exemplifying the extensive risk that came with the discovery of the vulnerability.", "This vulnerability allows an attacker to run arbitrary code on servers that run applications built with the Apache Struts framework and the popular REST (representational state transfer) communication plugin. It was revealed that the flaw stems from Apache Struts’ unsafe method of deserializing untrusted data. The affected versions of the framework are Struts 2.1.2 – 2.3.33 and Struts 2.5 – 2.5.12, and all web applications that use REST are vulnerable. If ", ", an attacker can use the vulnerability to find credentials, connect to the database server, and extract all data. ", "Dating back as far as 2014, the discovery of vulnerabilities in Apache Struts has been an ", " for servers that utilize the framework. Attackers have consistently used ", " expressions to easily execute arbitrary code remotely because Apache Struts uses it for most of its processes. But CVE-2017-9805 has the potential to outweigh the previous flaws damage-wise including even ", ", which allowed attackers to conduct man-in-the-middle attacks and decrypt the traffic between web servers and end users.", "Man Yue Mo, one of the security researchers who discovered CVE-2017-9805, said that the vulnerability poses a huge risk because aside from being widely used by publicly accessible web applications, the Apache Struts framework can be easily exploited using a web browser. Several airline booking systems use the framework, as well as a number of financial institutions that use it for internet banking applications.", "Apache Struts has already released a ", " today.", "™ ", "™ and ", " provide ", " that protects servers and endpoints from threats that abuse vulnerabilities such as CVE-2017-9805. ", "’s Vulnerability Protection shields endpoints from identified and unknown vulnerability exploits even before patches are deployed. ", "™ ", "™ provides detection, in-depth analysis, and proactive response to attacks using exploits through specialized engines, custom ", ", and seamless correlation across the entire attack lifecycle, allowing it to detect threats that may exploit CVE-2017-9805 even without any engine or pattern update.", "Deep Security™ provides protection from any threats that may exploit this vulnerability via the following DPI rule:", "Deep Security Inspector™ protects customers from this vulnerability via the following DPI rule:", "TippingPoint has posted a Customer Shield Writer (CSW) file for this vulnerability that (available for customers to download on ", "). The applicable rules are as follows:", "TippingPoint customers are also protected from this threat via these MainlineDV filters:", "Trend Micro Smart Home Network customers are protected from this threat via this rule:"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/best-practices-securing-sysadmin-tools", "date": "September 05, 2017", "title": "Best Practices: Securing Sysadmin Tools ", "articleContent": ["Legitimate tools used by IT/system administrators have become valuable cybercriminal targets because of the privilege they provide for greater network access. While malware threats continue to evolve and proliferate, sysadmin tools have opened wider gates for them to deploy blindsiding attack tactics.", "The ", " outbreak that infected many European organizations demonstrated the large-scale damage that could stem from abusing PsExec and the Windows Management Instrumentation (WMI). PowerShell has also seen multiple incidents of abuse over the years. From the ", ", the ", ", and ", " to ransomware families such as ", " and ", ", Powershell has been ", " by attackers because it is easy to write and simple to obfuscate. In addition, malicious Powershell scripts are a key ingredient of a lot of fileless malware that are capable of stealthily breaking into networks.", "Remote desktop protocol (RDP), which is currently used by more than ", " internet endpoints, is also no stranger to abuse. Last year, ", " in Australia and New Zealand got hit by RDP brute force attacks from ransomware operators.", "To mitigate these threats, IT/system administrators can use the following best practices:", "Properly categorize users and the networks they access to segment user privileges and network traffic. The risk of exposure to threats can be reduced by only granting enough access or privilege for a user to accomplish his task, or an application to be run.", "Implementing ", ", account lockout policies and setting user permission/restriction rules can help defend against RDP brute force attacks. A bastion host that only allows access to certain IP addresses can also be implemented to reduce and withstand possible attacks.", "Moreover, access should be limited to other management protocols such as VNC and SSH. Using a public key infrastructure (PKI) instead of knowledge-based passwords to access protocols like SSH is recommended to achieve a more secure authentication method. Granting limited access to other sensitive ports like TCP 135, 445, 1433 (MSSQL), 3306 (MySQL), and even web management consoles like phpMyAdmin is also recommended as they are popular targets in the wild.", "Threats that abuse legitimate tools and services can indicate command and control communications to the attacker’s servers. Employing ", " will help deter incursion or data exfiltration attempts. This can be complemented by a security mechanism that can ", " for any suspicious behavior.", "System administrators must also ", ", and ensure that attackers cannot modify them. Aside from providing aid in incident response and remediation, these logs also help security researchers better understand the threat.", "Ensuring that the operating system, software, and other applications are updated with the latest patches prevents threats from exploiting security gaps. This year, the success of attacks by ", ", ", " have illustrated the consequences of overlooking unpatched vulnerabilities. Employing ", " is also an option for shielding systems and networks from unknown vulnerabilities, even without a patch.", "For whitelisted applications that have become favorite targets by fileless malware operators, a robust patch management policy that balances business productivity and security is recommended.", "Organizations should conduct regular training to ensure that IT/sysadmins have a solid understanding of company security policy and procedure. Vigilantly monitoring the misuse of sysadmin tools can help organizations prevent threats from entering their network.", "Sysadmin tools are responsible for making sure that systems and networks are not interrupted so business operations are kept up and running. Besides the abovementioned recommended practices, here are some other recommendations they can take to prevent sysadmin tools from being misused:"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/vulnerabilities-and-exploits/patching-problems-and-how-to-solve-them", "date": "August 30, 2017", "title": "Patching Problems and How to Solve Them", "articleContent": ["The European Aviation Safety Agency (EASA) issued a directive earlier this month warning about a ", ", a popular passenger plane used by major airlines all over the world. Apparently, if left unchecked, the problem could lead to overheating and in certain conditions even an engine explosion. What is the recommended fix? A software update.", "This is an extreme, and somewhat dramatic, example of what patching can prevent.", "The first half of 2017 saw two of the most widespread malware outbreaks to date—and both leveraged a known exploit with an available patch. In May, WannaCry impacted operations across the globe, possibly costing multinationals ", ". The malware heavily relied on ", ", or “EternalBlue”—a vulnerability for which a patch was already available before the outbreak. Petya soon followed, which leveraged the same vulnerabilities to compromise ", ".", "Despite the availability of a patch that could have prevented an infection, many companies and users still had vulnerable systems. This situation only begs the question: can we fix the lag between patch release and application?", "Patching has always been an issue for organizations—though they know the obvious benefit of patching quickly, they may be hesitant to deploy any updates that might hinder operations or impact critical systems. Patching can be a real burden if there are no procedures set in place and many businesses can’t afford the down time, so they just accept the risks. Besides this, there are a number of other reasons for holding off on patching; resources could be limited, legacy systems could be overlooked during patching, or worse, some systems are so old they cannot be patched.", "A 2015 survey shows that it took some ", ", but things are starting to change in 2017. A recent ", " revealed that companies are definitively committed to better patching practices. The survey shares that “a majority of executives named investments in IT and patch-automation systems as the ones that delivered the best returns on their security investments in the past year,” and 43% of the surveyed companies would make timely patching and remediation a higher priority in 2017.", "Hopefully, this recent commitment to timelier patching will continue and help contain future outbreaks. Although it is not a new solution, it should be an integral part of enterprises’ security regimen. Below we list some common issues and what can be done to establish a new and more efficient way of patching:", "Patching is absolutely necessary, regardless of an organization's size. While it might take time and resources, it becomes less of a strain on operations once proper procedures are established and effective solutions are in place. As several companies have noted, it is well worth the investment.", "Patching is just the beginning of a well-rounded security strategy. The use of multilayered solutions such as ", " will help provide detection, in-depth analysis, and proactive response to today’s stealthy malware, and targeted attacks in real-time. It provides a comprehensive defense tailored to protect organizations against targeted attacks and advanced threats through specialized engines, custom ", ", and seamless correlation across the entire attack lifecycle.", " and ", " provide ", " that protects endpoints from threats that abuses vulnerabilities. ", "’s Vulnerability Protection shield endpoints from identified and unknown vulnerability exploits even before patches are deployed."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/onliner-spambot-leverages-711m-email-accounts-for-massive-campaigns", "date": "August 30, 2017", "title": "Onliner Spambot Leverages 711M Email Accounts for Massive Campaigns", "articleContent": ["A Paris-based researcher who goes by the pseudonym ", " has discovered and revealed a massive data set being used in one of the biggest known spam operations. Dozens of text files containing huge batches of email addresses, passwords, and server information were found on an open and accessible web server hosted in the Netherlands. The spambot has been dubbed “Onliner” and is sending out the Ursnif malware, which is ", " that targets account credentials and credit card details.", "Since security products are getting better at filtering out spam mail, distributors are always looking for new delivery methods. One such method involves using SMTP credentials to authenticate the spammer, making it seem like the email is legitimate to bypass the filters. The Onliner data has a huge number of SMTP credentials—one of these files has over 140,000 records with email, password, SMTP servers, and ports. This gives the spammers a wide range of servers to send their malicious emails from.", "Benkow also shared this massive data set with Troy Hunt, who runs ", ", a website that helps users check if they have been affected by data breaches. To put the size of the said trove of data in perspective, ", " that “it took HIBP 110 data breaches over a period of 2 and a half years to accumulate 711 million addresses”.", "Hunt notes that some of the email addresses appear to have been parsed and scraped off the web. Data also appears to have been aggregated from previous breaches. In his ", ", he shows that a random selection of emails from the Onliner batch was also found in the LinkedIn data breach. Another batch also matched data from a ", " he reported on in May 2017.", "A stolen email address and password can be used to cause a lot of damage. Stolen account data can be used and reused by cybercriminals, and then sold to someone else to use for other purposes. As criminals continue to find new uses for old data, it only emphasizes the importance of comprehensive security and vigilance. Users should take particular ", " and also be wary of spam mail.", "Many different malware distributors use email as an entry point into the system and network, and since email is practically ubiquitous, users should do whatever they can to ", ". Other effective security solutions include comprehensive spam filters, policy management, and email security mechanisms, which can block malicious payloads.", "Trend Micro endpoint solutions such as", " and ", " can protect users and businesses from these threats by detecting malicious files, and spammed messages as well as blocking all related malicious URLs. ", "™ has an email inspection layer that can protect enterprises by detecting malicious attachment and URLs.", "Trend Micro™ ", " is a no-maintenance cloud solution that delivers continuously updated protection to stop spam, malware, spear phishing, ransomware, and advanced targeted attacks before they reach the network. It protects Microsoft Exchange, ", ", Google Apps, and other hosted and on-premises email solutions.", " with ", " endpoint security infuses high-fidelity machine learning with other detection technologies and global threat intelligence for comprehensive protection against advanced malware."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/security-technology/prioritizing-the-security-of-biometric-authentication", "date": "August 31, 2017", "title": "Prioritizing the Security of Biometric Authentication", "articleContent": ["The man ", " for the idea that a complicated password guarantees effective security admitted in a recent interview that he was wrong. Invalidating his eight-page guide on how to creatively secure passwords in 2003, Bill Burr attributed his mistake to research that mostly came from a white paper written in the 1980s.", "Burr shouldn’t be too hard on himself because knowledge-based passwords, regardless of the complexity, seem close to becoming obscure anyway as biometric authentication shows ", " among industries and governments across the globe. The market growth for biometric devices is the result of several factors: the integration of biometric authentication in smartphones, adoption of biometric system by government facilities, and the rising use of biometric technology in ", " and ", ", among others.", "Based on its growing popularity, it's safe to assume that biometric authentication is here to stay. However, its prevalence also comes with rising ", " about the technology's level of security, and the possible implications that can stem from it if compromised.", "The Chaos Computer Club (CCC) showed multiple times that fingerprint-based authentication devices could be bypassed. In 2013, the Europe-based association of hackers bypassed the iPhone 5S biometric feature (TouchID) by ", ". They did it ", " early this year when they bypassed Samsung’s iris-based biometric authentication feature.", "At a cybersecurity conference in 2016, security and computer vision specialists from the University of North Carolina ", " using a system that utilizes digital 3-D facial models displayed with mobile virtual reality technology. Instead of using the photos of the researchers for the test models, images of the volunteers were collected from search engines, professional photos, and public assets on social networks like Facebook, LinkedIn, and Google+.", "The past few years have also seen large-scale breaches and leaks on databases that also stored biometric data.", "The United States Office of Personnel Management (OPM), which serves as a human resources department for the U.S. federal government, suffered a major data breach and leaked ", " in 2015. A year later in the Philippines, a hacker group ", " Commission on Elections’ (Comelec) database, leaking data of 55 million registered voters that include PIIs", " and in some cases, passport details and text markers of fingerprints.", "Raw biometric samples must first be converted into digital form before a computer can read them. If biometric authentication is ", ", the digital biometric data is stored on the device itself. If it is server-based, the digital biometric data is stored in a central repository or database, which means it is ", " than any other data moving from one point to another. But does that mean it is also vulnerable to similar threats? The question brings up a bigger issue because if biometric data falls into the wrong hands, it cannot expire or be changed, unlike passwords. Biometric data is an unchangeable credential because it involves unique biological input. Moreover, recording another copy of a person’s biometric data (e.g., another set of fingerprints to replace the compromised ones) is not as convenient as changing a compromised password, because the person has to be physically in the same location where the recording takes place.", "There is currently no evidence that criminals can use digital biometric samples for something other than to steal it and keep it hidden. However, ", " have looked into creating a working group to see how cybercriminals can use biometric data such as fingerprints.", "In theory, ", " can be replaced with an impostor’s template", " and physically spoofed using the original template. A stolen template can also be sent to the matching module to gain unauthorized access to the system, and if not properly secured, they can be used to cross-match across different databases to track a user without consent. Although these scenarios remain theoretical, the increasing reports of compromised biometric authentication and data should caution users, vendors, enterprises, and governments about the security risks to their biometric systems.", "The protection of biometric authentication starts with securing its most important component—the biometric data. How it is protected ", " heavily on where it is stored. If it is stored on a drive, full drive encryption or file-by-file encryption must be done. If the biometric data is stored in a database, the entire database must be encrypted, but value-by-value encryption can also be implemented.", "Here are other tips on how to secure biometric systems:"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/enterprise-network-protection-against-cyberattacks-business-email-compromise", "date": "August 25, 2017", "title": "Enterprise Network Protection against Cyberattacks: Business Email Compromise", "articleContent": [" View Enterprise Network Protection against Cyberattacks: Business Email Compromise.", "If the developments from ", " are any indication, stealing credentials is not the name of the game anymore—stealing money is. Cybercriminals are now going directly for cold cash by tricking unwitting employees into funneling the money directly into their accounts.", "Business Email Compromise (BEC) is a social engineering scam that has been reported in 131 countries and resulted in at least $5.3 billion stolen from 2013 to 2016, with an ", " of $132,000 per incident. ", "[Read: ", "]", "How do BEC scams work? Savvy BEC scammers start by developing familiarity with the processes of their targeted company. Armed with the knowledge of the inner workings of an organization, they can select employees to target with carefully crafted emails.", "An employee, usually someone related to finance (such as Chief Financial Officer, finance manager, or accountant), receives a well-worded email requesting a wire transfer that appears to come from the Chief Executive Officer (CEO) or president. The email is structured such that it is likely to receive less scrutiny due to how legitimate it looks. The employee, convinced of the seemingly legitimate request, unwittingly transfers a hefty amount of money to an account the fraudster controls. And that’s just one scenario among five known BEC tactics.", "[Read: ", "]", "Since BEC emails are not mass-mailed and typically do not contain malicious links or attachments, the fraudulent requests are harder to detect via traditional security solutions.", "Based on past incidents, a successful BEC operation isn't tough to pull off. Leoni AG, Europe’s leading wire and cable manufacturer and the fourth-largest in the world, was ", " (approximately $47.2 million) after a fraudster successfully tricked the CFO into transferring funds to a foreign account. The incident reportedly happened after the CFO of one of the company’s factories in Romania received an email that looked like it came from one of the manufacturer’s executives in Germany.", "There have been many other cases of successful BEC schemes, all of which involved huge losses. The rise of Business Email Compromise cases around the world is a clear indication of how lucrative this cybercriminal business model can be, and organizations of all sizes must take immediate measures to protect themselves. Defending against BEC doesn't require ramping up for a technical arms race. Security comes in the form of people, too. Appropriate security solutions paired with proper employee education can save an organization from a potential million-dollar loss.", "To learn more about BEC and how to build up security defenses on par with this email-borne deception, read our primer "]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/individual-possibly-involved-in-the-opm-data-breach-arrested-by-the-fbi", "date": "August 25, 2017", "title": "Individual Possibly Involved in the OPM Data Breach Arrested by the FBI", "articleContent": ["In 2015, ", ".  On August 25, 2017, the Federal Bureau of Investigation (FBI) arrested one of the people suspected of using the same malware linked to the massive data theft: 36-year old Chinese national Yu Pingan.", "Pingan, who also goes by the pseudonym “GoldSun,” was arrested at the Los Angeles International Airport in connection with attacks against unnamed US companies from 2011 to 2014.", "In an ", ", Pingan was accused of conspiring with two other unidentified individuals to attack the networks of US-based organizations beginning in 2011. The group first discussed the use of a Remote Access Trojan (RAT), which allows users to remotely control the system in which it is installed. Attacks against various companies occurred over the next few years, including a wide variety of infection vectors such as watering hole attacks and vulnerability exploitation. Pingan’s primary role was to distribute malicious software tools, one of which was used in the OPM attacks mentioned earlier.", "While the arrest of perpetrators is good news, the underlying question still prevails: What can be done to minimize the impact of, if not completely prevent, ", "?", "The first step would be to acquire the ability to ", " that occur whenever potential data breaches occur. Unusual authentication and authorization incidents, peculiar network behavior, and network irregularities are some of the telltale signs that network attacks could be occurring. Spotting IOCs gives IT professionals the time to react and prevent these attacks from causing lasting damage.", "In terms of mitigation techniques, data management should be a priority. For organizations, this can ", ": Data of greater importance should be given greater priority in terms of security. Data protection should also extend to employees and end users, who should ", " as many attackers often use information stolen from individual users – such as Personally Identifiable Information (PII) and Healthcare Information – to gain access to organizational data. Data protection is something the whole organization, from top to bottom, should address as a whole."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/mobile-safety/mobile-app-security-for-developers", "date": "August 29, 2017", "title": "Mobile App Security for Developers", "articleContent": ["In 2016, 69% of business departments reportedly ", " two to five mobile applications, and their employee use increased by 66% over the previous year. ", "Indeed, mobile platforms are increasingly becoming ubiquitous for businesses. They reflect their constant need to improve productivity and connectivity while saving costs. And like many budding platforms, it’s bound to create tremendous opportunities, especially for enterprise-focused developers. ", "But how does this affect how data is handled in the digital pipeline? ", " ", "In June 2017 alone, over 1,000 Android and iOS enterprise apps were ", " to have unsecure communication between the apps and their backend systems. Around 43 terabytes of data were exposed, with at least 39 affected apps leaking 280 million records of personally identifiable information (PII). A ", " in 2016 found that 90% of scanned healthcare and finance-related mobile apps had major security flaws. ", "These echo the Open Web Application Security Project’s (OWASP) latest ", " of the most prevalent mobile risks. These comprise superfluous functionalities as well as unsecure data storage and networks. There were also little to no authentication and cryptographic mechanisms in place to deter hackers from reverse engineering and ", "/spoofing or modifying them. ", "These apps, for instance, secretly allowed access to device features like the camera or voice recorder, as well as PII like photos, contacts, messages, calendar, location, and browsing history. Obviously, there are significant repercussions when they fall into cybercriminal hands. ", "Privacy is also at the forefront of mobile app use regardless if it’s a business protecting its corporate data or an end user safeguarding their personal information. These highlight the need for thorough ", " into their security to mitigate the misuse of data or prevent malware infection. Recent incidents in ", ", ", ", ", ", and ", " mobile apps, as well as Xiaomi’s ", ", are a case in point. ", " ", "The mobile ecosystem is indeed increasingly blurring the line between personal and professional use, what with the adoption of ", " where apps use the same network and access the same data. Despite all these challenges, there are a few things mobile app developers can do to provide corporate resources without compromising the business’s security and privacy. ", "So what can mobile app developers do? ", "Limit the permissions requested to only the necessary information or device components required for your app to function. Exploits and malware leverage the user’s elevated privileges. Mobile devices are no different. Understanding the data you collect gives you the context to define your app’s trust boundary. Ensure that your application programming interface (API) implements this principle in its workflow. ", " ", "Flaws in an app's authentication and authorization are common vectors for mobile threats. These enable hackers to impersonate other users via ", ", or access the device or the app's functionalities (bypassing PIN codes, injecting malicious code in the app, etc.). These are the bane of online banking apps, for instance, given the profit that can be made from gaining access to an end user’s bank account and stealing financial records. Developers should secure functions like verifying an employee’s user identity or determining what resources a consumer can access or execute within the app. ", "Implement strong authentication patterns. If you’re already using authentication protocols like OAuth, migrate to the latest standards. ", ", for instance, provides single sign-on and third-party authorization without sharing sensitive credentials. Facebook, Microsoft, and Google use OAuth 2.0 for their APIs. For developers whose consumer apps offer in-app purchases, follow ", " or Apple’s guidelines. iOS has one for ", " with the App Store, for instance. ", "Ensure that your apps enforce ", ". Consider implementing ", ", an industry specification that securely stores PII in the local device—from biometric data (e.g., fingerprint) and passwords to tokens. FIDO also helps reduce the work developers have to allocate for creating multiple secure login interfaces, which can be challenging if clients run different operating systems (OSes). ", "Also: build a secure API. It's the lifeblood that underpins the core functions of your app and how data is stored. APIs are also the framework used for accessing backend services and various other applications for users, all of which entail authentication and authorization. ", " ", "Many businesses already have policies for platforms such as those that manage remote access like virtual private network (VPN), firewalls, network, databases, and servers. These reduce the machine’s attack surface. Mobile app developers should also take this into account, especially those involved in homegrown enterprise apps. ", "Ensure that the libraries and frameworks accessed by the app are secure. Contextual data, e.g., location, time of day, histories or previous transactions, etc., can be used to create authorization/access policies. Ultimately, the app you create should align with corporate policies applied by the organization’s IT/system administrators, or Google Play and Apple’s App Store. ", " ", "Adopt best practices and follow industry standards when encrypting your apps (or strengthen the API’s encryption if they already have one). Weakly protected apps are easily spoofed, and attackers can use these ", " to infect devices with malware. There are many code obfuscation and minification tools available to ", " developers, while multi-pass checks and malformed Mach-O binaries are just some that iOS developers can employ. Developers should also implement validation of client code signatures, which prevents sensitive information from leaking. ", "Developers can also integrate a VPN to further secure the app’s network connections. Consider stacking your application layer protocols with Secure Sockets Layer (SSL) and Transport Layer Security (TLS). There’s also Hyper Text Transfer Protocol Secure (HTTPS) that runs on top of SSL and wraps data into SSL packets. ", "Apps developed for accessing corporate network and databases (especially via BYOD devices) can also benefit from application containerization, where apps are deployed in a contained environment, like in virtual machines. It prevents the app from interacting with the device’s other (and personal) data and apps. ", " ", "Security flaws are the bread and butter for many mobile threats, which is why regularly testing your app’s source code against vulnerabilities, like input validation issues, is critical. The app should accordingly be agile—easy to patch and update. ", "There are many tools at the developer’s disposal, such as Trend Micro’s ", ", which scans the app for security and resource consumption. OWASP’s ", " of top mobile risks is a good starting point to check for issues within your app. ", "Identify the nuances of the platforms you’re creating the app for and take their respective attack surfaces into account. Mapping the components and their interdependence with each other, for instance, can provide developers an overview of data that may be potentially exposed (or stolen). The app’s runtime, binary, and file system should also be further analyzed to check for possible network and client-side attack vectors. ", " also helps businesses by assessing the apps before they are released to marketplaces like Google Play and Apple’s App Store, and in turn downloaded and installed. ", " ", "Developers who want to capitalize on the thriving mobile app development industry must go beyond an application’s functionality and ease of use. Privacy and security must also be its selling points—from app specification, coding, testing, and implementation to deployment. ", "After all, developers are ultimately responsible for maintaining the integrity of their apps throughout their lifecycle. Beyond regular compliance, developers also need to consider the potential risks involved with using their applications, such as the nature of data stored and the users who can access them. Apps that use and share information across the businesses, as well as integrate them to other platforms like social media, should be vetted to ensure they conform to the latest security standards. ", "™ ", " provide device, compliance and application management, data protection, and configuration provisioning, as well as protect devices from attacks that leverage vulnerabilities, preventing unauthorized access to apps, as well as detecting and blocking malware and fraudulent website."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/ethereum-platform-enigma-attacked-nearly-500k-stolen", "date": "August 23, 2017", "title": "Ethereum Platform Enigma Attacked, Nearly $500k Stolen ", "articleContent": [" just a few weeks before a highly anticipated Initial Coin Offering (ICO) as the company warned that certain accounts in their system were compromised.", ", nearly ", " by hackers who manipulated users into sending money to their cryptowallet by altering the enigma.co website, posting messages using a Slack administrator account, and sending spam emails to the company’s mailing lists. The messages created a false sense of urgency for the company’s prospective customers via a presale announcement.", "Enigma posted an advisory ", " on August 21 that warned users of the attack. The company clarified that the presale could only be conducted via a Simple Agreement for Future Tokens (SAFT), which is a legal document required for legitimate transactions. They also clarified that the actual website that will offer the tokens remains unaffected and that the September 11 ICO will push through as planned.", ", the incident may have stemmed from a separate hack involving Enigma CEO Guy Zyskind's email, which resulted in information about Zyskind’s email address being dumped on the web. This same information was eventually used to pull off the attacks.", "This comes just a little over a month after similar cryptocurrency theft incidents on other trading platforms such ", ", which were also conducting their own ICO, and Classic Ether Wallet, ", ". ICOs—which offer investors the opportunity to use  cryptocurrencies in various projects—are not under any form of regulation as of the moment. However, this might change in the near future as the Securities and Exchange Commission (SEC) recently announced that ICOs fall under securities regulations, which will place stricter measures in place for future ICOs.", "The Enigma fiasco once again highlights that despite the advantages of cryptocurrencies, it is still prone to attacks from cybercriminals who are looking to take advantage of the still largely-unregulated industry. ", ", as cybercriminals can use psychological engineering to turn basic spam and ", " into effective attack vectors. By implementing measures that aim to ", ", users can ensure that they don’t fall victim to malicious elements. This incident also highlights ", ", as a single compromised account can lead to huge losses for both the company and its customers."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/defray-ransomware-sets-sights-on-healthcare-and-other-industries", "date": "August 29, 2017", "title": "Defray Ransomware Sets Sights on Healthcare and Other Industries ", "articleContent": ["Widespread ", " attacks are becoming more common, but while the usual “spray and pray” methods allow ransomware to affect the most number of victims possible, other strategies are more discriminatory. ", "The newly discovered Defray (detected by Trend Micro as ", " and ", ") ransomware employs a more targeted approach. ", " say that Defray distributors are pursuing healthcare, education, manufacturing, and technology organizations using a tailored ", " strategy. These industries, ", ", have always been particular favorites of ransomware authors.", "As with most ransomware, Defray is spread through phishing emails which try and coerce victims into downloading a malicious file. The proliferation of ransomware through email is well-documented. A ", " found that email was the most common entry point, with 79% of ransomware detected coming from spam mail.", "Luckily, the Defray attacks have been ", ", and so far only minor campaigns have been tracked. The phishing emails the authors use are well-crafted—for an attack targeting a hospital, the phishing email was from a “hospital IT manager” and the malicious files were disguised as patient reports. In other emails, the attackers masqueraded as a UK-based aquarium company asking for a quote or order, and the malicious file had an “official” logo attached. The specificity and detail show a definite effort to convince targets of their legitimacy, and the more tailored lures show the attackers are investing in more specific targets.", "Despite cosmetic changes to the name, the malicious file is the same. Attackers used a Word document with an embedded OLE packager object. If the victim clicks on the OLE file, the ransomware (camouflaged as a taskmgr.exe or explorer.exe file) is installed. The ransom note that follows asks for US$5,000 in bitcoin and also includes three email addresses for contacting the developers. The note actually encourages victims to email them, and even negotiate payment. The authors also provide an alternative communication channel—BitMessage—in case email takes too long. ", " confirm that after encrypting files, Defray will track programs that might interfere with its purpose—task manager or web browsers will be shut down with a GUI.", "Ransomware authors are becoming smarter with their attacks, and as security professionals become more aware of new tricks and techniques they can better defend their organizations and enterprises. There are ", " that every IT/system administrator should implement, as well as effective multilayered security solutions that can help protect against this threat.", "Email and web gateway solutions such as ", " and ", " prevent ransomware from ever reaching end users. And as we see more advanced malware evade traditional security, ", " leverages cross-generational techniques, including Custom Sandbox Analysis, to detect targeted ransomware. At the endpoint level, ", " deliver several capabilities like high-fidelity machine learning, behavior monitoring and application control, and vulnerability shielding that minimize the impact of this threat.", " and ", " provide virtual patching that protects endpoints from threats that abuses vulnerabilities.", "Deep Security™ provides protection via the following DPI rule:", "For TippingPoint the applicable rule is:"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/internet-of-things/how-secure-are-your-internet-enabled-voice-assistants", "date": "August 23, 2017", "title": "How Secure are your Internet-Enabled Voice Assistants?", "articleContent": ["View Infographic: How Secure are your Internet-Enabled Voice Assistants", "Households all over the world are rapidly adopting conversational user interface (CUI) technology, or the tech behind the voice assistants we know as Siri, Alexa, Cortana, and Google Assistant. Reports say that over", ", and the growth shows no sign of stopping. As more of these devices become available, users are quickly using them to their fullest potential, creating increasingly connected homes.", "We are slowly moving away from the keyboard as the primary input device—why type when you can just use your voice to ask a question or issue a command? But this technology opens up new questions on how voice data can be manipulated and how these devices can be compromised. There are concerns regarding privacy and safety, which is natural since these smart devices control certain home functions. The fact that the devices can listen in on conversations and potentially record them also raises serious privacy issues.", "Recent events show that even legitimate corporations are finding unique ways to abuse the devices’ sensitivity to sound. One example ", ", which crafted an advertisement that deliberately exploited voice assistants to trigger a definition search for their product. It was a blatant and successful exploit of the capabilities of the devices—and not illegal. New technological territory means that there are no rules governing the use of these devices.", "There have also been incidents where these devices recorded information or followed commands unintentionally. While", " in at least one case, it also has its share of downsides. On the manufacturer's side—they can collect and store data, creating user profiles that may be vulnerable. And, of course, there are always malicious attackers who try to exploit the latest technology or look for new ways to steal personal data.", "This infographic details the various ways that the devices can be compromised, and also suggests some best practices for users as well as manufacturers. This technology provides convenience and a lot of other benefits to its users, but safety and privacy are crucial issues for any device that is so connected to the home.", "Users can take a step in the right direction and install security solutions that protect their voice-enabled devices. ", " has web protection and deep packet inspection, leveraging the right capabilities to protect smart voice assistants connected to routers. It offers gateway solutions that can weed out potential threats before they enter the home."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/mitigating-common-security-threats-to-small-and-medium-businesses", "date": "August 30, 2017", "title": "Mitigating Common Security Threats to Small and Medium Businesses", "articleContent": ["organizations, from the largest multinational corporation to smaller single proprietorship businesses, are vulnerable to security risks. However, Small and Medium Businesses (SMBs) are particularly exposed to malicious attacks. ", "SMBs face a different set of security challenges compared to larger companies with more resources. This piece takes a closer look at the security threats that SMBs have to deal with, as well as the challenges they might face when implementing proper security measures.", "The reality is that for many SMBs, their limited budget leaves them less room to address security threats as they happen. While larger organizations often have dedicated IT professionals for handling network security, SMBs are less likely to dedicate resources to full-time security handling and monitoring.", "Most smaller organizations will have one-size-fits-all IT teams that handle everything from software installation to virus removal. However, these employees are rarely trained to handle cybersecurity issues, and will often resort to using free security solutions that will usually only deliver the bare minimum in terms of detection and prevention.", "Essentially, the main problems for SMBs when it comes to cybersecurity can be summed up in two words: money and personnel.", "Given the limitations, there are still a number of ways SMBs can maximize their security capabilities. Before we delve into these strategies, let us take a look at some of the most significant threats that SMBs face on a daily basis.", "In a way, SMBs make the perfect target for", "—they're likely to have enough resources to pay the ransom, but not enough to have proper security teams and might not have a solid backup process in place. Ransomware often arrives via malicious attachments, typically spam mail or downloaded via malicious links.", " that can prevent ransomware from affecting the entire network system, as well as a large number of backups that they can use in case of infection. On the other hand, ransomware will often have a larger effect on a smaller business' network due to minimal backup policies and a general lack of effective security solutions. Ransomware can be devastating for smaller businesses, as a single infection on a server could wipe critical data or shut down the organization's operations. The challenge usually doesn't lie in the ransom demand itself—in fact, the ransom demand is the least of a small businesses worries. It’s the time and effort required getting systems and servers back online. Some ransomware variants are considered annoyances for organizations with stronger security measures; while they can still cause some damage, they won’t necessarily cripple operations. This isn’t true for many SMBs.", "A key to mitigating ransomware attacks is to regularly back up important data. Backups do not have to be expensive or complicated either, as it can be done by simply setting up a regular backup schedule on separate systems. SMBs can also consider regularly backup up their data to offline storages that are not connected to the rest of the company’s network infrastructure.", "SMBs should always keep their systems updated with the latest security updates and patches. Many malware exploit vulnerabilities to infect their target, similar to the way WannaCry infected unpatched systems. Larger organizations often have to deal with patch lag due to the challenge of having to update a large number of systems that might also have proprietary software installed. SMBs will usually not have this problem, and thus should apply patches as soon as they're available. In addition, updating software from older, unsupported versions should be a priority, despite the additional costs.", "Cybercriminals also often use phishing attacks to target their victims, which makes security awareness equally important. This costs nothing and can be as easy as reading guides on ", " attacks. A large number of infections can be prevented by simply educating employees on the strategies cybercriminals use to spread malware.", " involves preventing users from accessing certain services – often network based ones—by flooding it with meaningless traffic. Many DDoS attacks are similar to ransomware in that they are usually done as part of an extortion campaign, and like ransomware, these attacks can cripple a company. Again, resources play a significant role here. An SMB hit with a DDoS attack will find it more difficult to recover compared to larger organizations who have access to better protection. SMBs don’t even have to be targeted themselves to be affected by a DDoS attack. For financial reasons, many SMBs turn to IT hosting rather than hosting their own, placing them at risk of becoming collateral damage for any attack that targets their providers. Many small organizations often place a large portion of their operations online, due to the lower costs and simplified logistics. Now imagine a DDoS attack that takes down an online store’s website for days. That means zero transactions, thus zero sales for the company.", "For a small organization, there is little that can be done once a DDoS attack is underway, hence the best mitigation strategies involve monitoring and preventing potential attacks before they happen. One of the ways SMBs can prevent or at least minimize DDoS attacks is by overprovisioning bandwidth. While this might be more costly, it can help prevent DDoS attacks from completely overwhelming the organization’s IT services. Another option is to use cloud-based services, which are more scalable when considering DDoS attacks. In addition to not having to maintain network infrastructure for their services on the cloud, SMBs can also take advantage of their service provider’s resources for dealing with DDoS attacks.", "Another method that can help organizations keep websites up and running during a DDoS attack is to have a backup website that mirrors all the data contained in the original website. This can serve as a temporary website to keep customers aware of the situation while attacks are happening. While this translates to added costs, but it could be a viable option when considering the risks. Furthermore, there are security solutions that specifically detect and prevent DDoS attacks by monitoring network traffic for any unusual activities, giving organizations enough time to respond.", "SMBs can fall victim to", " as they can often be easier targets compared to larger organizations with sophisticated tools and preventive security measures. PoS attacks often fall into three main categories: malware, skimmers, and compromised machines. SMBs are vulnerable to all three types. While PoS attacks are different from the earlier examples in that they don’t usually totally cripple a business’s operations, they still cause a significant amount of damage—usually financial—to the affected organization.", "Take, for example, PoS malware, which can steal information from SMBs. While this does not directly affect an organization’s operations, it can result in the stolen information being peddled in the underground or used for other malicious purposes. A cybercriminal can also use this information to perform unauthorized transactions. This will lead to chargebacks and disputes with credit card providers, and can result in financial penalties in addition to the losses from the actual PoS attack itself.", " Smaller organizations should avoid purchasing PoS products from unreliable sources. As tempting as it might be to save money because they're cheaper, they could cause more problems in the long run if they turn out to be compromised machines or come loaded with malware. It would also be a good idea to migrate to EMV technology if possible, as this can greatly cut down on instances of skimming. Another option is to outsource PoS handling to larger dedicated organizations that can handle processes and security better.", "For PoS malware, organizations can look into implementing access controls as well as isolate PoS terminals from the rest of the network. This could help prevent the stolen data from being sent to the attackers C&C servers due to the lack of internet access.", "Protecting SMBs from cyber threats can be a challenge, but it can be accomplished with the proper use of easily available security resources, as well using security solutions that are tailored to smaller organizations with a limited budget.", "Security solutions do not have to be expensive. SMBs can take advantage of multilayered solutions such as ", ", which provides a comprehensive list of IT security features such as ransomware protection, spam prevention, and centralized management for easier monitoring of endpoints. This solution is designed to make SMB security a hassle-free experience by providing endpoint, web security, and email protection in a single bundle -- allowing SMBs to protect their employees anytime, anywhere. Furthermore, ", " lets SMBs lock down devices and have control over what applications run on their networks, helping prevent PoS malware from infecting the organization. "]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/ukraine-hit-by-new-malware-attacks-via-a-compromised-web-server", "date": "August 24, 2017", "title": "Ukraine Hit by New Malware Attacks via a Compromised Web Server ", "articleContent": ["Ukraine became the center of a cybersecurity storm after ", " hit parts of Europe in late June. The country served as the ground zero for the attack, which was identified to have initially come from an update to an accounting software package used by many Ukranian companies. A recent attack put Ukraine back in the security spotlight with the discovery of new malware variants (Detected by Trend Micro as Mal_SageCrypt-1h, BKDR_TRICKBOT.SM, ", " and TSPY_EMOTET.SML3)—this time from Crystal Finance Millenium (CFM), another company that creates accounting software for businesses.", " from Information Systems Security Partners (ISSP), CFM’s web servers were compromised by hackers, which they then used to store the malware. The attackers then sent phishing emails that came attached with ZIP files containing JavaScript files. When executed, these JS files would then download the load.exe file from CFM’s compromised web server. This file is responsible for executing the malware used in the attack. Additional data from ISSP indicates that this could just be a smaller part of a larger campaign, as load.exe files were also found on the web servers of other companies.", "The researchers also mentioned that this new attack could possibly be timed to coincide with Ukraine’s Independence Day on August 24. The Ukranian Central Bank had already previously warned both state-owned and private lenders of the new malware. State cyber police also mentioned this discovery.", "CFM’s web provider has taken down the company’s website to ensure that the malware involved in this incident does not spread further.", "This latest incident shows that organizations need to prioritize securing their servers, as it can be used for malicious purposes. By appearing as originating from a seemingly “legitimate” source, the attackers were able to trick the victims into believing the legitimacy of the phishing emails used in the attack. For companies, ", " for website credentials, as well as using measures such ", " and ", " can be used to minimize the effects of targeted attacks, while on the endpoint level, a combination of common sense and", " can help prevent infection.", "™ ", "™ provides detection, in-depth analysis, and proactive response to today’s stealthy malware and targeted attacks in real-time. It provides a comprehensive defense tailored to protect organizations against targeted attacks and advanced threats through specialized engines, custom sandboxing, and seamless correlation across the entire attack lifecycle, allowing it to detect threats even without any engine or pattern update.", " is designed to quickly detect advanced malware that typically bypasses traditional security defenses and exfiltrates sensitive data. Using specialized detection engines and custom sandbox analysis, attacks can be detected and prevented.", "™ ", "™ with ", "™ endpoint security infuses high-fidelity machine learning with other detection technologies and global threat intelligence for comprehensive protection against malware and other threats. Trend Micro’s security solutions that come with Predictive Machine Learning and all relevant ransomware protection features enabled are already protected against advanced threats.", "Our products, such as Deep Discovery also come with The Advanced Threat Scan Engine (ATSE), which uses a combination of pattern-based scanning and heuristic scanning to detect document exploits and other threats used in targeted attacks.", ", powered by XGen™ security, enables 360-degree detection of network-based targeted attacks and advanced threats. By using specialized detection engines and custom sandbox analysis, TippingPoint Advanced Threat Protection for Networks identifies advanced and unknown malware, ransomware, zero-day exploits, command and control (C&C) communications, lateral movement and evasive attacker activities that are invisible to standard security defenses."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/mobile-safety/faketoken-android-banking-trojan-returns-as-a-ride-sharing-app", "date": "August 22, 2017", "title": "FakeToken Android Banking Trojan Returns as a Ride-sharing App", "articleContent": ["Planning your next ride from your favorite ride-sharing app? If it asks for your credit card data more than once, malware might be at play. ", "Security researchers ", " an iteration of the Android banking Trojan FakeToken (detected by Trend Micro as ANDROIDOS_FAKETOKEN) posing as a ride-hailing application. This version of FakeToken was also seen masquerading as payment apps for traffic tickets as well as hotel and flight booking. ", "FakeToken’s ruse is notable given the worldwide popularity of ride-sharing, taxi, carpooling, and transportation apps like Uber, Lyft, Sidecar, Easy, and Grab, and it poses significant risks to users. For instance, the number of installs for the Uber app on the Google Play Store alone ranges between 100 and 500 million. ", " ", "But more than the ubiquitous usage of ride-sharing apps is the kind of information stored and used on these applications: financial and personally identifiable information. The latest version of FakeToken steals these by monitoring the apps installed on the device in real time. When the user runs a certain application, i.e. a ride-sharing app, it is overlaid with a phishing page that then prompts the would-be victim to input his payment card details. The fake phishing page features an identical user interface, including the logos and color schemes. ", "This version of FakeToken can also intercept incoming SMS messages and forward stolen data to the cybercriminals’ command and control (C&C) severs. This snooping routine enables them to bypass two-factor authentication and similar verification processes employed by banks or mobile services. More daunting, however, is FakeToken’s capability to monitor and record phone calls, which will be saved and uploaded to the bad guys’ C&C servers. ", " ", "FakeToken first ", " in 2013 as a bank information-stealing mobile malware. It also dabbled as a ", ". It did so by misusing Android’s device administration application program interface (API), commonly used by enterprise apps, to change the device’s passcode and lock its screen. In 2016, ", " had the most variants distributed by cybercriminals. During the same year, mobile banking Trojans were the most pervasive in Russia, rounded out by Australia, Japan, Romania, Germany, Ukraine, and Taiwan. ", "While the latest version of FakeToken is currently distributed around Russia and countries in the Commonwealth of Independent States—it won’t take long before it hitchhikes its way across the world. Don’t overshare information and limit the permissions you grant to your apps. Also, be wary of unsolicited text messages, especially if they have suspicious links. Adopt best practices to ", ", and especially so if they are under a ", "."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/kovter-an-evolving-malware-gone-fileless", "date": "August 18, 2017", "title": "KOVTER: An Evolving Malware Gone Fileless", "articleContent": ["While a large number of malware come and go, rarely seen after their initial campaigns, some have remained strong through the years. A common feature of the most persistent malware is their ability to evolve: their initial infection methods, behaviors and payloads rarely stay unchanged.", " (detected by Trend Micro as KOVTER family) is one example of a constantly evolving malware. Initially ", ", it eventually evolved into a much more effective and evasive fileless malware. Here is a closer look at KOVTER, as well as tips on how organizations can lessen its impact in case of infection.", "The malware known as KOVTER has gone through various changes during its lifespan.", "The ", " of the malware pegged it as a police ransomware, where it remained in a target system waiting for the right opportunity—usually when the user downloaded illegal files. Once triggered, it notifies the user of illegal activity along with a “fine”, which equates to its ransom demand. However, this early version was not too effective, as it required the correct set of conditions and could easily be detected and removed.", "The second, and perhaps most visible variant of KOVTER was that of a click fraud malware. This variant used code injection to infect its target, after which it stole information that it then sent to its Command & Control (C&C) servers.", "In 2015, KOVTER evolved again into a fileless malware, which it did via the installation of autorun registry entries. It evolved further in 2016, adding file components and registry entries that made use of a shell spawning technique to read the malicious registry entry.", "One of the most common infection methods for KOVTER is via attachments coming from macro-based malicious spam. Once the malicious attachment—usually compromised Microsoft Office files—are clicked, the malware installs a shortcut file, batch file, and a random file with a random file extension in a randomly named folder usually located in %Application Data% or %AppDataLocal%. Registry entries based on the random file extension are also installed in Classes Root to direct the execution of the random file into reading a registry entry. These components are used to perform the malware's shell-spawning technique.", "For the next part, the registry entry for the random file is created, containing malicious scripts that perform KOVTER’s processes. This means that the moment the infected machine restarts or either the shortcut or batch files are triggered, the malicious script in the registry entry is loaded into memory. The malicious script contains a shell code that the malware injects into the PowerShell process. The shell code will then decrypt a registry entry located in the same registry key. This registry entry is a binary file that is injected into a spawned process (usually regsvr32.exe). The spawned regsvr32.exe would then try to connect various URLs as a part of its click fraud activity.", "Upon installation of all these file components and registry entries, the malware spawns a watchdog process that continuously monitors the existence of these components.", "Given its almost fileless technique, KOVTER has become much more difficult to detect and mitigate. However, there are some things organizations can do to mitigate the malware’s impact. Here are some examples of effective mitigation techniques:", " "]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/banking-malware-emotet-and-trickbot-go-phishing-again", "date": "August 17, 2017", "title": "Banking Malware EMOTET and Trickbot Go Phishing... Again", "articleContent": ["Two banking Trojans resurged in a span of five days: EMOTET and Trickbot, detected by Trend Micro as TSPY_EMOTET and TSPY_TRICKLOAD, respectively. These banking malware are distributed through socially engineered malicious spam and ", " emails. Security researchers also noted the capabilities and techniques used, including its ", "-like propagation, dropping additional malware into the affected machine, and mimicking the banks’ domains. ", "EMOTET first ", " in 2014 targeting customers of German banks. Unlike other banking malware that employed malicious field insertions/phishing pages to steal banking information, EMOTET was capable of “sniffing” the data sent over network connections. This feature allowed attackers to bypass secure connections like HTTPS and evade traditional detection techniques. In December 2016, Trend Micro ", " its reappearance in the same region, along with old but familiar information stealers ", " and ", ". ", "The latest ", " of EMOTET also entailed dropping DRIDEX as additional payload. Malicious links in the spam email will redirect would-be victims into a domain hosting a Word document embedded with Visual Basic code that triggers a PowerShell script. This script will download and execute EMOTET and other payloads, the most common of which is DRIDEX, from various attacker-owned domains. ", " ", "Trickbot is a banking Trojan that sends users banking-related website pages that almost look like the real thing. An iteration of older malware ", ", Trickbot is also ", " via malicious spam containing HTML attachments. These HTML files download a Word document masquerading as a login form. It’s actually embedded with a malicious macro that retrieves Trickbot from the cybercriminals’ command and control (C&C) server when enabled. ", "Trickbot’s operators have been observed actively pushing the malware through various spam email campaigns. The first campaigns this year were observed last ", " and ", ", targeting financial institutions and their customers in the US, UK, Australia, Switzerland, and Germany. ", " ", "The ", " is also not immune. Android banking malware Bankbot (ANDROIDOS_BANKERSMS.OPS) ", " early this year, initially targeting Russian users via third-party app marketplaces. Now, it has more than ", " in its list of targets, including those in Austria, France, Austria, the Netherlands, and Turkey. Bankbot was built from the source code of another banking Trojan that was leaked and fine-tuned by Bankbot’s operators. ", "This Android malware isn't just capable of stealing banking credentials and credit card data information; it also monitors and intercepts text messages, which enables the bad guys to bypass verification methods like two-factor authentication. It's also capable of mining credit card data stored in apps installed on the device, like Facebook, WhatsApp, Google Play, and Uber. In ", " and ", " this year, several Bankbot-infected apps made their way into Google Play, posing as video or online banking apps. The said apps have since been taken down. ", " ", "The spate of campaigns that deliver information stealers reflect how hackers value personally identifiable information. This is especially true for financial data, as these can be used not only for emptying bank accounts, but also as tradeable commodities in the ", ". In 2016, fraud and identity theft have cost businesses and end users over ", " in losses. ", "While these threats still rely on old tactics such as the use of macros and spam messages, they are compounded with techniques that provide stealth. Case in point: the increasing use of vectors that aren’t typically used to deliver malware, such as ", " or legitimate system administration tools like ", ". EMOTET and Trickbot’s self-replication capability also seems to draw inspiration from the notorious ", " and ", " outbreaks. ", "How can enterprises and end-users avoid or defend against these threats? Follow best practices for ", ". An attacker has a lot to gain with just a single typo. Identify the tell-tale signs of malware gone phishing: the sender’s name, email address, URL/domain, grammar and spelling errors, unsolicited request for personal information. Employ ", " to your organization’s email gateway and ensure that your ", " can filter, validate, and block malicious traffic like anomalous data exfiltration."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/best-practices-ransomware", "date": "August 11, 2017", "title": "Best Practices: Ransomware", "articleContent": ["No business or user is too big or too small for ", ". In 2016, it cost victims over ", " in losses. As far as impact is concerned, look no further than the ", " and ", " outbreaks that affected thousands. Affected ", " had to turn away patients or ", " their emergency wards. Car manufacturing plants had to ", " production, and power grids were ", ".", "Indeed, as ransomware further ", ", so should the IT/system administrators and information security professionals who protect their organization’s crown jewels; end users must be equally proactive, and defense in depth must be practiced to combat them.", "Here are some best practices for mitigating ransomware.", "Ransomware capitalizes on fear—the fear of getting locked out of your machine, losing access to mission-critical or personal data, or disrupting business operations. Eliminate the data kidnapper's leverage by regularly backing up your files. Practice the 3-2-1 rule by creating three backups in two different formats with one stored offsite. When backing up your data, ensure its integrity. Backups are only valuable if they're accessible. Periodically test your backups to check that they're readable. Simplify (and document) your backup procedure so that authorized staff can easily retrieve them when needed.", "Many file-encrypting malware take advantage of vulnerabilities to get into the system. WannaCry, for instance, had a ", " via the EternalBlue exploit, allowing it to spread like wildfire across networks.", "Patching and keeping the OS and its software/programs updated can effectively thwart attacks that exploit security flaws. For ", " and vulnerabilities whose patches may be unavailable, consider ", ".", "Cybercriminals are increasingly abusing legitimate utilities and system administration tools to install and execute malware. This modus operandi provides bad guys efficiency, convenience, and stealth.", "Ransomware is no different. Petya made use of ", ", while many ", ". Master boot record-wiping ransomware ", " used freeware and commercially available software.", "Cybercriminals need only hack the weakest link for which no patch is available: the human factor. ", " is a staple tactic for many ransomware vectors, and it’s equally important that organizations foster a security-aware workforce. Go beyond regulatory compliance. Develop and constantly fine-tune your proactive incident response and remediation strategies. A culture of cybersecurity in the workplace is just as important as the ", " that stop them."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/disk-locking-hddcryptor-mamba-ransomware-makes-a-comeback", "date": "August 14, 2017", "title": "Disk-Locking HDDCryptor/Mamba Ransomware Makes a Comeback", "articleContent": ["A variant of the disk-encrypting ransomware HDDCryptor (detected by Trend Micro as ", ") ", " infected a number of victims in Brazil and Saudi Arabia. This is the same family of disk-encrypting malware that ", " San Francisco Municipal Transportation Agency (SFMTA) in November, 2016, forcing the ", " to use hand-written route assignments and open the fare gates to prevent disruption.", "HDDCryptor, also known as ", ", first emerged in September last year. It can encrypt resources in network shares—drives, folders, files, printers, and serial ports via Server Message Block (SMB). It misuses a miscellany of freeware, open-source and commercially available software to scramble disks and mounted SMB drives, and locks the infected machine’s hard drive by overwriting its Master Boot Record (MBR) with a modified bootloader. Once an infected system restarts, it displays the ransom note instead of the normal log-in screen.", "Its infection vector is reminiscent of other families like ", " and ", " that leveraged exploits to gain unauthorized administrator-level access to machines before the malware is dropped and executed. By late November, HDDCryptor was ", " with more streamlined encryption routine as well as anti-sandbox and anti-debugging features to evade antivirus and other detection techniques better.", "Like ", ", the new variant of HDDCryptor employed PsExec to execute the ransomware on the compromised system. Of note are its changeable random demands; unlike other ransomware with fixed ransom amounts, HDDCryptor’s operators adjust the payment they demand from victims depending on the scale of infection. The feature was exemplified in the SFMTA attack, where the attackers ", " $73,000 worth of bitcoins instead. ", "HDDCryptor’s reemergence is a reflection of ", " in the threat landscape: more hard-hitting impact, targeted in scope, diverse in approach. And as echoed by the likes of ", ", ", ", and ", " families, there’s also the upward trend of abusing legitimate system and open-source tools. Another sign of increasing sophistication can be seen in the way attackers rehash leaks and dumps, like those released by the ", ", repurposing them to destructive effect. ", "As cybercriminals increasingly turn to targeting businesses for profit, enterprises must be equally proactive in securing their assets and platforms from which their mission-critical data change hands. Reduce your attack surface by adopting ", ": regularly patch and secure the applications and gateways used, enforce the principle of least privilege, strengthen your credentials, and harden your remote connections. Additionally, restrict or disable administration tools (i.e. PsExec, ", ") to systems that do not need it. There is no silver bullet for addressing threats like ransomware, which is why implementing defense in depth—multilayered security countermeasures—is recommended."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/mobile-safety/sonicspy-android-spyware-found-in-google-play", "date": "August 15, 2017", "title": "SonicSpy Android Spyware Found in Google Play", "articleContent": ["Security researchers have ", " over 1,000 apps infected with SonicSpy (detected by Trend Micro as ANDROIDOS_SONICSPY.HRX), a spyware that can let attackers hijack the affected Android device. At least three versions of SonicSpy-embedded apps also made their way into Google Play, which have since been removed from the app store. ", "SonicSpy was built on the source code of popular and legitimate messaging application Telegram, which was open-sourced to enable developers who want to customize their own messaging platforms. SonicSpy’s developer, however, added spyware and remote access functionalities into the apps and rebranded them with app names such as Soniac, Hulk Messenger, and Troy Chat. ", "The amount of SonicSpy-infected apps churned out by the creator—reaching over ", "—suggests that SonicSpy’s development was automated. Researchers also said the apps are being distributed via third-party app marketplaces as well as through ", ". Also known as SMS phishing, SMiShing is a type of ", " that uses socially engineered text messages to lure would-be victims into clicking a link or downloading malware. ", " ", "SonicSpy sports 73 remote commands, some of which include:", "SonicSpy is just one of the many mobile device-hijacking malware in the Android platform. In July, ", " backdoor emerged, disguised as a gaming and messaging app. GhostCtrl does more than just record photos or audio—it can download and delete files, for instance, as well as run shell commands, reset passwords—and true to name—get the infected device play different sound effects. ", "There’s also ", " that masqueraded as recreational apps, one of which had installs between 500,000 and a million on Google Play. Trend Micro’s analysis indicated MilkyDoor seemed to have been coded to breach enterprise networks and private servers. ", " ", "Indeed, as the adoption of the mobile platform become more ubiquitous, the threats that come with it will also ", " in diversity, scale, and scope. End users must strengthen their posture against these threats, especially if they are used to access and handle company networks and data. Follow ", ", and ensure that your ", " implement robust security and privacy policies."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/shadowpad-backdoor-found-in-server-management-software", "date": "August 16, 2017", "title": "ShadowPad Backdoor Found in Server Management Software", "articleContent": ["Security researchers ", " an advanced backdoor embedded in the server management software products of US and South Korea-based NetSarang. Named ShadowPad (detected by Trend Micro as ", "), the backdoor is capable of downloading and executing additional malware as well as stealing data. ", "NetSarang’s suite includes software for managing networks, servers, and system administration workstations. Affected organizations include those from industries such as financial institutions such as banks, energy, and pharmaceutics. ", "According to researchers, ShadowPad will call out to certain attacker-controlled domains and send the infected system’s information every eight hours. It’s also coded to call out to different domains every month. If the data sent to the attackers are of any interest, their command and control (C&C) servers will reply by triggering the backdoor’s routine to deliver additional payloads. ", "ShadowPad’s malicious codes were found to have been injected into a version of a dynamic-link library file (DLL), ", ", which was hosted on NetSarang’s website on July 17 and remained undetected until now. Also of note is ShadowPad’s level of obscurity, comprising layers of encryption and features a tiered mechanism that deterred the backdoor from activating unless its C&C server sent a particular packet to the compromised system. ", "NetSarang has ", " the incident, and has started implementing countermeasures, telling ", ", “we've created a completely new and separate infrastructure and have wiped every single device which will be placed into this new infrastructure. Each device is then examined, white-listed, and then placed into the new infrastructure one-by-one. This process will take several weeks, but we need to ensure that a compromise such as this is never again possible at NetSarang.” ", "NetSarang's software is just one of many that were misused to deliver malware. A legitimate accounting software was ", " to distribute Petya, for instance, while Mac ransomware KeRanger was ", " into a BitTorrent client. Even official releases of online games were infected with the notorious ", ". The mirror download server of a Mac-based open-source video transcoding application was also ", " to deliver the Proton backdoor. ", "As per NetSarang’s advisory, owners and managers of the affected software are highly encouraged to install the update. The affected builds are:", "Affected organizations are also urged to adopt best practices, such as ", " of their network infrastructure. It’s also recommended to employ additional mechanisms such as ", ", ", ", and endpoint-level ", " to prevent further exposure and mitigate any damage."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/hbo-twitter-and-facebook-accounts-hacked-by-ourmine", "date": "August 17, 2017", "title": "HBO Twitter and Facebook Accounts Hacked by OurMine", "articleContent": ["In light of the recent ", " detailing its willingness to pay US$250,000 in exchange for the 1.5 terabytes", " worth of data swiped by hackers from its servers, HBO finds itself dealing with yet another security breach.", "Known for hijacking prominent social media accounts, the self-styled white hat hacking group OurMine took over a number of verified Twitter and ", " accounts belonging to the cable network. These include accounts for HBO shows", " such as “Game of Thrones,” “Girls,” and “Ballers.”", "The hackers posted the same message across all of the accounts, which read, “Hi, OurَMiَne are here, we are just testing your security ,HBO team please contact us to upgrade the security - ourmine .org -> Contact” (sic). They also tweeted, “let’s make #HBOHacked trending!”", "The posts were deleted several minutes later.", "This is not the first time that OurMine has claimed responsibility for hacking high-profile social networking accounts. Last year, the group victimized ", ", The ", ", and even the heads of some of the biggest technology companies in the world. Mark Zuckerberg, Jack Dorsey, Sundar Pichai, and Daniel Ek — the CEOs of Facebook, Twitter, Google and Spotify, respectively — ", "have also fallen victim to the hackers, dispelling the notion that a career in software and technology exempts one from being compromised.", "Using complex and unique passwords for social networking accounts is not enough to make you completely safe on the internet. You must consider adding another layer of security such as ", ", which is a login method that requires two separate types of identification.", "A combination of a memorized password and a unique code that comes in through SMS or a smartphone app gives more security than just having single-factor authentication in place. Better yet, fingerprint scanning can be used on supported devices for even more security.", "If you’re a Twitter or Facebook user, you need only change your security settings to start using 2FA with your phone number. After setting up 2FA, you will be prompted to enter your password and the unique code sent to your phone number each time you log in.", "You can also easily ", " for other popular websites and online services."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/ransomware-recap-old-dogs-locky-samsam-hiddentear-learn-new-tricks", "date": "August 18, 2017", "title": "Ransomware Recap: Old Dogs Locky, SAMSAM, HiddenTear Learn New Tricks", "articleContent": ["On August 16, LG Electronics’ service centers were ", " hit by ", " ", ". The company shut down the affected self-service kiosks to mitigate the malware’s spread and shared threat intelligence to South Korea’s Internet and Security Agency. In ", ", WannaCry also made its way down to Victoria, Australia, affecting traffic lights and speed cameras. ", "The previous weeks showed that old dogs Locky, SAMSAM/Samas, Cerber, HDDCryptor, and HiddenTear learned new tricks to attack businesses and end users. ", "Security researchers uncovered several iterations of the notorious Locky ransomware (detected by Trend Micro as RANSOM_LOCKY family), with one variant, rebranded as IKARUSdilapidated, actively pushed by a widespread ", ". First spotted on August 9, the campaigns are powered by over 11,600 unique IP addresses from 133 countries, with more than 62,000 spammed messages sent in one day alone. ", "The spam emails contain a malicious Visual Basic script masquerading as either a Word document (.doc), archive (.zip), Portable Document Format (.pdf), or image file (.jpg, .tiff). When executed, it downloads and runs IKARUSdilapidated on the system. It uses typical social engineering lures: urging users to enable macros and obfuscating file attachments to evade detection. The ransom note demands a payment ranging between 0.5 and 1 bitcoin (US$2,145 to $4,290, as of August 18, 2017). ", "Several other Locky variants appeared in the previous weeks. A ", " that appends a ", " extension (which translates to “locking” in Finnish) to the files it encrypts employs a malicious JavaScript file, and demands a payment of 0.49 bitcoin ($2,102). Another Locky variety also ", " last week, this time appending the encrypted files with ", ". Both iterations employ spam emails as infection vectors.", "SAMSAM/SAMAS (RANSOM_SAMAS) made headlines in April 2016 when it hit ", " and education sectors in the US. ", " used a hacking tool to exploit vulnerabilities in servers running JBoss, an open-source application server that runs Java, and used worldwide by K-12 schools. The compromised server is then used as an entry point from which attackers can spread the ransomware to the machines. ", "Security researchers ", " the recent spikes of SamSam distribution, but this time its operators seem to be more fastidious and can now check the scope of infection. If a single machine was infected, SAMSAM demands 1.7 BTC ($7,267). If more systems were taken hostage, the ransom goes up to 6 BTC ($25,650) to decrypt half of them. The ransom for getting all infected systems back online is 12 BTC, or $51,000. Last May, SamSam ", " the computer systems of Erie County Medical Center in New York and demanded a $44,000 ransom, which the hospital refused to pay. ", "Cerber (RANSOM_CERBER) is one of the ", ". And given that it’s peddled as a service in the cybercriminal underground, it has no shortage in variety. A more recent version is now capable of further monetizing their operations by ", ", for instance, along with credentials saved in Internet Explorer, Google Chrome, and Firefox.", "More recently, security researchers found that Cerber was actively delivered by the Magnitude ", ". Magnitude came to prominence last 2014 when its ", " made their way into ", ", redirecting site visitors to a malicious domain hosting a ", ". Magnitude is one of Cerber’s long-time ", ", leveraging security flaws in Adobe Flash Player as doorways into the system. Since the ", " and the ", " of its operators, Magnitude—like ", "—kept a low profile to avoid law enforcement. It has since become a private exploit kit used by a select group of cybercriminals. Magnitude was ", " for its latest evasion and payload delivery technique: binary padding. This entails adding data to the payload to increase the file size beyond what detection technologies (i.e., static AV signatures) can handle and analyze.", "HDDCryptor (", "), also known as ", ", also ", " in Brazil and Saudi Arabia. This time it misuses PsExec, a legitimate system administration utility, to hack into the targeted network shares and encrypt the files and hard disk. ", "It employs free and commercially available tools, particularly DiskCryptor, to lock the hard drive by overwriting the system’s Master Boot Record. When the machine reboots, it displays the ransom note instead of the login screen.", "This is a variant of the same ransomware family that scrambled the workstations of ", " and demanded a ransom of $73,000 in bitcoins. The agency had to open their turnstiles, offer train rides for free, and resort to handwriting bus routes—all to avoid disrupting San Francisco’s transportation system.", "Two more ransomware variants were spotted in the wild, both of which were derived from the publicly disclosed source code of ", ": InfiniteTear (RANSOM_INFINITETEAR.A) and 3301 (RANSOM_HIDDENTEARTHREE.A). ", "InfiniteTear is capable of encrypting 444 file types, including databases, document files, and multimedia, and appends the infected files with a ", "extension. It demands $320 in bitcoin, and gives an ultimatum of seven days before the decrypt key is deleted from their server.", "3301 appends the encrypted file with the same extension name, and is capable of encrypting 2,783 file types. Its payment site is hosted in Tor’s hidden service. However, unlike other ransomware, victims had to first input their location and the 3301-generated victim ID to know the amount they had to pay. Victims are also given a week before the decryption key is deleted. The ransom note also sports seven other languages, which indicates that 3301 is distributed at least in countries that use those languages.", "The previous weeks’ ransomware made use of multifarious attack vectors, which makes a multilayered approach all the more significant. Follow ", ", and implement defense in depth in your cybersecurity—from the gateways, endpoints, networks, and servers."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/cyberespionage-group-turla-deploys-backdoor-ahead-of-g20-summit", "date": "August 21, 2017", "title": "Cyberespionage Group Turla Deploys Backdoor Ahead of G20 Task Force Summit", "articleContent": ["A cyberespionage group known as Turla is ", " targeting invitees, guests, and nation-state participants of the upcoming G20 task force summit in Hamburg, Germany with a backdoor named KopiLuwak (detected by Trend Micro as ", ", ", ", and ", "). The payload is capable of exfiltrating data, as well as downloading and triggering additional malware and executing arbitrary commands on the infected machine. Security researchers have since notified CERT-Bund, Germany’s federal computer emergency response team.", "Turla’s latest campaign is noted for possibly using ", " and ", " emails that lure would-be victims with an email containing an invitation for a G20 Task Force summit on digital economy. The event is real, slated in October, and security experts note that the PDF, named ", ", attached in the spear-phishing emails appear to be a legitimate file but ultimately a decoy. It also drops a malicious JavaScript file that executes KopiLuwak in the infected system’s memory when decrypted.", "Turla, a Russian-speaking cyberespionage group, is known for using unique, stealthy tactics. They made ", " in early June when their command and control (C&C) servers were found hiding in the comment section of Britney Spears’ Instagram posts. The malware they delivered posed as a security extension/plug-in for Firefox and distributed via a compromised Swiss website. In ", ", they were able to conceal their C&C servers by exploiting and abusing poorly secured satellite-based internet services. In ", ", the cyberespionage group employed an open-source backdoor that targeted machines running the Linux operating system (OS).", "The attack chain of Turla’s latest campaign resembles one employed by other cyberespionage groups ", " and ", ". Real events and legitimate documents were used as decoys to install backdoors on the machines of their targets of interest. This enables them to move laterally within the compromised network as well as steal confidential and mission-critical data.", "These cyberespionage attacks highlight the need for organizations to be similarly proactive in order to prevent intrusion or mitigate their effects. IT/system administrators and information security professionals should adopt ", ". Keeping the OS and its programs updated should be intuitive—it helps prevent attackers from leveraging security flaws as doorways into the systems. Consider ", " in the absence of patches for certain vulnerabilities. Enforce the principle of least privilege. ", " and, more importantly, implement defense in depth—multilayered security mechanisms—to protect the security, integrity, and availability of your organization’s important assets."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/pawn-storm-group-uses-the-new-york-attack-in-its-latest-cyberespionage-campaign", "date": "November 08, 2017", "title": "Pawn Storm Group Uses the New York Attack in its Latest Cyberespionage Campaign", "articleContent": [" (a.k.a. Fancy Bear, APT28, Sofacy, and STRONTIUM) made ", " again after security researchers shed light on its latest cyberespionage campaign. The group’s latest spear phishing campaign involves the use of a malware-ridden Word document that uses the recent ", " in New York last October 31 as a social engineering hook.", "The report noted the abuse of Microsoft Office’s Dynamic Data Exchange (DDE) to invoke the command prompt to run PowerShell commands that retrieve and help execute a payload that profiles the affected machine. If it’s a target of interest, it is further infected with a backdoor (", " or Sedreco).", "DDE provides a way for data to be shared between various applications. When abused, it can allow attackers to implant instructions such as launching the command prompt, or running malicious code, regardless if macros are enabled or not. While not a novel technique, the misuse of DDE is gathering steam not only among cyberespionage groups, but even with financially motivated ", ". Even Locky ", " and its long-time partner in crime the ", " were recently seen ", " the same technique.", "But more than the traction that DDE’s misuse is gaining is also the recent spate of cyberespionage- and cyberpropaganda-related operations. The Council on Foreign Relations (CFR), for instance, has so far ", " 26 separate campaigns this year. And indeed, the past weeks alone saw a bevy of hacking groups looking to capitalize on various activities in the socio-political landscape. Some of them include:", "For organizations, these incidents highlight the importance of securing their perimeter—from gateways, networks, and servers to endpoints—as no platform is immune to these attacks. Here are some defense-in-depth measures that can help significantly reduce the enterprise’s attack surface:"]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/report-30-percent-of-top-ceos-have-had-their-company-email-passwords-leaked", "date": "October 30, 2017", "title": "Report: 30 Percent of Top CEOs Have Had Their Company Email Passwords Leaked", "articleContent": ["Nearly one in three world-class CEOs are ", " after using a service that was later breached. This is according to a recently released research, which found that 30 percent of CEOs of top companies across the globe had experienced having their password leaked on an online service they registered for using their work email. Focusing on CEOs at over 200 of the biggest companies in ten countries, the most common breached services CEOs used or linked their company email to are LinkedIn (53 percent)  and Dropbox (18 percent), followed by Adobe and Myspace.", "The research by F-Secure also ", " that 81 percent CEOs have likely leaked their emails and other personally identifiable information (PII) such as physical addresses, birthdates, and phone numbers, which were leaked via spam lists and leaked marketing databases. CEOs in the UK, USA, the Netherlands, and France were most prone to leaking their information in this manner, while CEOs hailing from Italy and Japan were at the bottom of the list. The research involved cross-matching company email addresses of CEOs against a ", " of leaked credentials.", "The release of the findings comes on the heels of the Federal Bureau of Investigation’s (FBI) ", " that Business Email Compromise (", ") attacks are on the rise and have already cost businesses worldwide billions of dollars. BEC attackers have been found to carefully research and closely monitor their potential target victims and their organizations.", "The leak of company email passwords due to the linking of work email and online services can gain cybercriminals’ access to corporate networks, and cause a wide range of damage ranging from intellectual property theft to huge financial loss. To mitigate this threat, users should ", " by using complex texts and characters. The ", " reports that 63 percent of confirmed data breaches involved weak, default, or stolen passwords. ", " can also prevent unauthorized access to your accounts.", "For businesses that already have security policies restricting the information employees can divulge on online services such as LinkedIn, they should ", " since attackers can also leverage sensitive information from these sites to gain a foothold into an organization.", "Users and businesses can also take advantage of solutions provided by ", ". It secures multiple devices, helps manage passwords, and guards against the most prevalent online threats."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/taking-steps-towards-secure-manufacturing", "date": "October 31, 2017", "title": "Taking Steps towards Secure Manufacturing ", "articleContent": ["In 2016, an independent study recognized the manufacturing industry as the ", ". While the ", " sector is still the most frequently attacked, attacks on manufacturing come as no surprise since it's an expansive industry that includes the automotive, textile, electronic and other subgroups that manufacture a multitude of different products. ", "Based on previous incidents involving attacks on manufacturing facilities, we've learned that attackers are fueled by different motivations, ranging from business rivalry and financial reasons, to simply wanting to cause widespread damage (sometimes for amusement).", "There are many possible motivations behind attacks on manufacturing industries. Unfortunately, there are also many security issues that make it easy for an attacker to do so.", "Cybersecurity presents unique challenges to the manufacturing industry, considering the size and scale of the machinery and systems typically found in manufacturing facilities. The systems used in manufacturing—specifically the Industrial Control Systems (ICS) which manage and monitor different aspects of production—have unique vulnerabilities that make them susceptible to cyberattacks. Firstly, manufacturers are connecting previously isolated systems, which increases the ", ". Upgrades are also installed piecemeal since the systems are very complex, so new software and security features are integrated with older systems slowly. And unlike the healthcare and financial sectors, the manufacturing industry is still adapting to cybersecurity and only have a few ", ", such as the ISA/IEC 62443 Standards set by the International Society of Automation (ISA).", "Other issues affecting the security of the manufacturing industry:", "Of course, because of the increasing attacks on the manufacturing industry, addressing these problems is a necessity. Gaining visibility on all assets and establishing monitoring protocols for each part of the system is a good first step. Update and patching policies have to be implemented as well—a challenge for those in manufacturing since it is a complicated undertaking that possibly requires an ICS overhaul and rigorous testing. Cyberattack response and breach prevention strategies should also be established and strengthened. ", "[READ: ", "]", "Of course, for such complicated systems, installing multilayered security for the network and connected devices is the best course of action.", "Trend Micro provides a variety of solutions which could be installed on ICS and SCADA devices to monitor the traffic to and from these systems. These solutions are good options for devices running non-standard operating systems or those that cannot support an agent.", "Trend Micro provides a variety of solutions which could be installed on ICS and SCADA devices."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/virtualization-and-cloud/a-misconfigured-amazon-s3-exposed-almost-50-thousand-pii-in-australia", "date": "November 06, 2017", "title": "A Misconfigured Amazon S3 Exposed Almost 50 Thousand PII in Australia", "articleContent": ["A ", " has accidentally compromised 48,270 personally identifiable information (PII) from Australian employees working in government agencies, banks, and a utility company. The leaked PIIs include full names, passwords, IDs, phone numbers, email addresses, and some credit card numbers. Salary and expense details were also exposed.", "25,000 staff records involving internal expenses from insurance company AMP were exposed, while utility company UGL had 17,000 records exposed. Affected government agencies include the Australian Department of Finance (3,000 employee records breached) and the Australian Electoral Commission (1,470), while the National Disability Insurance Agency had their details openly accessible.  1,500 employees at Rabobank were also affected.", "The Department of Prime Minister and Cabinet ", " that when the Australian Cyber Security Centre (ACSC) became aware of the situation, they immediately contacted the external contractor and worked with them to secure the information and remove the vulnerability.  ", " they added.", "Amazon S3 is a highly scalable cloud storage service where employees can store and retrieve data from websites and mobile apps. The PIIs were reportedly exposed following a misconfiguration on the system’s Amazon S3 bucket. No foul play has been suspected so far; the cause of the accidental breach points to an unnamed third-party contractor not properly securing the web service.  ", "This data breach incident is not the first one involving misconfigured Amazon S3 buckets this year. Financial publishing firm ", " exposed data including names, addresses, and partial credit card numbers of 2.2 million customers. Researchers also ", " a trove of sensitive corporate data in a publicly accessible Amazon S3 bucket owned by Verizon. ", " with classified security clearance were also compromised.", "This latest incident follows the massive data breach that took place in Australia a year ago when 1.2 million records relating to 550,000 blood donor applicants from the Australian Red Cross Blood Service were exposed. The private information contained in the leaked records included answers to a sensitive question on whether the applicant had engaged in risky sexual behavior over the past year. Other compromised information included names, blood types, birth dates, email and snail mail addresses and phone numbers.", " is optimized for AWS, Azure, and VMware to protect servers instantly. It reduces strain on your overburdened IT department by offloading security set up, management, and system updates to Trend Micro. Deep Security as a Service can start securing servers immediately without system installation or configuration."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/vulnerabilities-and-exploits/critical-vulnerability-cve-2017-10151-patched-in-oracle-identity-manager", "date": "November 02, 2017", "title": "Critical Vulnerability CVE-2017-10151 Patched in Oracle Identity Manager", "articleContent": ["Oracle ", " for a highly critical vulnerability found in its widely-used enterprise identity management system that allows an attacker to access enterprise software remotely without authentication. Tracked as ", ", the flaw in Oracle Identity Manager was issued a CVSS score of 10, which is the most severe vulnerability rating.", "It was ", " that an unauthenticated attacker with network access via HTTP could compromise Oracle Identity Manager, which makes it easier to exploit. Further findings also suggest that attacks may significantly impact other products.", " the company said in an ", ". Oracle also told customers that patches released through its Security Alert program are provided only for product versions covered under the Premier Support or Extended Support phases of its ", ".", "Affected versions of Oracle Identity Manager are as follows:", " is a system that helps enterprises manage the identities and access privileges of their customers, business partners, and employees. It also allows enterprises to set up delegated administrators, who are users empowered to manage the identities, passwords, password policies, and access of other users.", "As of writing, ", " were shared on who discovered the flaw or whether the vulnerability is being exploited in the wild. ", "Oracle just patched ", " in the company's quarterly patch update on October 18. Fixes for Oracle Fusion Middleware, Oracle Hospitality, Oracle MySQL, PeopleSoft, and Java were released to resolve problems that range from remote code execution bugs to SQL injection vulnerabilities. The next scheduled Oracle patch update is expected to be rolled out on January 16, 2018.", "™ ", "™ provides virtual patching and extensive ", " against network-exploitable vulnerabilities via ", "™ filters. ", "™ ", "™ and ", " also provide ", " that protects servers and endpoints from threats that abuse vulnerabilities in critical applications. ", "’s Vulnerability Protection shields endpoints from identified and unknown vulnerability exploits even before patches are deployed. ", "™ ", "™ provides detection, in-depth analysis, and proactive response to attacks using exploits through specialized engines, custom ", ", and seamless correlation across the entire attack lifecycle, allowing it to detect threats that may exploit vulnerabilities even without an engine or pattern update."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/enterprising-cryptominers-search-for-new-ways-to-profit", "date": "October 30, 2017", "title": "Enterprising CryptoMiners Search for New Ways to Profit  ", "articleContent": ["As this ", " notes, underpowered rigs will spend more on electricity than what they earn in Bitcoin. And as the reward for mining a block—which are the transactions that support Bitcoin—lessen, then it gets harder to make a profit. In 2016, the reward for mining Bitcoin was ", ", and payouts are projected to decrease approximately every four years. Also, Bitcoin mining is mostly becoming an ", " because profitable mining requires ", ".", "Faced with these facts, many individuals may shift their cryptocurrency mining ambitions to other currencies that are considered resistant to ASIC mining to allow users with ordinary hardware to mine these with reasonable returns. It seems that cybercriminals are also moving in that direction—Bitcoin was previously the preferred currency of many in the underground, but current crypto-mining malware are mostly targeting ", ".", "With the widespread boom in cryptocurrency value, it’s no wonder that cybercriminals are continuing to develop new methods and techniques to efficiently mine cryptocurrency.", " is a legitimate miner purposely developed as an alternative revenue stream for websites. Instead of peppering the site with advertisements, website owners can ask visitors to donate their processing power to fund the site through mining. A ", " was one of the first major sites to adopt this. However, visitors were not warned or ", ".", "In response to these concerns, CoinHive put out an alternative called AuthedMine, which “", "” to run the miner. ", " may also be installing a permission option in its browser so users can opt-out of mining websites.", "Another concern with a legitimate miner like this is the potential for abuse. Cybercriminals can easily compromise websites with this code, like what happened with the ", ", or distribute it like typical malware. In September, Trend Micro discovered that the ", " (detected by Trend Micro as HKTL_COINMINE) after directing users to fake tech support pages that will compromise their devices.", " are distributed through typical channels—spam mail, malicious sites, and Potentially Unwanted Apps (PUAs). Cybercriminals are also using ", " capable of mining cryptocurrency—a seemingly inefficient way to make a profit since the affected devices typically don’t have adequate capabilities to mine cryptocurrency.", "The current landscape is revealing that hackers seem to be experimenting with new and different ways to exploit users. In mid-October, a Russian developer creating mods for the popular game GTA V reportedly ", ". This allowed him to mine Monero through the PCs of the people who downloaded them.", "Cloud services are also being abused to mine cryptocurrency. Just this month, there were reports of ", ". Researchers said that these platforms were using default credentials, which means individuals are simply taking advantage of the unsecured resources and using the processor cycles to mine alt-coins.", "As cryptocurrency continues to gain value and becomes more accepted by mainstream financial institutions, we can expect cybercriminals to use different methods to compromise user’s devices to create unwilling miners. Just like with any other malware, defend against this new threat by updating systems and software with the latest security patches, and always change the default passwords on enterprise and personal devices.", "To better protect home users from crypto-mining malware and similar threats, the ", " solution features web protection and deep packet inspection capabilities. Also, ", " and ", " protect end users and businesses from these threats by detecting and blocking malicious files and all related URLs. ", " deliver several capabilities like high fidelity machine learning, web reputation services, behavior monitoring and application control that minimize the impact of this threat."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/ransomware-recap-the-short-lived-spread-of-bad-rabbit-ransomware", "date": "November 03, 2017", "title": "Ransomware Recap: The Short-Lived Spread of Bad Rabbit Ransomware", "articleContent": []},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/swift-related-cyber-heist-on-nic-asia-bank-business-process-compromise-impact", "date": "November 06, 2017", "title": "SWIFT-related Cyber Heist on NIC Asia Bank Highlights Business Process Compromise’s Impact", "articleContent": ["Nepal’s NIC Asia Bank is the latest to fall victim to ", " after it ", " fraudulent fund transfers via the bank’s Society for Worldwide Interbank Telecommunication (SWIFT) systems. The hackers behind the heist tried to transfer the stolen money to various foreign currency accounts in other countries such as Japan, the U.K., and Singapore, as well as Standard Chartered and Mashreq Bank in New York.", "NIC Asia Bank has reported the incident to its central bank, Nepal Rastra Bank. Working with other financial institutions such as KPMG India and the Central Investigation Bureau, NIC Asia Bank was able to stop the illegal transactions and recovered 460 million Nepalese rupees (Rs), or around US$4.451 million as of November 6, 2017.", "The NIC Asia Bank is the latest to fall victim to SWIFT-related heists, with the ", " in Bangladesh’s central bank last year being the most notable for having lost at least $81 million. Financial institutions in Ecuador and Vietnam also made ", " when cybercriminals targeted their SWIFT-related infrastructure. In October 2017, a Taiwanese bank also fell to a similar scheme but managed to ", " $46 million out of the $60 million that was stolen and wired to accounts in Cambodia, Sri Lanka, and the U.S.", "Business process compromise works by undermining the integrity of the infrastructure that manages the company’s operations, such as exploiting its vulnerabilities or infecting it with data-stealing or altering malware. In NIC Asia Bank’s case", " the system supposedly dedicated to processing SWIFT transactions was ", " also used for other purposes, such as email. The heist was perpetrated during the Tihar, a national five-day holiday in Nepal, when the country’s banks and financial institutions were also closed.", "Business process compromise isn't just used to hit financial institutions. Organizations large and small—from ", " and shipping, ", ", and data/", " to the ", "—are vulnerable to it.", "Business process compromise’s adverse impact on the company’s operations, reputation, and bottom line highlight the significance of implementing defense in depth: assess the risks that come with each business process and ensure that countermeasures are in place. Identify discrepancies in your systems and networks; security mechanisms like behavior monitoring and application control (or system lockdown in critical infrastructures), as well as intrusion detection and prevention systems,  help in this regard. Enforce the principle of least privilege: ", " and ", " are just some of the best practices information security professionals and systems administrators can adopt to reduce the organization’s data’s attack surface.  More importantly, harden the organization’s cybersecurity posture—from the gateways, networks, and servers, down to the company ", " and ", "."]},
{"url": "https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/access-to-corporate-remote-desktops-sold-for-3-in-the-dark-web", "date": "November 07, 2017", "title": "Access to Corporate Remote Desktops Sold for $3 in the Dark Web", "articleContent": ["Security researchers ", " several ", " marketplaces selling credentials that can access corporate remote desktop protocol (RDP) servers for as little as US$3. The report shed light into a prominent marketplace called Ultimate Anonymity Services (UAS), which has been found selling RDPs sourced from organizations in healthcare, education, and government.", "Of note are 35,000 brute-forced RDPs being offered, 7,200 of which were from China, 6,100 from Brazil, 3,000 from India, 1,300 from Spain, and 900 from Colombia. UAS purveyors also sold 300 US-based RDPs, namely from California, Ohio, Oregon, and Virginia. Prices range between $3 and $10. Compared to competitors such as xDedic that sell similar wares for as much as $100, the researchers note that UAS’s lower prices owe to its increasing popularity among cybercriminals.", "The report complements the recent bevy of ", " and ", "-related incidents, as access to these systems and networks enables cybercriminals and threat actors to steal or hold data hostage. Brute-forced RDPs were ", "’s main infection vector and entry point, for instance. Even point-of-sale malware like ", " combined compromised RDPs with remote access Trojans to steal credit card data, which were then sold in underground forums.", "Indeed, the underground is rife with illicit wares as well as stolen data and malware that purveyors often rehash depending on the demand. But as exemplified by the ", ", their monetary value can also be influenced by the unique culture that drives its participants.", "In fact, several malware and access to certain systems and networks are offered for free in Middle Eastern and North African underground marketplaces. These range from crypters, keyloggers, SQL injection tools, and malware builders to SCADA port numbers. RDPs cost as little as $8, and e-commerce credentials are sold for as little as $1.", "Given how compromised remote desktops can be an attacker’s doorway to an organization’s crown jewels, the ease with which attackers find keys to them highlights the significance of securing them. Here are some countermeasures:"]}
]