[
{"url": "https://www.python.org/jobs/2916/", "loc": "Joinville, Santa Catarina, Brasil", "title": "Desenvolvedor FullStack Python", "job_type": ["Back end", "Front end", "Web", "Developer / Engineer"], "descrip": ["Suas responsabilidades serão:\n- Desenvolver nossa arquitetura BackEnd\n- Garantir a qualidade do código com testes automatizados\n- Garantir o desempenho da API JetBov utilizando as melhores práticas de código e infraestrutura\n- Otimizar a utilização de banco de dados e a velocidade das pesquisas\n- Capaz de analisar problemas em equipe e propor soluções, usando bons argumentos.", "Benefícios:\n- Vale Transporte\n- Vale Refeição ou Alimentação\n- Plano de Saúde\n- Salário digno e compatível com as suas responsabilidades\n- Flexibilidade de horário\n- Ambiente de trabalho ágil e informal\n- Fazer parte na transformação da forma que a carne é produzida no Brasil\n- Morar em uma cidade com ótima qualidade de vida", "Requisitos Mínimos:\n- Domínio de Python, Django - ou capacidade para aprender e tornar-se produtivo rapidamente;\n- Boas habilidades de comunicação, indispensáveis para o trabalho em equipe;\n- Lógica para solução de problemas;\n- Curiosidade e vontade de aprender novas ferramentas, plataformas e tecnologias;\n- Domínio e conhecimento sobre testes automatizados;\n- Residir em Joinville-SC ou disponibilidade para se mudar para a cidade.", "Requisitos diferenciais:\n- Inglês técnico nível intermediário.\n- Experiência prévia com linguagem Python.\n- Experiência prévia com arquitetura REST, para criação de APIs, Django Rest Framework\n- Tecnologias de FrontEnd(CSS, HTML e JavaScript)\n- Angular\n- Conhecimento em design e arquitetura de software: Domain-Driven, TDD, Design Patterns.\n- Experiência prévia com Amazon Web Services\n- Conhecimento em técnicas de CI/CD\n- Envolvimento em projetos open-source.\n- Perfil ativo no GitHub.", "Somos uma startup que busca integrar a cadeia da produção pecuária, permitindo uma produção de carne com qualidade e sustentabilidade. Ajudamos o controle do gado e gestão da fazenda sem complicação. Levamos inteligência e tecnologia em gestão para a cadeia produtiva da carne.\nwww.jetbov.com"]},
{"url": "https://www.python.org/jobs/2914/", "loc": "Newport Beach, CA, USA", "title": "Advanced Python Engineer", "job_type": ["Back end", "Finance", "Lead", "Numeric processing", "Systems", "Developer / Engineer"], "descrip": ["We are a small team of software engineers passionate about creating fast, lean, and robust Python code. We use Python 3, and broadly employ modern language features and libraries such as type hints, generators, decorators, functools, itertools, and collections. We leverage high-performance libraries like NumPy and Pandas, and use Flask for web apps. While we do not write much C, we understand Python at the C level. To increase code quality and knowledge transfer, we spend significant time reading and discussing each other's code. We tame large datasets filled with noise and irregularity, and develop reusable approaches to data pipelining, caching, and numerical processing. We habitually test everything we write, and practice continuous integration and continuous deployment. We develop on Linux and deploy to a fleet of VMs via Ansible and Supervisor. We take the time to refine old code, find optimal designs, and invest in building powerful, general-purpose tools, some of which we have open-sourced. As full-stack engineers, we contributing to code, test, back-end, front-end, operations, and deployment.", "We are the core engineering team in Investment Management at Research Affiliates, a global leader in innovative indexing and asset allocation strategies. We build the tools that construct hundreds of different portfolios; we create and maintain an expanding network of applications for processing portfolios and financial data, from back-end reporting to front-end comparison and analysis.", "We are looking for software engineers who share our interests.", "Substantial experience with Python is required, as well as a bachelor's degree in Computer Science (or a related field) and 3 years experience in software engineering (or equivalent professional experience). Advanced degrees (MA, PhD) are welcome, as are applications from exceptional junior candidates.", "We offer resources to attend conferences, continue expanding your skills, and pursue activities that drive personal growth and creativity. As a company, we embrace the core principles of responsibility, collaboration, curiosity, and authenticity, and actually try to live those values. We have a comfortable office near the ocean with daily catered lunches. Benefits are excellent, and salary is commensurate with experience, education, and competitive with top tech firms. Relocation assistance is available."]},
{"url": "https://www.python.org/jobs/2905/", "loc": "Greenbelt, Maryland, USA", "title": "Backend Software Developer", "job_type": ["Back end", "Integration", "Developer / Engineer"], "descrip": ["Job Description:\nWe are looking for a software developer who values exploration, discovery, efficiency, and finding resolutions to complex issues.  This position will be on-site at NASA Goddard Space Flight Center in Greenbelt, MD.", "What You’ll Do:\nYou’ll work closely with our engineers, developers, operators, and our NASA customers to develop and support GIBS, an open-source (", ") web service and the backend to NASA’s Worldview, as it migrates its existing Linux-based on-premises system into an Amazon Web Service cloud-computing environment. Your primary responsibilities will include:", "Required Qualifications:", "Desired Qualifications:"]},
{"url": "https://www.python.org/jobs/2891/", "loc": "Lake Oswego, Oregon, USA", "title": "Back-End Insights Engineer", "job_type": ["Back end", "Developer / Engineer"], "descrip": ["Cinder is looking for a Back-End Insights Engineer to fill a role for our clients in Lake Oswego, OR. This is a full time, 40 hour per week opportunity with a full benefits package that includes PTO!", "We’ve got our eye out for a developer who is eager to solve problems, collaborate with team members, and work in a DevOps-supported, continuous deployment environment. We are looking for candidates who have a deep knowledge of multiple programming languages, particularly those that comprise our stack: Python, Go and JavaScript. Ideally, you are a fellow Pythonista/Gopher who has a passion for clean, well-tested and expressive code.", "Currently, we are seeking someone who can dive into our Python codebase managed by our “Insights” guild, which helps bridge the gap between our Data Sciences and Engineering teams. Our teams work to build new services & features in modern apps using experience gained from previously developed legacy apps. We practice collaboration, UX prototyping, test-driven CI, and pull request code reviews (ticket tracking, acceptance testing, etc.) to produce high-quality code and continue to learn and improve the system", "Job Duties may include but are not limited to:", "Contribute ideas, research, and knowledge to the team to increase skills for self and the team at large", "Develop programmatic solutions to business problems and ability to automate business processes", "Take ownership of functionality from development through deployment.", "Be ready to learn new languages, tools, and systems quickly, and be able to communicate challenges and ask for help regularly", "Deploy quality code, write tests, and learn from mistakes to build a better system and improve your skills", "Work with Product Owners, Business Analysts and other Developers to estimate, size, and scope of work", "Required Skills:", "3+ years experience in Python, Go and Javascript application development.", "5+ years working in a team environment as a programmer, preferably in a back-end role", "Ability to learn and understand the media buying process and business goals in order to develop intelligent solutions for users and clients", "Experience using distributed code repositories (git, Mercurial) in a team environment or a large open source project", "Prior experience supporting multiple browsers, operating systems and devices", "Preferred Skills:", "Experience in Ruby, MySQL or frameworks like React.", "Prior development on a service-oriented / microservice architecture", "Prior development of REST APIs", "Prior experience with Python frameworks like Flask or aiohttp", "Prior experience with PostgreSQL, PostGIS and Elasticsearch", "Prior experience with Mapbox GL JS or similar map rendering tech", "Established gibhub account with coding examples/projects", "Our client is a up and coming Ad Tech company looking to challenge stagnant culture in programming. They are highly focused on excellent culture and great benefits to attract the best engineers."]},
{"url": "https://www.python.org/jobs/2827/", "loc": "Ghent, Belgium", "title": "Principal Python Software Engineer", "job_type": ["Back end", "Developer / Engineer"], "descrip": ["Do you want to be part of the Engineering team of Western Digital, with a development center in Belgium, Ghent?\nDo you want to work on their latest Object Storage systems that deliver storage capacity up to 52 PetaByte?\nDo you want to write software for the ActiveScale product line?\n", "We are currently looking for an ", " who wants to work on extending the customer facing Storage API, different storage compliance features, Disaster Recovery options and tuning the system for better performance and scalability.", "We are looking for someone who wants to lift his (or her?) career to the next level by learning from some of the worlds brightest storage experts and contribute to a revolutionizing product.\nWhen you want to (learn to) write software with a focus on Enterprise Quality, Performance, Scalability and Robustness, Amplidata/Western Digital is the place to be.", "Required Skillset", "Skills considered a plus", "Personality", "Amplidata has been acquired by Western Digital Company.\nThe acquisition supports the company’s strategy to expand into higher value data storage platforms and systems that deliver breakthrough value and scalability to address the massive growth in storage requirements in cloud data centers. Amplidata’s primary offering is Himalaya®, an advanced object storage software product that enables scale-out software-defined storage systems. By delivering industry leading scalability with the efficiency, resiliency, and flexibility required for demanding cloud data center environments, Amplidata’s products and technology have earned the trust of leading OEMs and cloud service providers. Building on its reputation for producing reliable HDDs, SSDs, and developing tighter integration with software, HGST is optimizing storage efficiency and reliability for today’s data-centric economy. HGST had previously selected Amplidata as a joint development partner for its Active Archive platform which aims to enable breakthrough levels of storage efficiency at an ultra-low total cost of ownership. Having greater control and expertise over the fundamental building blocks of hard drives, solid state drives, and software, enables tighter end-to-end system integration and a more optimal use of software and underlying device capabilities.", "To learn more about HGST visit ", "To learn more about Amplidata visit "]},
{"url": "https://www.python.org/jobs/2892/", "loc": "Dallas, Texas, USA", "title": "Scientific Programmer", "job_type": ["Back end", "Front end", "Integration", "Numeric processing", "Operations", "Testing", "Developer / Engineer"], "descrip": ["Dr. Russell Stoneback at the William B. Hanson Center for Space Sciences (CSS) is seeking a scientific programmer to support research activities in two broad areas, satellite based measurements of the ionosphere and the development of novel musical instruments. Over the next 12 months 8 spacecraft will be launched with instruments designed and managed at the CSS. Measurements performed by these instruments will be reduced into relevant geophysical parameters using new Python software built by Dr. Stoneback. Ionospheric measurements from these and other platforms need to be integrated in near real time as part of a local space weather center based upon the Python Satellite Data Analysis Toolkit (pysat), ", ", and other tools as needed.", "Dr. Stoneback is also pursuing the development of novel musical instruments (", ") that require development of audio plugins to run in Logic Pro and Garageband on MacOS systems.", "Bachelor’s degree in computer science, mathematics, physics or related title", "Desireable Experience", "The William B. Hanson Center for Space Sciences (CSS) is a part of the University of Texas at Dallas. Founded in the 1960s, the CSS has developed spaceflight hardware for a variety of missions to study the space environment.  Most recently, the CSS developed the Ion Velocity Meters that will fly on the upcoming NASA Ionospheric Connection Explorer (", " ", ") and the NOAA/NSPO COSMIC-2 constellation."]},
{"url": "https://www.python.org/jobs/2889/", "loc": "New York, NY, United States", "title": "Lead Python 3/Django Developer (3mo Contract)", "job_type": ["Back end", "Database", "Lead", "Systems", "Testing", "Web", "Developer / Engineer"], "descrip": ["Croscon is seeking a Django Python developer to join our team as we build out a total greenfield insurance enterprise SaaS product. The end result product with be a fully REST API built in Python (Django) + PostgreSQL. The API will be consumed by a frontend written in ReactJS and Redux (separate team).", "Eligible candidates will have considerable experience in building and launching enterprise apps are self-starting and can meet aggressive deadline targets. This is a great opportunity for an experienced senior engineer to work remotely on a new product (must overlap EST by 3-5 hours per day).", "Strong possibility of an ongoing relationship beyond this project for the right candidate.", "To learn more about our clients and our business, please visit our website @ croscon.com.", "NO RECRUITERS. If you try to find a way to contact me, or anyone on my team I will come and find you and take away your internet. Sorry guys, it's not us, it's you.", "Benefits:\n$7-9k/mo", "Croscon plans, builds, and grows the digital products and services that help companies become leaders in their industry."]},
{"url": "https://www.python.org/jobs/2828/", "loc": "San Diego, California, USA", "title": "Senior Software Engineer(Python/AWS)", "job_type": ["Back end", "Big Data", "Cloud", "Database", "Lead", "Testing", "Web", "Developer / Engineer"], "descrip": ["From the ground up you will architect, design, develop, deploy and operate microservices that serve millions of users in a DevOps manner fully on AWS Stack using Python, SQL, NoSQL technologies.", "If this sounds interesting, we would like to hear from you!\nPlease apply via our careers page.", "ForeSee Medical is developing the next-generation open platform, cognitive processing software solutions that place data in the hands of providers and care teams to empower them to positively influence health outcomes. With the transformation to value based payment – more than ever physicians need software like ForeSee, the virtual assistant that helps them become a value based payment winner.   In our last venture, we invented the 1st EHR to work in the Cloud and on an iPad and later Medical Economics recognized our EHR as one of the “Top 10” in the country. We brought touch technology to the EHR world, simplifying the way that providers interact with their patient’s health record.", "ForeSee Medical is the next logical step for our team – cognitive software built for the move from volume to value."]},
{"url": "https://www.python.org/jobs/2913/", "loc": "Munich, Germany", "title": "Data Engineer", "job_type": ["Back end", "Big Data", "Database", "Developer / Engineer"], "descrip": ["We’re looking for a Data Engineer for our Data Platform to become part of our outstanding development team in Munich. You are responsible to develop new features that help us to improve our data gathering and event processing products. If you love to continuously improve and deliver high quality software - then Stylight is the place to be for you!", "Your Responsibilities", "Your Team", "Why Join Stylight?", "Your Profile", "It all started with four students from Munich who wanted to make the fashion landscape a bit more accessible for all of us. Back in 2008 Stylight started as s simple fashion search tool. People loved it and our story began.\nToday Stylight is Europe’s leading style aggregator available in 17 countries worldwide. As part of  ProSiebenSat.1 Media SE we are on a mission to Make Style Happen. Our mission is based on the core insight that people aspire to a fashionable and vibrant style: a life of beautiful things, good things, fun things. But, due to the lack of time, money and knowledge, it’s often hard to make style inspiration become a reality.\n That’s why we build a place you can visit to find and discover products from all retailers and brands, personal recommendations, shopping guides, curated picks, how-tos, and the latest trends. A place giving brands and retailers the platform, solutions, and support they need to grow their businesses.\nThe team behind Stylight are 100 style geeks and tech professionals, a data-driven lifestyle force, coming from 20 nations all around the globe, operating from our headquarter in Munich and our US office in Philadelphia."]},
{"url": "https://www.python.org/jobs/2895/", "loc": "Berkeley, CA, USA", "title": "QA Engineer", "job_type": ["Testing", "Developer / Engineer"], "descrip": ["Bonsai’s Automation and QA team is looking for a talented programmer, creative software-breaker, and passionate tester, to maintain Bonsai’s high standard of software quality and help the engineering team go faster without breaking things.", "As the champion for software quality and correctness, you’ll work with all areas of Engineering and AI, as well as Product and Customer Success, to consult on and create test plans, manage our CI infrastructure, build tools to make testing easier company-wide, and implement black-box tests that exercise our platform end-to-end.", "RESPONSIBILITIES", "Work with Engineering teams, including Backend, Compiler, Web, and AI, to design and implement test plans for features that span multiple teams.", "Design and implement tools that enable Bonsai developers to more quickly create tests that can be seamlessly automated.", "Provision and manage test automation and continuous integration systems.", "Create reports detailing test failures, test coverage, and system performance.", "A passion for software quality.", "At least 2-3 years of industry experience as a Software Developer Engineer in Test or similar.", "Proficiency with a general purpose language like Python or C++, plus experience with a test framework in that language.", "Experience with Jenkins or a similar Continuous Integration tool.", "Demonstrated experience working collaboratively with teams of developers.", "Bonsai brings together state of the art techniques in machine teaching and machine learning, enabling enterprises to more effectively program and manage AI models"]},
{"url": "https://www.python.org/jobs/2896/", "loc": "Sydney, NSW, Australia", "title": "Software Engineer (Python/Django)", "job_type": ["Developer / Engineer"], "descrip": ["Mathspace (mathspace.co) is searching for talented Python developers at various levels of experience to join us in sunny Sydney, Australia over the next few months. Sponsorship/work visa can be provided if needed.", "You'll be working directly with the founders and be given every opportunity to build on your already outstanding Python/Django and database skills to build a scalable adaptive learning algorithm.", "Only a few people actually get an opportunity to make a difference. Fewer people, still, have the drive to do it. Out of those few we’re looking for the best.", "The role will involve anything and everything back-end with a strong focus on our StepSmart Mathematical engine and our Adaptive Learning Algorithm. Imagine a world where every student gets delivered a learning experience based on their ability, their learning style and their progress. With our back-end step-by-step approach we have the opportunity to do this like no one has done it before and we need you to help put this in place.", "What you will need:\nPython 3\nDjango\nGit/GitHub\nPostgreSQL", "Bonus Points if you have:\nSympy\nScikit-learn\nAWS\nDjango REST Framework\nRedis\nJavaScript/ReactJS\nHTML/CSS\nMathematics background", "We're a global technology leader in personalised maths education and you will join a dedicated, high performing team, changing the way students learn Maths in Australia and around the world. Casual and inspired, our company culture puts everyone in control of shaping our product - if you have a great idea and want to see it done, then all you have to do is DO IT.", "What we offer:", "The opportunity to use cutting edge technology to transform Mathematics education and make an impact\n", "Flat hierarchy / management structure\n", "Bright and open Surry Hills office near Central Station, surrounded by great lunch places\n", "Weekly team lunches\n", "Monthly team outings\n", "Flexible work hours\n", "Remote working 10 days per year - from home, as part of a holiday, or from where ever you want\n", "$1500 towards the computer of your choice and sit/stand desks\n", "Staff development with weekly lunchtime lightning talks about the latest technologies\n", "We partner with pledge1percent.org to donate 1% of time, product and profit to help nonprofits in our community. Each employee has 2.5 days to volunteer with the charity of their choice\n", "Free entry to exclusive Mathspace table tennis competition :)", "Please send us:\n", "Cover letter with examples of your awesomeness\n", "Github account\n", "Resume"]},
{"url": "https://www.python.org/jobs/2829/", "loc": "SAN DIEGO, California, USA", "title": "Software Engineer (Python/AWS)", "job_type": ["Back end", "Cloud", "Database", "Testing", "Web", "Developer / Engineer"], "descrip": ["As a valued member of a small team you will help in design, implementation, deploy and operate microservices that serve millions of users in a DevOps manner fully on AWS Stack using Python, SQL, NoSQL technologies.", "ForeSee Medical is developing the next-generation open platform, cognitive processing software solutions that place data in the hands of providers and care teams to empower them to positively influence health outcomes. With the transformation to value based payment – more than ever physicians need software like ForeSee, the virtual assistant that helps them become a value based payment winner.   In our last venture, we invented the 1st EHR to work in the Cloud and on an iPad and later Medical Economics recognized our EHR as one of the “Top 10” in the country. We brought touch technology to the EHR world, simplifying the way that providers interact with their patient’s health record.", "ForeSee Medical is the next logical step for our team – cognitive software built for the move from volume to value."]},
{"url": "https://www.python.org/jobs/2826/", "loc": "Chesterfield, MO, United States", "title": "Python Developer with .Net Experience", "job_type": ["Back end", "Database", "Front end", "Numeric processing", "Systems", "Testing", "Text Processing", "Developer / Engineer"], "descrip": ["Design, build, test and maintain scalable and stable off the shelf application or custom built technology solutions to meet business needs. Act as a subject matter expert for Application Software developers and Engineers.", "Qualifications:", "Education/Experience:\n*  Bachelor’s degree in Computer Science, MIS, related field or equivalent experience.\n*  3+ years of related experience.\n*  Healthcare experience strongly preferred, requires demonstrated understanding of business process as it relates to experience in the field.\n*  Advanced knowledge of agile methodology.", "Preferred Skills:\n*  Strong Python programming experience. Will consider .NET skills, but primary duties will be in Python. .NET skills would be a plus as a secondary skill as well.\n*  Strong SQL. Inner and Outer Joins.\n*  Stored Procedures.\n*  Strong team and collaboration skills.", "Client is a provider of health plans through Medicaid, Medicare and the Health Insurance Marketplace and other Health Solutions through their specialty services companies."]},
{"url": "https://www.python.org/jobs/2831/", "loc": "Bangalore, Karnataka, India", "title": "Python Backend Engineer", "job_type": ["Back end", "Cloud", "Database", "Front end", "Integration", "Systems", "Testing", "Web", "Developer / Engineer"], "descrip": ["Make sure you read ", " before you proceed", "We have built some Microservices, Device Farms (Android & iOS) & IDE Plugins with Python/Django, Node, Java, Ember to help developers and enterprises to automatically detect and fix security loopholes in their Mobile (iOS, Android, Windows, etc.) / IoT Apps within a few minutes. Before you wonder: No, you need not know anything at all about security to apply for tech positions in Appknox. We have experienced security professionals on-board who will give us scripts to detect vulnerabilities. Our job is to refine it and integrate it with the whole system. Only requirement to apply for Appknox is to know how to write good code.", "Our tech team is close-knit family of handful of developers. But the size of company is about 25+ people strong (security, sales, marketing, design & other teams). The tech team intentionally tried being as small as possible for as long as possible. Because we love to do as much work as we can - on our own. Only hire when we can no longer handle things on our own. It gives you a lot of opportunity to learn a lot of things.", "We are very picky about hiring. Because the core members will set the engineering culture that the entire tech team will follow in the future. Which means the core team should reflect the kind of culture we wish to have at out startup: A close knit family of learners trying to leave behind a mark in the world. To make today - safer & better than yesterday - however small the change may be. This is what it means to be a KnoxStar."]},
{"url": "https://www.python.org/jobs/2832/", "loc": "Hamilton, Ontario, Canada", "title": "Software Developer", "job_type": ["Back end", "Cloud", "Database", "Integration", "Operations", "Systems", "Testing", "Web", "Developer / Engineer"], "descrip": ["Maintain and develop Airport Winter Operations software Write, modify, integrate and test software code. Maintain existing computer programs by making modifications as required. Identify and communicate technical problems, processes and solutions. Prepare reports, manuals and other documentation on the status, operation and maintenance of software. Assist in the collection and documentation of user's requirements. Assist in the development of logical and physical specifications. Research and evaluate a variety of software products. Program animation software to predefined specifications for interactive CDs, DVDs, video game cartridges and Internet-based applications. Program special effects software for film and video applications. Write, modify, integrate and test software code for e-commerce and other Internet applications.", "Requirements:", "Experience:", "Netquity Corporation is a leading provider of Enterprise software development. We've delivered projects starting from startup mobile applications to globally distributed & operationally mission critical platforms. We integrate a mix of concepts and strategies with our passion of technology to bring your ideas to life. With unparalleled industry knowledge, technical talent and a unique company culture, Netquity makes complex problems simplified."]},
{"url": "https://www.python.org/jobs/2834/", "loc": "Lyon, France", "title": "Python Developer", "job_type": ["Back end", "Front end", "Testing", "Web", "Developer / Engineer"], "descrip": ["We love IT, we love programming ! We expect from you the same to join our team. You will work on critical applications for Mobile Operators of the group that are located in different countries. You will travel !", "IT Solutions Factory is a company part of the NJJ group. Our company build and maintain software for Mobile Operators that are part of the group. Since its creation, in 2015, the team, coming from 42, works on projects that will simplify the operator : CRM, billing, ERP, network tools... NJJ is growing, our team needs to grow as well to face our new challenges."]},
{"url": "https://www.python.org/jobs/2839/", "loc": "Edinburgh, UK", "title": "Python Web Developer (all levels)", "job_type": ["Back end", "Web", "Developer / Engineer"], "descrip": ["An opportunity has arisen for a talented developer to join our team.  You would be filling a key technical role at our Edinburgh office, providing scope and direction for exciting new projects, implementing robust solutions to specification and ensuring excellence on best practice with the rest of the team.", "Our company has and will continue to grow via the input and decisions of the entire team, based both on formal team meetings as well as impromptu chats at the kettle. Our office is fairly chilled and you will have 3 options; listen to the office radio with optional cross office chat, put your headphones in and listen to your own beats, or start an epic elastic band battle with the testers.", "Oh yeah, we have testers! They are like our office siblings; we are best of friends but they do insist on breaking everything we own. It’s cool though, we don’t have a blame culture...we don’t find it to be very productive!", "What you’ll be getting up to:", "Designing and building neat software solutions and products using Python and Django\nPlanning with other members of the team\nSolving dev world problems in a supportive environment!", "What you’ll get in return:", "When we say flexible hours we mean flexible hours!\nPrivate health insurance including dental and optical\nAn extra day's holiday for each year of loyal service...long live The Empire!\nAn invite to “The Real Coffee Club”, as well as their arch nemesis “The Biscuit Club”\nFree fruit to mellow out that caffeine and sugar come down\nDevs Assemble! Support from your fellow devs when the call comes\nStability: Mercurytide is pushing 20 with a low staff turn around\nPizza...tonnes of Pizza! Successful project? Pizza! New streamlined process? Pizza! matching socks? PIZZA!", "Mercurytide is built upon a foundation of great people. We love all things digital, and our clients benefit from our full-service delivery - from online strategy and web design through to web development and ongoing support. In order to keep up with the demand for our expert services, Mercurytide is looking to hire talented new recruits with a passion for the web. You will join a culture of exceptional people, who pride themselves on being up to speed with the latest technologies.", "Life at Mercurytide is never dull; we have a busy calendar of work, social events, plus we know the best local spots for coffee, tea and food."]},
{"url": "https://www.python.org/jobs/2840/", "loc": "Greenbelt, Maryland, USA", "title": "Senior Software Developer AWS Python and Node", "job_type": ["Back end", "Cloud", "Front end", "Image Processing", "Integration", "Testing", "Developer / Engineer"], "descrip": ["SSAI is looking for a highly qualified, seasoned software developer who values exploration, discovery, efficiency, and finding resolutions to complex issues.  This individual must be self-motivated, demonstrate initiative, exhibit a strong work ethic, and have excellent written and verbal skills, time management, organizational skills, as well as the ability to work in a distributed team environment.", "Our team provides architecture, development, and operations support for NASA’s Global Imagery Browse Services (", "), an open-source (", ") web service designed with the goal of advancing user interactions through full-resolution earth science data visualizations captured by NASA’s Earth observing satellites.  On a daily basis, thousands of users explore the past and present state of the planet to support a wide range of activities – from locating remote forest fires to navigating around ice laden seas to tracking the progress of tropical cyclones.  Our goal is to enable this exploration and discovery of our ever-changing and evolving Earth.  Additionally, we are committed to open source ideals and believe in sharing what we’ve done while learning from others.", "You’ll work closely with our engineers, developers, operators, and our NASA customers to develop and support GIBS as it migrates its existing Linux-based on-premises system into an Amazon Web Service cloud-computing environment. Your primary responsibilities will include:", "Participate in software requirements and test plan reviews\nMature an AWS cloud-based software design, integration process, and deployment model\nDevelop open-source software leveraging AWS services\nSupport operations and testing activities", "Required Qualifications:", "-Bachelor’s degree in Computer Science or related technical field and 5 years of professional software development experience or equivalent combination of education and experience.\n-Senior experience developing software with Python and Node\n-Experience developing and executing continuous integration tests (e.g. Bamboo, Jenkins)\n-Ability to effectively maintain a version controlled code repository using modern tools (e.g. git).\n-Experience supporting functional and performance testing activities\n-Experience supporting operational deployment troubleshooting and issue resolution\n-Dedication to clear and thorough code and design documentation.\n-Familiarity with Unix/Linux operating systems and networking concepts", "Desired Qualifications:", "-Experience with continuous deployment practices (e.g. Docker Containers, CloudFormation)\n-Experience designing, developing, and maintaining software that leverages AWS core services.  (e.g. compute, network, storage, database, management, etc.)\n-Demonstrable experience participating in open-source software projects\n-Good knowledge of security as it relates to an AWS infrastructure\n-Experience with AWS step functions\n-Familiarity with GDAL/OGR\n-Familiarity with NASA Earth Observing System (EOS) data products", "Please apply through the company website"]},
{"url": "https://www.python.org/jobs/2841/", "loc": "San Antonio, Texas, United States", "title": "Python Developer", "job_type": ["Front end", "Developer / Engineer"], "descrip": ["Python Developer - Software Tool Developer.  Creates software-based Cyber prototype tools that enhance cyber warfighter capability.", "Duties:", "Designs, codes, tests, debugs, and documents. Develop software based on pre-defined set of requirements into production grade software in accordance with industry best practices and secure coding methodologies. Tasks includes identification of objectives, requirements, system design, system/software development, testing, upgrades, and training needed for deployment and installation of the software; and updates to requirements reflecting feedback from any technical interchange meetings and testing and evaluation activities. Support to, at least, five simultaneous development efforts. Examples of developed software include: exploits, implants, payloads, countermeasures, proof-of-concept, plug-ins, and scripts.", "Analyze, enhance, and demonstrate prototype exploits that serve as proof-of-concept for discovered or acquired vulnerabilities that can be exploited. Refine proofs-of-concept and demonstration code based on pre-defined set of requirements into production grade software in accordance with industry best practices and secure coding methodologies.", "Qualifications:", "•Active government clearance, or have eligibility", "•Coding languages (C, C++, Java, C#)", "•Scripting languages (Python, PowerShell, etc.)", "•Network Analysis (Wireshark)", "•BA/BS degree or equivalent experience", "•4 years Agile software development experience and/or CSDP", "Physical Demands:", "The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.", "While performing the duties of this job, the employee is regularly required to sit; use hands to fingers, handle, or feel and talk or hear. The employee is frequently required to reach with hands and arms. The employee is occasionally required to stand; walk; climb or balance; stoop, kneel, crouch, or crawl and taste or smell.", "The employee must regularly lift and/or move up to 10 pounds, frequently lift and/or move up to 25 pounds and occasionally lift and/or move up to 50 pounds.", "Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus.", "Work Environment:", "The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.", "Charles Todd", "Python Developer skills", "Company History", "Founded in 2000 in San Antonio, Texas, IPSecure originally operated into the world of software development. The company soon evolved to include Telecommunication and Computer Security with the goal to provide aggressive security and Information Assurance support to all of our customers. Through many years of success, our company has grown to include computer network attack/defense/exploitation of government and commercial networks while continuing to provide unsurpassed customer service to our clients."]},
{"url": "https://www.python.org/jobs/2845/", "loc": "London, UK", "title": "Senior Python Developer", "job_type": ["Back end", "Cloud", "Database", "Developer / Engineer"], "descrip": ["Here at CrowdScores we have a fantastic team of people working on a product used by more than 1 million football fans monthly. Established for over three years, but retaining a friendly startup culture, our aim is to create the best football community in the world and we need to grow our backend team to achieve this.\nWe offer flexibility in where and how you work, what we care about is what you deliver. We regularly create substantial new features alongside dealing with significant scaling challenges as CrowdScores and our userbase continues to grow.", "In our backend team you will:", "Working with us, you will:", "To apply for this role please email your CV and cover letter to ", ".", "The person we are looking for:"]},
{"url": "https://www.python.org/jobs/2842/", "loc": "San Francisco, United States", "title": "Backend Engineer", "job_type": ["Back end", "Big Data", "Database", "Finance", "Systems", "Developer / Engineer"], "descrip": ["As an early-stage company, we have many projects and tasks that you can take on, depending on your preferred area of focus. Broadly, we offer the following areas of work:", "This is a generalist’s role, though it is possible to focus on an area of your interest. You will join our 4-person engineering team and work closely with our product design team. As such, this role comes with a significant amount of autonomy and responsibility. You should enjoy the challenge of building large, scalable infrastructural components from the ground up.", "We don’t expect you to be an expert in our entire stack, but we expect general familiarity with:", "Bonuses:", "Coalition is working to solve cyber risk. Perfect security is impossible, so businesses need a mechanism to stay resilient against a growing number of cyber threats. We are a small, well-funded team of security experts, insurance professionals, and intelligence community veterans building a better cyber insurance product. Coalition is automating risk assessment to remove obstacles to purchasing the right insurance against this peril. We are also constantly monitoring and educating our customers about different threats and how to mitigate them. And, for the unavoidable incidents, we’re helping our customers bounce back with a superior claims process."]}
]