[
{"content": ["I'm working on a 2d game and it's very stressful considering I don't have a full grasp on Python yet.", "So my question is.. How do you handle the unknown? I have a hero class and I want to run an attack method if hero.x is less than Enemy.x (simple example).", "Here the Enemy is a class.\nclass Enemy:", "However, when I call Enemy.hp with the intention of using the attack() function on any object under the Enemy class, I get an error saying Enemy doesn't have an attribute 'hp'... but it does....", "For that matter, if you could give me any resources or information on handling unknown objects and classes in Python/Pygame that would be greatly appreciated. I just clearly am missing a HUGE chunk of knowledge here.", "I just want to be able to attack any enemy.", "Even when I call a specific instantiated enemy, it says it isn't defined....", "Thanks everyone, if you don't understand my question I will gladly elaborate. I really can't continue with this game without this knowledge.", "did you instantiate the Enemy class?", "edit: Also could you please include the exact error and put all your relevant code in pastebin?", "What does your attack function look like?"], "score": "1", "title": "[Python/Pygame 2d RPG] How to handle the unknown?"},
{"content": ["I’ve only been into programming for the last few months and for the last few weeks I’ve been reading Code Complete and while it’s a beginners book I’m still having trouble really grasping the concepts. Is there anything I could look at or do that would help me understand it a little bit more?", "Which concepts specifically do you have trouble with? The book isn't meant to be an introductory book, personally I think it makes more sense once you have been programming for a while because you can identify patterns you use in your code and correct them. ", "Yeah thats what I’m thinking as well. For example I haven’t done any programming with child classes yet, at least I don’t think, and that and inheritance is kind of confusing to me. ", "I think after I work through a few bigger programs and gain a more solid foundation it would be great. ", "Do you have any book recommendations for a beginner? Specifically web development ", "\"Web development\" is really vague. ", "Well right now I’m just wanting to get the basics so I don’t want to be too specific quite yet. I’m hoping once I understand the different the career paths a little bit better then I can go into more specifics "], "score": "1", "title": "Reading Code Complete, but having trouble understanding it"},
{"content": ["I’m brand new to programming and starting off learning C, primarily based on the fact that CS50 (my only real resource so far) teaches C at the beginning. ", "I’ve only been using the custom CS50 IDE on Cloud 9, which doesn’t seem like a long term solution for me. I’m pretty overwhelmed by all the IDE choices, so I’d like some recommendations on an IDE to use for learning C that meets the following criteria. ", "1.) I split my time programming on two different laptops, one running MacOS, with the other running Linux. I share the Mac laptop, so I do use the Linux machine a fair amount of time. Ideally I’d like something that is cross platform. ", "2.) I’m not sure if this is possible outside of a cloud based IDE, but I’d ideally like to have my files stored in the cloud where I can work on one computer and pick right up later on my other computer. If a cloud based IDE is the only option, any suggestions on one that is user friendly and good for a beginner?", "Thanks!", "1) There are many options. Intellij Clion is a great IDE, but it's quite expensive (free as long as you're in college with a student license).", "I personally use VSCode.", "2) Learn git"], "score": "1", "title": "Best beginner friendly IDE for learning C (ideally something that’s cross platform between MacOS and Linux)?"},
{"content": ["I am having a hard time getting the correct decompositions for the given questions:", "We decompose R into two relations R1(dnumber, dname) and R2(pname, pnumber, plocation, dnumber).  Does this decomposition have the lossless join property?  Show your steps to achieve the answer. ", "I have a good understanding of how to do decompositions on these types of relations, but this set of FD are stumping me. Could anyone provide some insight or help?", "Thank you for your help!"], "score": "1", "title": "Help with relation decomposition into various NF to ensure lossless join property and dependency preservation."},
{"content": ["Hey everyone! My friend made a simple little game for his college class! If you guys could could download it and try it out that'd be a great help for him! If you enjoyed it, leave a review! Thanks \n"], "score": "1", "title": "Check out a game my friend made!"},
{"content": ["So I threw together a basic table using the FIFO principle with functions for pushing, popping, checking the length of the list, and checking if it's empty. That is essentially what a queue is from my limited understanding as a novice programmer.", "That was dandy but the reason I made it in the first place was to use for a*. So for those who don't know Lua, tables are the only data structure in Lua and they're extremely flexible, powerful, fun to work with, and any sort of data structure (even classes) can be represented by them with a little leg work.", "So as soon I realized I'd need to store coodinates in the queue for pathfinding I hit a bit of roadblock. The queue takes 1 value at a time and removes one value at a time. I'm not sure if I can push and pop tables with the x and y coordinates within the table unless I design it specifically to handle that.", "So the solutions I considered are...", " Using just one table push and pop the x and y coordinates one at a time. So insert a number into the list, and insert another number into the list and remember when removing them that the first one removed is x and the second number removed is y. Storing and removing a string of numbers this way seems really arbitrary and bad practice. So while possible and to some extent manageable, I anticipate it can lead to big problems if there is any small hiccups.", " Create a table queue as I'm calling it for pushing and popping a table at a time from a table that stores all the tables related to it's coordinates. Each table will have 2 values in it that will represent the x and y coordinates. This is what I'm leaning towards, since it seems like the more approachable to me while the safest for the purpose, since a big priority is getting a working a* and so this queue will be used just for the sake of that and if I need a queue for other things I can design a different one to suit the purpose.", " The last option is to design a flexible multipurpose queue that knows what it's working with whether it's having tables stored inside of the main table or just single values and then have it respond based on that. This seems like the most convenient option, but I imagine if I try to tackle this the code won't be efficient or optimal enough and even if it works may explode on me. I figure typically this is how queue's are designed though, I just don't know if I'll be able to do it until I get better.", "So while there's a lot of ways to solve a problem, as a codebase grows bigger a sub-par solution might show it's limitations and be harder to remove if it's build into enough things. I love the idea of code that's flexible enough to be modular and not tied into too many things unless it's a crucial component and try to be considerate in that when coding to avoid future frustration.", "Maybe I'm just overthinking this or missing something fundamental, and that's why I'm reaching out to this community with those far more experienced and/or insightful then myself. ", "tl;dr I can insert single values into the queue but if I try to push a table or pop a table it isn't very happy."], "score": "1", "title": "Approaching a queue in Lua for pathfinding"},
{"content": ["In order to read the Economist online without a subscription, I realised that by disabling JavaScript and reloading the page, the paywall can be avoided. As a little project, I'm trying to make a chrome extension to do this quickly. ", "So far, I've created an extension which removes the obnoxiously large add at the top of the page, however I'd like to make it disable JS and reload the page, too. Unfortunately, this seems to be something that's very difficult to Google.", "So far my manifest is:", "And my JavaScript is this:\nbackground.js:", "testScript.js:", " is an example of the page that I'm trying to change.", "While you can go this route, what you might want to do is identify the offending script and add a rule to an adblocker extension to not allow it to load. ", "Thanks. ", "I'm aware that's probably the easiest option but I'm approaching this as an opportunity to learn something new. ", "You can disable javascript with chrome.contentSettings.javascript and ", " of what that code can look like.", " GitHub links:", " "], "score": "2", "title": "How do you disable JavaScript in a chrome extension?"},
{"content": ["When you program, do you google alot. And how much do you actually use it?", "I'm a software engineer with 30+ years of professional programming experience and I still use Google to look up programming stuff all the time.  God knows how I used to work without it! :-)", "I just started learning Java. Is is normal that after watching a tutorial, I wont be able to make the same stuff i saw in the video without constantly watching the video?", "Yes, that's normal, especially if all the concepts are new to you.  Once you understand the various concepts that are common, it's a lot easier to pick up other languages later, though.", "I've just been learning Angular, and I've been through some parts of the tutorial twice to make sure I've got the hang of it.", "Preach it, brother!", "Yes, whenever I don't know something.", "Yes, Software Architect here with close to 15 years of experience. I google constantly, the key is to do research and not just copy paste the first result.", "20 years experience, still look things up every day, because new tools, libraries, and technologies are being invented every day.", "Don't use it much for my typical work load.  Been doing this for a long, long time and in my domain I either already know it or it hasn't been done before.  That said, I recently ventured into javaScript and built a web front end. While doing that I had I had the google hooked up intravenously.       ", "There is no shame in googling, but be careful when you are learning.  It's one thing to look up syntax, but it should not become a substitute for learning critical thinking.  We are paid to come up with solutions. The coming up part is the hard bit that makes us worth our salary.  When you are learning you shouldn't be using it to jump to the solution.  Nobody cares if you can average the temperatures of a bunch of cities. We want to know if you can figure out ", " to average the temperatures.       ", "For the record, I learned from stone tablets. There was no internet.", "First we petition Google to run fiber to all the cities, then we setup an Azure DataLake with an ElasticSearch log ingester, then we commission an App for Android tablets which picks up the battery temperature from the device and feeds it to IFTTT.com with a recipe that forwards it to ElasticSearch, then we have an AWS cloud instance which reads from the Azure DataLake and runs a TensorFlow model over the data and uses it to drive an Ad network's recommendations engine. This does A/B testing with advertisements for iOS users, showing them ads which depend on temperature, and if they hit the ad, we ask them to sign in with FaceBook and then we take their location from there.", "Once we have their location, and their agreement with the temperature assumptions behind the ad, we can use a Clojure-based genetic algorithm to locate a solution from the space of all possible multilayer perceptron learning systems and utilize a React.js front-end to generate a SPoG dashboard to support high level business decision making. The temperature data will be behind a paywall, and our revenue model is advertising and patent trolling with a view to being acquihired by Juicero.", "We're looking for $80M series A funding, what do you say?", "HP WebOS?", "Yes and no. I don’t rely on googled code snippets being glued together, but if you don’t know something then looking it up is the fastest way to get pushed in the right direction. "], "score": "0", "title": "Programmers with years of experience, do you still use google alot?"},
{"content": ["How important is calculus to be able to succeed in an algorithm and data structure class?", "Starting next semester I'll be taking my first intro course in computer science, and I was planing on taking algorithms during the summer followed by data structure during the fall.", "My math class is basically an overview of algebra, as I felt it was prudent to review things I learned in high school (I'm 32 and haven't used algebra since 2003). Should I go on to take algorithm and data structure before talking calculus? (By the way, calculus is not a pre-req for the classes).", "AFAIK, not related at all.*", "What is it that makes you think calculus might be required? Where did you get that connection?", "* with the caveat that you can probably relate anything you like with enough math, but casually speaking, they're not related.", "The recommended math for the major is calculus 1, 2, and discrete math. ", "They are very, very different."], "score": "1", "title": "In need of some advice regarding intro to computer science, algorithm, and data structures."},
{"content": ["I am basically a python-dev and I work for a startup. They have assigned me to a new project where I have to work with React, Redux, Apollo Client and Graphql.", "I have never worked as Front End developer and I am very little experienced in JavaScript too.", "I have already started fixing bugs in our project and I am comfortable with fixing bugs in it. But I am not 100% comfortable in making a whole new feature.", "I started watching egg head series by Dan Abramov, started reading react js's doc, Apollo Client's doc and GrpahQl's doc.", "But everything is so intimidating and I really don't know what to learn first. Oh, Also I have to learn ES6 too.", "I really don't want to get fired and I am really afraid.", "I am giving extra hours to learn this stuff. But If you guys can recommend me any course or anything that would be really great.", "P.S - This is my First Job.", "This is pretty ridiculous expectations from your manager. Redux, React, Graphl, Appolo and javascript are not easy to learn.", "You should start with basics of React first, then integrating it with Redux.", "After you should look at Graphql. Apollo uses Graphql just like ReactJS uses javascript.", "Then move on to Apollo.", "Why would they not just hire an experienced dev for this new project? It's going to cost the company more in terms of time spent because your code will still be spaghetti  as a beginner."], "score": "1", "title": "HELP !! How to start learning about React, Redux , Apollo Client and Graphql ?"},
{"content": ["Hi, I'm new to python, and am currently coding in idle. I've been doing research into the different text editors and IDE's out there that I can use and I'm wondering when I should make the switch off of Idle. Also which text editors do you recommend. I thought about maybe vim but I read about the steep learning curve also maybe atom or sublime. ", "Atom, Sublime and Visual Code are easier to just jump right into while Emacs and Vim do indeed have a steep learning curve (I suppose Emacs is fairly simple if you don't use any of the features).", "For a beginner definitely go for the easier ones. No need to learn a complicated text editor while you are learning the basics of programming.", "I'd recommend Atom or Visual Code since they are both free, while Sublime Text is not.", "thankyou for the advice I already downloaded atom so I think im going to learn on that", "If you want a full blown IDE go with PyCharm. If you just want a test editor, do Atom, Sublime, or Visual Studio Code.", "Switch to Sublime as soon as possible.", "why do you like sublime", "It's easy and has nice features."], "score": "1", "title": "IDE question please help"},
{"content": ["I'm literally lost. I'm doing a course and I have a JavaScript assignment due Tuesday, not big but I have no idea what I am doing. It requires something about a data check and then a simple payment form but I don't know what I am doing as the instructions are vague and not helpful. Plus by the time my lecturer replies my assignment will be due. My depression has kicked back in horribly, which happened back in highschool. ", "Any help or links on where to learn about that data check thing or receiving info from a form?", "Thank you so much ", "Edit: meant desk check not data", "What do you mean by a data check? Can you expand on this?", "Shit I actually meant desk check. Sorry. And that's about it. That's all it says to do. Literally the most useless instructions I have ever seen.", "Desk check means someone (probably your instructor) sitting down and testing the logic of your application. ", "It's not something you have to create. "], "score": "0", "title": "Stressing myself out with Javascript"},
{"content": ["I'm a beginner and i want to make an android app. What tools do i need? is Android Studio a good place to start?", "Android Studio is the only tool you need. Just follow the install instructions."], "score": "1", "title": "I need help making an android app"},
{"content": ["So I'm new to programming and I recently put a post out on stackexchange asking for help with my project that I'll use for work. While this would be first of many projects I would do to help develop my skills as a programmer, like anybody I ran into a roadblock. So I ask for help and what I got was overwhelming the guy was nice about it and he helped me with my issue, but damn if he didn't fix my issue, teach me, and then go beyond my original idea for my project. He was a coll but dang his answer  just made me feel inadequate as all hell.  Is this something all new programmers feel, from more experienced?"], "score": "0", "title": "Experienced programmer, turning my idea into somthing bigger than my original plan."},
{"content": [" This is homework-ish, and I'm not sure if this is right subreddit.", "Quick background: \n-Did the bomb lab and made it through every phase without blowing it up\n-Professor was gone, so another managed the lab. \n-Regular prof. came back and grade for the lab was not perfect\n-Prof. won't correct grade unless I can prove I did it\n-Bomb lab won't run unless a server is up or something", "I figured out how to bypass the authentication but it's tedious. I'd like to write some code that will change the value of a register at a particular line but I'm not sure where to start. ", "Note: I only have access to the assembly code.", "thanks!!", "We would need waaay more information to be able to help you."], "score": "0", "title": "Need advice on how to write a program to alter register values in a separate program as it runs"},
{"content": ["Well, title says it all is it possible to write in some language a script or something where you can write some custom abbreviations and expand them on using  a Tab hotkey. I think this would have rly nice usage in some native languages to shortne up some data input. Sorry if this is not right place to ask since im begginer and im learning on my own programming. "], "score": "1", "title": "Is it possible to make some script/extension like Emmet for typing in word,browser,windows with abbreviation expand"},
{"content": ["So I’m currently in university studying business and information technology. But I want to switch to computer science. However, I’m too afraid. I have taken a few classes in Java and Unix ( required for my current major ) so I know the very very basics. I want to learn more about computer science but I feel to dumb, plus if I switch my major I’ll probably have to take an extra semester or two which I don’t want to do. Do you think I can still get a software engineering job without have taken algorithms and data structures, but still have some knowledge on how to program ( as little as that may be). ", "Any advice would be appreciated. ", "If you know how to program you can get a job without any formal education at all. It's a performance driven industry.. no one is going to care what classes you did or didn't take as long as you can code like a pro. Without a degree you might need to start with some less desirable jobs but you can quickly leverage that experience into better positions.", "But even with very limited knowledge? the most complex thing I’ve learned is sorting algorithms. Do you think I could still apply for a job or should I learn more on my own first? ", "I’m learning more on my own but I want gain some experience as well and have people who know what they’re teach me concepts I get stuck on. ", "You should learn how to program before applying for a job. Employers won't train you, they'll expect you to already have a firm grasp of the basics. Everywhere I have been has been very sink or swim, not a lot of instruction. If you really trust yourself to learn things quickly you can do it on the fly. But I think you can stick with your business/IT degree and graduate on time, save yourself a bunch of money, learn programming on the side, and then find a start up or small business willing to take you on in a junior developer role. Having already completed a nice personal project or some freelance work will help your prospects and make you seem less risky to hire on.", "Then why not learn data structures and algorithms on your own? There are tons of great resources for it. Just do some googling.", "I am but I also would like help if I get stuck. Like if I get a job someone could actually teach me in person.", "employers want everybody on the same page. Right now the BAS in CS is a very coveted degree for even entry level jobs due to the severe inflation of college degrees (in america at least). Even network engineering jobs want BAS CS for some reason. In my opinion if you want to put in the time and effort to get a CS degree it would be absolutely worth it. And don't be scared to feel dumb; everybody felt that way at some point. "], "score": "0", "title": "Posted before"},
{"content": ["Hi,", "I apologize for my beginner questions but I need advice where to start. ", "I want to write a one page app that is similar to say tinder in ways like swiping and liking and pics showing up. There would also be some GIFS and PICS showing. ", "Where would I start? I know iOS has it's own development through XCode and Android has something similar but I also know there are new technologies and platforms like Appery io and mobile machine. What are my best options? Any advantage of choosing one over the other? Are there cross platform technologies that are really good? Should I just get really good at HTML/CSS/Javascript (Angular, node, etc) first and then come to writing app code? I'd say I am at low intermediate level in Javascript. ", "Also, what's the best for server level support? I'm not super familiar with the latest technologies. ", "Here is my background:", "I have been out of front end development for a while. I know Python fairly well and I have background in Embedded Systems so I'm familiar with OS level stuff and programming in C++, Linux Scripts, etc. but I am not up to date in the latest front end and app development technologies. Programming basics I have down but I feel overwhelmed with resources available. ", "I am willing to spend some time learning as well. ", "Any input would be appreciated. ", "Thank you,\nBhavs. ", "check out the faq:"], "score": "2", "title": "App Development Advice Needed. Where To Start?"},
{"content": ["Last summer I applied for an internship and failed to get it because of my lack of knowledge in C# and .net. I have found several places to learn C# however .net seems to be harder to find resources for any help would be appreciated", "A framework (.NET for example) is basically just a collection of tools to help you achieve a specific goal. ", "So really, the best way to get into it would be to pick up a project that interests you, and try to learn aspects of .NET that pertain to it. ", "Want to mess around with databases? Maybe try to learn sql and linq.", "Want to start a project that uses a UI? Check out wpf, and learn the design patterns that go along with that; like MVVM and how data bindings work.", "There's tons of stuff out there. Just pick something and run with it. You'll learn a ton along the way, and at the end you'll have something to show next time you're applying for jobs. ", "Dude.  NET docs, support and amount of sample code is fantastic and the best you can find out there.", "Just head to msdn "], "score": "2", "title": "Looking for good resources to learn .net coding"},
{"content": ["I have no idea how to do this. The book I have (Control structures through objects) doesn't even mention messing with output or input streams.", "I've been just reading the prompt since 8am because I don't know what to do.", "Check out ", " and ", ". ", " is a nice reference for C++.", "i've looked there and on stack exchange but I don't understand what Im reading and at this point I'm stressed out about it.", "Where I initially asked the question. It has more info.", "Don't fret, it's really simple.", "In your Filter class you need 2 properties for the 2 streams:", "1 input stream (which in C++ it is the std::istream type from <istream>)", "1 output stream (which in C++ it is the std::ostream type from <ostream>)", "Note that <iostream> will #include <istream> and <ostream> for you.", "Then in the constructor, you receive you simply assign to them the std::cin and std::cout (found in <iostream> I think).", "Feel free to ask if you have any questions.", "edit: formatting", "I've tried that and it says \"no default constructor exists for ostream\"", "Change it to a reference type, like std::istream& and std::ostream&.", "Edit for more details: I just tried it and it seems that the streams copy constructors are deleted. Which makes sense since you would have to create more connections to the same resource by having multiple streams open. References to the same stream are still allowed though, and they are easy to work with.", "I get errors.", "Well change it where you declared it, not in the constructor where you initialize it ;)", "It has the same errors", "Just remove the reference from the initialization", "That leaves the same errors too.", "Yeah, my bad, it does not actually initialize it at the right time. This should be correct:", "What is that, though? I;ve never come across that in my book.", "Why are you putting a colon there?", "Note you'll have to have references to the streams, since iostream objects are non-copyable. This means your constructor(s) will have to explicitly use ", ".", "I'm so tired, stressed, annoyed that I can't make sense of that. I don't understand why it's in the prompt. Not one chapter in the book covers this", "I see you asked over on ", " too and got some good answers, even.including example code (though there is one glaring bug in it)", "it's not about the code. it's about understanding what i'm doing and why my code doesn't work. If it were about the code only I would have stopped 5 hours ago when I fist sat down with my laptop on my lap and started trying to figure it out.", "I haven't even walked my dog yet. I've been in the same spot for over 5 hours trying to figure out 1 paragraph", "I don't think I can explain it any better than has already been done."], "score": "2", "title": "Super stuck on a prompt (c++)"},
{"content": ["This was for my Intro to Programming Class using Python. It was challenging, and I tried my best to not hard code some obstacles that I was running into! Just submitted it yesterday!", "Not bad for an intro class project."], "score": "3", "title": "I wrote a genetic algorithm to solve a maze! Feedback greatly appreciated."},
{"content": ["If your question is about code, make sure it's ", " and ", ". Here's a checklist of what to include:", "Do your best to solve your problem before posting. The quality of the answers will be proportional to the amount of effort you put into your post. Note that title-only posts are automatically removed.", "Also see ", " and the ", ". After you post a question, ", " delete it!", "Asking conceptual questions is ok, but please check ", " and search older posts first.", "If you plan on asking a question similar to one in the FAQ, explain what exactly the FAQ didn't address, and clarify what you're looking for instead. See our full guidelines on ", " for more details.", "Please read ", " and ", " before posting. If you see somebody breaking a rule, report it! Reports and PMs to the mod team are the quickest ways to bring issues to our attention.", "If you're reading this then it means you're trying to learn on your own, which is awesome. Don't be afraid to not know something, everyone starts from nothing. Be proud of anything you make. ", "Also remember that even the best programmers don't know everything off by heart. The best programmers read the docs more than beginners do!", "Can I make good money self educated? ", "There's plenty of success stories here about getting jobs and being self-taught! You can do it, just gotta be dedicated. ", "How about if there's input or output, give an example of what you think should be happening VS what is happening.", "I suppose that can be part of the error message if applicable. ", "Shouldn't that always be included?", "It should, but it never is. ", "Good idea; edited.", "I thought this sub is more about dealing with your existential crises, telling your life stories, and giving motivational speeches", "I'm not sure exactly how reddit works but if it has post templates then a part of this would definitely be useful as a post template", "Unfortunately, post templates aren't a thing on reddit AFAIK :(", "You could use custom submit buttons (like the ones on ", ") to show the submitter a pre-filled out form on the submission page.", "Ooh, I didn't know that was a thing! I'll look into doing that.", "I think the main reason I haven't been trying to learn to code is because it seems daunting. How do I get past this?", "You already know the answer. Set your fears aside and jump right in.", "The FAQ lists some good places to start which aren't overwhelming."], "score": "827", "title": "New? READ ME FIRST!"}
]