[
][
{"content": ["Hello there!, so I created a hybrid mobile app using phonegap/jquery/ajax for the frontend and nodejs/express/mongodb for backend. I make ajax calls using jQuery to get data from the DB and display it on the app, im using bootstrap for the style.", "My question is, how do i handle authentication? I have created web apps that use it, with express/passportjs etc, but im not sure how to handle that in the frontend of a hybrid app. Can jquery do that? is there other tool or technology for that?", "Thanks!"], "score": "2", "title": "Question about authentication, ajax, and hybrid apps."},
{"content": ["Suppose you're creating a web application with a welcome message editable by an admin from a GUI, what would be the best way to store this value?, on a global variable or creating a database Table for this single value ? ", "The web app is built using PHP (Laravel) and MySQL if that matters.", "The problem with using a global variable is that if you ever restart your web application, the state of the variable will be lost. If you already have a database, then you should store it there. If the only reason you're creating the database is to store the value, that seems pretty overkill and you should just write it to a file.", "There’s already a database within the application, I was just wondering if there was another (better) way of storing a single value without building an entire table. Didn’t know global variables restarted along with the app though.", "Thanks :)", "Often you have more than one of these sorts of things so perhaps a parameter table with parameterName and parameterValue fields.  Then you have a general purpose solution for storing one-off items.", "Disclaimer:  I am not and never have been a web app developer, nor have I played one on TV.", "It it's in a global variable, doesn't that mean it's stored inside a running application?  In that case, when the application stops, the welcome message would get lost.  I think you'd have to find some outside storage, such as a field in a database table, for it.", "I'd personally make it a table and insert a new row with text and current timestamp every time it's edited, and serve the last added value to the users. "], "score": "1", "title": "Global Variable vs Database Table to store a single value?"},
{"content": ["like a hotkey?"], "score": "2", "title": "[question] Is there a easy way to open tmux copy buffer in vim?"},
{"content": ["to compile the program for processing two arrays A [N, N] and B [N, N], where the data are real numbers in the range [-99.9; 99.9].", "You haven't given enough information. What program are you trying to compile? What does 'processing' an array mean?", "Sorry that i didnt give much information and that i didnt form my question properly.", "to compile the program for processing two arrays A [N, N] and B [N, N], where the data are real numbers in the range [-99.9; 99.9].\n1. print the condition of the task;\n2. printing the names of the author of the program;\n3. entry of the input data;\n4. printing the input data;\n5. a) to reset the elements in array A which are greater than the arithmetic mean of the elements of the corresponding column of array B;\n6.b) Determine the number of altered elements in array A;\n7. printing of the results obtained after processing a) and after processing b).", "pseudocode:", "That's as much as I'm gonna give you - we're not here to do your homework.", "I am using Dev-c++", "Did you read the stickied post called READ ME FIRST? We aren't here to do your homework for you. We are more than happy to help but not just give answers. Post whatever code you've tried so far and we'll guide you to the solution :)", "Ive read it, and here comes the problem, i am so confused i dont even know how to start."], "score": "0", "title": "Guys, i am having trouble with this, could you help me out please."},
{"content": ["For part of my job, I do routine monitoring tasks that primarily involve the following:", "Each week as I do these tasks, I realized how mundane and repetitive the it is, and that there's barely any critical thinking involved in reviewing the logs. With the type of work that's involved, the the tools used, what are my options to automate at least parts of this?", "Would \"Automate Boring Stuff With Python\" be a good start for me? I do have beginner/intermediate programming experience, so can definitely tackle scripting if that's the best options here.", "Windows PowerShell", "bad bot", "Yeah python should do the trick. Pretty easy to pick up as well ", "Take a look at ", ", which allows scripting on GUI apps on Windows.", "Yes.  Python is another excellent choice.", " is a pretty good 'alternative' to AutoIT as well."], "score": "1", "title": "Where to start automating simple Windows tasks?"},
{"content": ["Hey guys, so I have some C# code that takes data from a text file, and loads it into an excel sheet.  The format goes: Name, Tests, and average of those tests.", "An example of what I get: ", "It all works, except for the part on calculating the average.  Can someone take a look at my code and help me understand what I can do?  The average bit is at the bottom.", "Example of what I need: \n", "Code for the Excel class:\n ", "Code for main: \n", "Thank you guys so much!", "to use the average function in excel you have to pass in he cells that contain the data you want to average "], "score": "0", "title": "Excel in C#, need help calculating averages."},
{"content": ["If your question is about code, make sure it's ", " and ", ". Here's a checklist of what to include:", "Do your best to solve your problem before posting. The quality of the answers will be proportional to the amount of effort you put into your post. Note that title-only posts are automatically removed.", "Also see ", " and the ", ". After you post a question, ", " delete it!", "Asking conceptual questions is ok, but please check ", " and search older posts first.", "If you plan on asking a question similar to one in the FAQ, explain what exactly the FAQ didn't address, and clarify what you're looking for instead. See our full guidelines on ", " for more details.", "Please read ", " and ", " before posting. If you see somebody breaking a rule, report it! Reports and PMs to the mod team are the quickest ways to bring issues to our attention.", "If you're reading this then it means you're trying to learn on your own, which is awesome. Don't be afraid to not know something, everyone starts from nothing. Be proud of anything you make. ", "Also remember that even the best programmers don't know everything off by heart. The best programmers read the docs more than beginners do!", "Can I make good money self educated? ", "There's plenty of success stories here about getting jobs and being self-taught! You can do it, just gotta be dedicated. ", "How about if there's input or output, give an example of what you think should be happening VS what is happening.", "I suppose that can be part of the error message if applicable. ", "Shouldn't that always be included?", "It should, but it never is. ", "Good idea; edited.", "I thought this sub is more about dealing with your existential crises, telling your life stories, and giving motivational speeches", "I'm not sure exactly how reddit works but if it has post templates then a part of this would definitely be useful as a post template", "Unfortunately, post templates aren't a thing on reddit AFAIK :(", "You could use custom submit buttons (like the ones on ", ") to show the submitter a pre-filled out form on the submission page.", "Ooh, I didn't know that was a thing! I'll look into doing that.", "I think the main reason I haven't been trying to learn to code is because it seems daunting. How do I get past this?", "You already know the answer. Set your fears aside and jump right in.", "The FAQ lists some good places to start which aren't overwhelming."], "score": "824", "title": "New? READ ME FIRST!"},
{"content": ["Last summer I applied for an internship and failed to get it because of my lack of knowledge in C# and .net. I have found several places to learn C# however .net seems to be harder to find resources for any help would be appreciated"], "score": "2", "title": "Looking for good resources to learn .net coding"},
{"content": ["I am in a freshman seminar this year in college, working with Arduino and iCreate roombas with the goal of solving an unknown maze as fast as possible.  I currently have a functioning left wall follower program working, but it is neither fast nor efficient.  I have been reading about recursive backtracking and other similar methods, but the concept and code examples go over my head.  Are there any resources or ideas that I am missing? Any help would be greatly appreciated.  ", "Do you mean theoretical algorithms or a practical solution involving robots?", "Solving a maze theoretically is much simpler than solving one in practice. In theory, your algorithm has perfect information (or at least can discover information with complete accuracy), and it can move reliably in a set of legal directions without complication. In practice, robots need to worry about a wide variety of error and slightly incorrect data, which greatly complicates everything.", "The theory of solving a maze algorithmically isn't too bad. Like you say, there are a variety of approaches, but they can be simplified. Here's my best metaphor for how to solve a maze:", "A robot enters a maze and comes to a fork. That robot decides to build copies of itself so that each copy can go a different way. It loads its complete memory into each copy so that none of the copies knows which is the original robot, but they all remember how they got to this point. When a robot comes to a dead end, it self destructs. When a robot comes to another fork or reaches a point any rob, it builds more copies, and they all proceed in every direction. Eventually, some robot is guaranteed to leave the maze, and that robot will have a memory of always choosing the right direction to take next. That robot will probably consider itself to have been very lucky, and you will now know the best path through the maze.", "You probably don't want to simulate an infinite number of robots doing things in parallel, so you cheat. You remember every time you had to make a decision. If you come to a dead end, your latest decision didn't work out, so you back up to when you made that decision and choose the next decision instead. If you back up and see that you tried ALL of the decisions and none of them worked out, you back up further to the previous decision and try the next decision at that point. Repeat until you've tried everything possible or you solve the maze.", "I’m looking for more of a practical solution, however this is an interesting perspective on the theory that I think could help me build some ideas.  My biggest catch I think comes in trying to use theoretical methods with decision making in a way that the roomba can’t follow easily. The metaphor you used though is giving me some ideas. Thank you for the help!"], "score": "2", "title": "Maze solving algorithms help?"},
{"content": ["I am taking an \"Advanced Java\" course and the professor got a little lazy this week. She has directed us to browse the web and library for resources on concurrency and threads.", "Below are some areas of focus:", "I have read several discussions on Stack, taken a look at a couple of different \"tutorials\" and read the Oracle documentation on the topic. I'm still struggling to connect the dots.", "Are there any articles, videos or textbook excerpts that would be of help?", ".", "Thanks! I'll check it out. Just discovered that Clean Code has a chapter on concurrency as well so I'm hoping that helps."], "score": "2", "title": "Resources to help learn about concurrency and concurrent programming?"},
{"content": ["It's for a homework assignment. I have method to delete items from the list, which seems to work fine. I need to edit the method to delete all occurrences of an item from the list.", "Example List: hello world world world ", "remove world:", "New List: hello", "I'm just confused on how to loop through and get this done. Any help is appreciated.. Here is my current method:", "You have to make a small change. What if you only broke your while loop when current == null? Could you just remove nodes inside your while loop?"], "score": "2", "title": "java linked list delete method help"},
{"content": ["Suppose that we will add ILDAC Γ to the RSCPU’s instruction set. The semantics of the instruction is AC <-- M[M[Γ+1]:M[Γ]]; i.e. indirect loading into the accumulator. List the RTL statements to be used for the execute cycle of this instruction. Assume that the FECTCH cycle used for the existing RSCPU will be used as is.", "AC <-- M[M[gamma+1]:M[gamma]]    ", "I have parts of this assignment done\nThe question is a little confusing since it just says existing rscpu fetch sequence. Is question 1 and 2 fetch sequence the same?", "\nI've drawn the ALU it looks just like slide 46 but the ALUS's connect together and then go into a decoder. I assume i have to use gates outside the decoder to make it work only with these using combination logic", "JMP11: PC <--AR", "JMP12: PC <--PC + 1", "INC21: AC <--AC + 1", "INC22: AC<--AC + 1", "ADD11:DR <--M, AC ¬AC + 1", "ADD12:AC <--AC + DR", "SKIP1: PC <--PC + 1", "I need more help on the title question though", ". I missed 2 classes in a row because I slept through my alarm both those days. He speaks alot during the presentation so i missed most of the important stuff to understand this new section such as why theirs a semi colon in the middle of the instruction/semantics."], "score": "2", "title": "[Microprocessors, RSCPU] RTL statement for indirect loading into accumulator"},
{"content": ["I’ve only been into programming for the last few months and for the last few weeks I’ve been reading Code Complete and while it’s a beginners book I’m still having trouble really grasping the concepts. Is there anything I could look at or do that would help me understand it a little bit more?", "Which concepts specifically do you have trouble with? The book isn't meant to be an introductory book, personally I think it makes more sense once you have been programming for a while because you can identify patterns you use in your code and correct them. ", "Yeah thats what I’m thinking as well. For example I haven’t done any programming with child classes yet, at least I don’t think, and that and inheritance is kind of confusing to me. ", "I think after I work through a few bigger programs and gain a more solid foundation it would be great. ", "Do you have any book recommendations for a beginner? Specifically web development ", "\"Web development\" is really vague. "], "score": "2", "title": "Reading Code Complete, but having trouble understanding it"},
{"content": ["I look online and all I can find are basic programming ideas that I can do in my sleep. I want to write something that does something useful either to me or someone else, but I'm struggling to come up with something that's within my skill level. ", "There is a list of project ideas in the FAQ", "Firstly, why won't you start from checking sidebar. Yes, it actually has a list of ideas. ", "Secondly, you don't come up with an idea for a program by sitting in front of your pc and trying to think up of one. You do that by doing your everyday chores/tasks and realizing that something could be simplified or improved upon with some coding. Might as well be a program that informs you every X day that it's time to do laundry via SMS for instance if you are forgetful. ", "What is your skill level?", "I'm experienced in Java", "Hey, I've been working on a blog that tackles this issue. I only have one post for now, but I think it may help. It walks you through the steps of making a URL shortener. Please take ", " and let me know what you think."], "score": "2", "title": "So I'm bad at coming up with ideas to write a program for."},
{"content": ["So I threw together a basic table using the FIFO principle with functions for pushing, popping, checking the length of the list, and checking if it's empty. That is essentially what a queue is from my limited understanding as a novice programmer.", "That was dandy but the reason I made it in the first place was to use for a*. So for those who don't know Lua, tables are the only data structure in Lua and they're extremely flexible, powerful, fun to work with, and any sort of data structure (even classes) can be represented by them with a little leg work.", "So as soon I realized I'd need to store coodinates in the queue for pathfinding I hit a bit of roadblock. The queue takes 1 value at a time and removes one value at a time. I'm not sure if I can push and pop tables with the x and y coordinates within the table unless I design it specifically to handle that.", "So the solutions I considered are...", " Using just one table push and pop the x and y coordinates one at a time. So insert a number into the list, and insert another number into the list and remember when removing them that the first one removed is x and the second number removed is y. Storing and removing a string of numbers this way seems really arbitrary and bad practice. So while possible and to some extent manageable, I anticipate it can lead to big problems if there is any small hiccups.", " Create a table queue as I'm calling it for pushing and popping a table at a time from a table that stores all the tables related to it's coordinates. Each table will have 2 values in it that will represent the x and y coordinates. This is what I'm leaning towards, since it seems like the more approachable to me while the safest for the purpose, since a big priority is getting a working a* and so this queue will be used just for the sake of that and if I need a queue for other things I can design a different one to suit the purpose.", " The last option is to design a flexible multipurpose queue that knows what it's working with whether it's having tables stored inside of the main table or just single values and then have it respond based on that. This seems like the most convenient option, but I imagine if I try to tackle this the code won't be efficient or optimal enough and even if it works may explode on me. I figure typically this is how queue's are designed though, I just don't know if I'll be able to do it until I get better.", "So while there's a lot of ways to solve a problem, as a codebase grows bigger a sub-par solution might show it's limitations and be harder to remove if it's build into enough things. I love the idea of code that's flexible enough to be modular and not tied into too many things unless it's a crucial component and try to be considerate in that when coding to avoid future frustration.", "Maybe I'm just overthinking this or missing something fundamental, and that's why I'm reaching out to this community with those far more experienced and/or insightful then myself. ", "tl;dr I can insert single values into the queue but if I try to push a table or pop a table it isn't very happy."], "score": "1", "title": "Approaching a queue in Lua for pathfinding"},
{"content": ["Hi, I've been working on a YouTube channel which goes over basic skills students will need for GCSE computer science", "Let me know what you think!"], "score": "1", "title": "Python programming YouTube channel for beginners and GCSE students"},
{"content": ["I'm working on a 2d game and it's very stressful considering I don't have a full grasp on Python yet.", "So my question is.. How do you handle the unknown? I have a hero class and I want to run an attack method if hero.x is less than Enemy.x (simple example).", "Here the Enemy is a class.\nclass Enemy:", "However, when I call Enemy.hp with the intention of using the attack() function on any object under the Enemy class, I get an error saying Enemy doesn't have an attribute 'hp'... but it does....", "For that matter, if you could give me any resources or information on handling unknown objects and classes in Python/Pygame that would be greatly appreciated. I just clearly am missing a HUGE chunk of knowledge here.", "I just want to be able to attack any enemy.", "Even when I call a specific instantiated enemy, it says it isn't defined....", "Thanks everyone, if you don't understand my question I will gladly elaborate. I really can't continue with this game without this knowledge."], "score": "1", "title": "[Python/Pygame 2d RPG] How to handle the unknown?"},
{"content": ["I am having a hard time getting the correct decompositions for the given questions:", "We decompose R into two relations R1(dnumber, dname) and R2(pname, pnumber, plocation, dnumber).  Does this decomposition have the lossless join property?  Show your steps to achieve the answer. ", "I have a good understanding of how to do decompositions on these types of relations, but this set of FD are stumping me. Could anyone provide some insight or help?", "Thank you for your help!"], "score": "1", "title": "Help with relation decomposition into various NF to ensure lossless join property and dependency preservation."},
{"content": ["Hi,", "I apologize for my beginner questions but I need advice where to start. ", "I want to write a one page app that is similar to say tinder in ways like swiping and liking and pics showing up. There would also be some GIFS and PICS showing. ", "Where would I start? I know iOS has it's own development through XCode and Android has something similar but I also know there are new technologies and platforms like Appery io and mobile machine. What are my best options? Any advantage of choosing one over the other? Are there cross platform technologies that are really good? Should I just get really good at HTML/CSS/Javascript (Angular, node, etc) first and then come to writing app code? I'd say I am at low intermediate level in Javascript. ", "Also, what's the best for server level support? I'm not super familiar with the latest technologies. ", "Here is my background:", "I have been out of front end development for a while. I know Python fairly well and I have background in Embedded Systems so I'm familiar with OS level stuff and programming in C++, Linux Scripts, etc. but I am not up to date in the latest front end and app development technologies. Programming basics I have down but I feel overwhelmed with resources available. ", "I am willing to spend some time learning as well. ", "Any input would be appreciated. ", "Thank you,\nBhavs. ", "check out the faq:"], "score": "2", "title": "App Development Advice Needed. Where To Start?"},
{"content": ["This was for my Intro to Programming Class using Python. It was challenging, and I tried my best to not hard code some obstacles that I was running into! Just submitted it yesterday!", "Not bad for an intro class project."], "score": "5", "title": "I wrote a genetic algorithm to solve a maze! Feedback greatly appreciated."},
{"content": ["Hey everyone! My friend made a simple little game for his college class! If you guys could could download it and try it out that'd be a great help for him! If you enjoyed it, leave a review! Thanks \n"], "score": "1", "title": "Check out a game my friend made!"},
{"content": ["In order to read the Economist online without a subscription, I realised that by disabling JavaScript and reloading the page, the paywall can be avoided. As a little project, I'm trying to make a chrome extension to do this quickly. ", "So far, I've created an extension which removes the obnoxiously large add at the top of the page, however I'd like to make it disable JS and reload the page, too. Unfortunately, this seems to be something that's very difficult to Google.", "So far my manifest is:", "And my JavaScript is this:\nbackground.js:", "testScript.js:", " is an example of the page that I'm trying to change.", "You can disable javascript with chrome.contentSettings.javascript and ", " of what that code can look like.", " GitHub links:", " ", "While you can go this route, what you might want to do is identify the offending script and add a rule to an adblocker extension to not allow it to load. ", "Thanks. ", "I'm aware that's probably the easiest option but I'm approaching this as an opportunity to learn something new. "], "score": "2", "title": "How do you disable JavaScript in a chrome extension?"}
]