[
{"votes": "0", "title": "Checkbox in excel 2010", "content": ["\n                    It seems that nobody knows how to increase the size of the little box that you check in the checkbox feature that you can insert into a spread sheet. The checkbox that you insert into the spread sheet is way to small.                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "Systems Administrator career direction", "content": ["\n                    Thanks in advance for any helpful replies to my question. I'm trying to make a career change to working in IT, potentially as a systems administrator, and I would appreciate any feedback in terms of advice on how to do this and if my plan is \"do-able\". My plan in short is to get enough certifications until someone will hire me.", "I've been learning to work with servers on a virtual lab I set up and I passed the CompTIA A+ and Microsoft Technology Associate - Server Fundamentals certifications. I should be able to get the MCSA certification in the next few months.", "Is it likely to get a systems administrator job with certifications alone and self-training? In terms of certifications, would it be more likely with MCSA in Windows Server 2012, CompTIA A+, and MTA than just CompTIA A+ and MTA? I'm still relatively young though I have a Master's Degree in Molecular Genetics, and not much IT job experience. I tried to get help-desk jobs but I am guessing I'm over-qualified as they don't respond. Thanks.                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "Tech Takedown- Nostalgia Edition", "content": ["\n                    Ready for some tech nostalgia? The humble floppy disk takes on the first smartphone in this week's Tech Takedown.", "/en/resources/teksavvy-blog/2017/technology-takedown-floppy-disk-v-smartphone                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "What course to get into hardware/ networking career?", "content": ["\n                    Hi I'm looking at redundancy in the next few months and researching career options in IT.", "I'm 42 years old and would prefer to get into the physical hardware \"on site\" side of things that's not prone to offshoring. ", "I took a short A+ course about 10 years ago which I enjoyed and found easy but never really pursued a career out of it as another opportunity came along at the time in my field of work (business administration) and I was put off by the low salaries and limited job opportunities with just an A+. Most of it was 14k shop repair work unless you went self employed and the local paper here is satuated with no fix no fee computer repair ads.", "I'm confused with all the various course abbreviations, i.e MCSE, MCSA, N+ etc etc...", "My question really is what sort of course / job entry route would be best for someone in my position. I'm a married father of two so wouldn't have 0000`s hours study time available to do anything too long and advanced. I would really be looking at several months rather than years. I would be willing to work for a low entry level salary if it led to a proper career path with opportunities.                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "Have you ever been asked a brainteaser in a job interview?", "content": ["\n                    Google has famously asked its interview candidates brainteasers like \"how many golf balls fit into a school bus?\" (", "/2gffrnX) Have you ever asked or been asked brainteasers like this in a job interview? What were some of the best and worst ones you've come across? What's your opinion of it as an interview technique?                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "Need help to choose a qualified ecommerce company. Offers?", "content": ["\n                    Hi, I'm a beginner in a site development. Looking for ecommerce development company for building online store. Our little team have lots of ideas but we haven't got qualified developers specialized in ecommerce sphere. Some offers? What could you say about this company ", " ? Did anybody work with them?                "], "from_forum": "employment_discussion"},
{"votes": "1", "title": "Wanting to get on the ladder of an IT career", "content": ["\n                    Here's the deal - I'm a middle-aged guy having the classic Mid-Life Crisis thing. I want to retrain for a new career in IT starting from Ground Zero. I have been looking at what's in-demand, and it seems to be system administrators and Cloud management - Microsoft Azure and SQL seem fundamental. Shopping around, I have been offered this bundle, ", "/courses/GK-Digital-Learning/moc-on-demand/ and I'd be very interested to hear from all you techies out there to inform me if this is a good ladder of modules to climb up. Perhaps you know a better one. I look forward to hearing your opinions!                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "#WWY", "content": ["\n                    ", "I’m Brandon from the editorial team if you don’t recognize my name from reading the site. ", "Long-time forum readers probably remember the What Would You Do series that we used to run. If you don’t it was a discussion-based column where we would pose IT questions, often drawn from our own experience, to our readers. After giving all of you some time to think it over and post your responses we would write an article that included a few of them.", "We haven’t written a WWYD column in a long time, but we’re bringing it back. Here’s our very first scenario for your consideration. The names have been omitted or changed, of course, to protect the tech illiterate and professionally irresponsible.", "Sorting out an IT disaster", "You’re working for an MSP and are assigned to a particularly difficult client site. When you get there you find out they had just hired your company and dismissed their in-house IT person, who was essentially completely unqualified for the job.", "The IT office is a mess, the server room is a disaster, there’s no discernible rhyme or reason to anything, and there’s very little documentation to help you.", "To top it all off the business’ main piece of industry software suffers from constant lag, instability, and unacceptably long hangups during face-to-face client meetings. ", "It gets better: The office manager is definitely an “IT is magic” kind of person who doesn’t care what’s going wrong or how long it takes to fix it—he wants it working yesterday, giving you very little time to feel the situation out. If you want to keep this client you need to get things up and running fast.", "So, where do you begin?", "PS: This is a scenario that happened to me several years ago, so if you need some clarifying information I’ll be glad to answer.", "-Brandon                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "career direction advice", "content": ["\n                    I was recently laid off when the company that i’ve worked for the past 17 years started selling off business units.  I’ve worked in IT for 20+ years.10 as a network engineer, working with Cisco and Juniper gear.  Had a CCNA and CCNP but let them lapse about 3 years ago because i was moved into a supervisory and management role.  Got my MBA with a concentration in IT.", "Ideally i would like to work with people in a management/supervisory role, still in the network infrastructure area.  Should i go back and re cert on Cisco or focus on areas like ITIL or project management certs like CAPM and on to PMP?", "Thoughts?                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "Switch from Software Developer to DBA. How?", "content": ["\n                    I am a Software Developer on the ", "Job last 8 months. I want to switch to DBA field.", "How I Proceed for the Same?", " Any Best path to it Can You Suggest?                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "How do you progress your IT career when an employer is blocking development", "content": ["\n                    Hi All", "I was wondering if you have any advice as to how I can progress my career in IT?  I am currently working as a IT Service Desk Specialist but mainly 1st line support but I am looking to progress in to infrastructure support and networking.  I have my Cisco Certified Network Associate which I acquired in March 2016 and CompTIA A+﻿ certifications.  I have enquired with my current employer but there they are no development opportunities and they are not willing to give me any experience in infrastructure so I can gain experience in this area.  I believe gaining relevant experience would be beneficial to me in securing a networking role", "I want to continue in employment as I have a family to support but also gain networking experience at the same time", "I have not decided which area of networking to specialise in but voice, data or infrastructure are my main fields of interest", "I would really appreciate any advice on this as it is very frustrating working in my current role and I know I am capable of so much more", "Rajesh                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "what is the difference between toolkit, library and sdk ?", "content": ["\n                    can u explain it simply. i searched it already buy i couldnt understand it lastly. Thank you guys for your answer and cooperation                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "change developer role", "content": ["\n                    I have 10 years of experience as a software developer but now want to change my job. Honestly, in logic i have never felt to be best fit in development but as it is quit paying job so I kept continue. I now want to switch form a developer to may be system analyst or tester. The reality is I am not much intelligent to bear the work pressure if IT industry. unable to understand where should i go from here", "Can someone please advise?                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "space C", "content": ["\n                    I have a problem. I cannot eliberate the space on  C partition in Windows server 2008 R2.", "Any solutioms?                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "Database Administration", "content": ["\n                    Are database skills important for IT professionals in other fields", "(security, development, programming, etc…)?                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "What do you think about the idea of skill sharing between professionals?", "content": ["\n                    Today's industry evolves so fast and I think the best way to upskill one-self as a professional is to learn from other fellow professionals, rather than depending on long-term and high paid courses available out there. What are your thoughts?                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "Microsoft MTA Certification Question", "content": ["\n                    Hello,", "I am transitioning from a career in Education to the field of IT and I had a few quick questions about certifications. First, let me introduce my situation. I have spent the last 6 years as a teacher and decided very recently (~1 month ago) to begin a career transition to IT. I have a B.S. in Secondary Ed and an MBA in Project Management. I am in my late 20s. I just took and passed my CompTIA IT Fundamentals certification test and am looking to get my Microsoft MTA in IT Infrastructure as my next objective. I am enrolling in an eight-quarter IT program (which will be reduced to 5 quarters due to previous credits), which will give me an Associate's degree in Networking Infrastructure Technology and several university-issued certificates (Desktop Support, Network Engineer, etc.). The quarter does not start until late September, so I was hoping to get a few certificates (or at least do some IT training) before school begins.", "My specific question mostly revolves around the Microsoft MTA tests. For 'IT Infrastructure', you only have to pass one out of five available tests (", "/en-us/learning/mta-it-infrastructure-certification.aspx). ", "1) Is there a scenario in which you would want to take and pass more than just one out of the five IT Infrastructure tests? Or would it be best to just take and pass one, get your MTA certification, and then move on to MCSA certifications in the field you desire? ", "2) If you take and pass multiple exams that qualify you for the MTA in IT Infrastructure, do you get multiple MTA certifications? ", "3) If I were to take and pass, for example, the 'Networking Fundamentals' exam, would my MTA Certificate reflect this choice (e.g. would my MTA certification say \"MTA in Networking Fundamentals\")? Being so new to the industry, I do not know exactly what career path in IT I want to follow, and I wouldn't want an exam that I choose today to come back and haunt me, so to say. If I went into Server Administration, I wouldn't want a potential employer to see the 'MTA in IT Infrastructure - Networking Fundamentals' and discount it because I chose to take the Networking Fundamentals test instead of the Server Administration test. ", "I really know very little about the IT job market/etc., and I welcome any and all advice from those that could help me at the start of this new career. ", "Thank you                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "How to change the order of input datasets in the Append Transformation in S", "content": ["\n                    I have to concatenate a dozen of tables with SAS Data integration Studio and I use the append transformation. After finishing the job, I discover the order matters and I should put the last input table first.", "Is there a way to do that, other than disconnecting them all, reconnecting them all and specifying the mappings again?", "Thank you                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "Coolest IT Jobs in 2018", "content": ["\n                    For IT pros willing to learn new skills, 2018 may be the best year to prepare for a fascinating AND high-paid job. ", "/en/resources/teksavvy-blog/2017/coolest-it-jobs-2018                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "IT Certifications", "content": ["\n                    Pursuing a certification is an investment of time and money. How can you know it’ll be worth it? ", "/en/resources/teksavvy-blog/2017/maximize-value-it-certification                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "Working in Australia", "content": ["\n                    Hi All!! Australian businesses are in massive need of specialized IT talent!", "I'm just wondering if anyone knows any skilled IT professionals who are willing to work and live in Australia??                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "What is seo", "content": ["\n                    i think seo..is a process is it correct...                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "5 Efficient Ways to Improve Customer Communication", "content": ["\n                    You don’t need to hire an expensive marketing consultant, or an expert to learn how to improve customer communications. These five simple yet powerful strategies would help you in improving customer communications with an ease.", "1. Make communication a priority", "2. Train your employees", "3. Learn to listen", "4. Optimize your templates", "5. Social Media                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "Importance of Project Charter document in Project management life cycle", "content": ["\n                    Do not underestimate the value of a project charter as just yet another management document. According to PMBOK® Guide it one must have documents in Project management. Project charter announces new project on the block in your organisation.                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "Need your views in regards to eCommerce software", "content": ["\n                    Been using Shopify for like 3 years now and have not looked back since then. I love the way it has been integrated with many other platforms. What eCommerce software do you use and what features do you like about it?                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "Education,  job prospects,  age issue?", "content": ["\n                    Hello,  new to the site.  But have a question.  I'm considering a B. S.  in IT Management.  Is the degree worth it to some one with little it experience?  To manage something shouldn't you have a thorough knowledge of it?  Yet the course description seems to only cover basics.  In addition..  I'm nearly 50 yrs old by the time I graduate..  Switching careers.  I do have an associate in networking.. But have sadly forgotten most of what I knew..                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "About to branch out in tech, no certs, need tips on first step", "content": ["\n                    I've been in retail management for too long just to tie up financial ends and working with faceless, grouchy, needy people by the daily thousands is my ****.", "I have an inclination,  a bit of a knack with computers, to the point where my family points it out to me daily. But this means nothing to me because they're baby boomers.", "So they say, the a+ cert is some key to the gates of the financial promised land, and its far from that simple. I've done my homework and searched for jobs on employment sites that feature \"A+ certification\" in their buzzword query, but often times requesting a bachelor's degree or 4 years equivalent. Im not going to spring on a certifcation that's going to get blown away by the winds of competition that fast, its idiocy to shell out close to 2000 for a framed wall or wallet decoration. ", "I am fiending to escape retail limbo, but I am on my last limb. I keep getting the shaft from these jobs, because I never wanted to work them in the first place and I have no financial tuition bequeathed to me from family. ", "My question boils down to, what can I do to sharpen my competitive edge? I've worked menial store-level management jobs, trace college hours (prerequisites finished)  half way to AA, but I attempted a 4 year university immediately out of HS and simply couldn't hack it financially. Don't want to funnel half my salary into loans, anyway. So unless a clean, average salary happens first, the Bachelor's can't happen at all.", "Just to clarify:", "What kind of certs would break that entry level barrier?", "What are some hands-on programs, such as internships that would help me to garnish that required experience? I know degree programs offer fertile opportunity for internships, but do certification programs offer anything at all?", "Are institutes such as ITT Tech feasible or overpriced?", "Where are some more sites for further info?", "To understand my ambition and help me select a cert to meet my long-term needs, my one year goal is to obtain my inital cert, 5 year goal is to establish my foundation salary and obtain the degree, and I don't see computers so much as the destination , but the vehicle . If I can approach meteorology or neurology from a technological angle I would have landed my dream job.", "Thank you very much for taking the time out to read my lengthy post. I hope I have supplied enough information for your appreciated answers.", "Thanks again :)                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "Which subject should I choose for my undergraduate study?", "content": ["\n                    I have the opportunity to study in Institute of Business Administration (IBA) or International Relations (IR) for my undergraduate study. Than what subject should I choose for my better & bright future???                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "DevOps vs Mainframe Programming", "content": ["\n                    Hi,", "Almost a year ago, my Department shifted focus from Development to become the Company's DevOps team. Therefore, my role changed from being a ruby/shell developer to a DevOps Specialist (with focus on both Continuous Integration and Continuous Deployment).", "Since we are still fairly new to DevOps concept at the company, while we have created a DevOps toolchain, I still have a long way to go learning the tools that were utilized by a Contract Employee to provide us with a industry-standard DevOps solution (JIRA/Bamboo/Jenkins/etc.).", "On the other hand, at my Company, I have been offered a Mainframe Developer role with another Department (not that I applied for it or expressed any interest in mainframes). The toolset that will be utilized is Cobol, JCL, and other standard mainframe technologies.", "I am hoping if somebody can guide me towards which one would be a better choice.", "I realize that DevOps is very much in-demand and mainframe skill-shortage is also a much discussed topic these days.", "I would appreciate advice that takes account of:", "- job market", "- anticipated future demand (5 years)", "- future of DevOps vs future of mainframes", "What confuses me:", "- Given that DevOps is a fairly new concept in IT industry, I don't know whether it is a concept that is here to stay or if there is unsustainable hype around it.", "- When I worked on mainframes (2009-2011), I found all of my mainframe colleagues very much avoided non-mainframe technologies while simulatenously being unsure and pessimistic about future of mainframes.", "- It seems, at least at my company, all code and applications that can be taken out of mainframes is being taken out of mainframes and that mainframes are only being used to store core-business logic that cannot be taken off without risk or for sensitive databases.", "- Outside of Banking/Insurance and some legacy hospitals/Government/Transportation IT, mainframes are no longer being used or are being phased out. On flip-side, DevOps can be found in all sorts of industry.                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "Help me with this PHP Script", "content": ["\n                    Hello !!", "Anyone know of a PHP script which would extract keywords from a URL? For example extracting \"What Time Live\" from the URL \"", "/\".                "], "from_forum": "employment_discussion"},
{"votes": "0", "title": "HDD won’t recover PDF Files", "content": ["\n                    Acrobat could not open __ filename ___  because it is either not a supported file type or because the file is damaged.", "I found some .pdf files doing a raw recovery from Ontrack and receive similar issues when trying to open these files (I tried to match some up based on file size.", "So far I haven't opened one file which makes me think the drive somehow scrambled all of the data. Any other recommendations?                "], "from_forum": "employment_discussion"}
]