[
{"votes": "0", "content": ["\n                    Hi,", "We have a company network spanning just over 40 sites and 5 countries.", "We have two web gateways and perimeter firewalls (with two content filters) for the whole IT estate. We generally lock down all inbound and outbound ports unless there is a business need for their use.", "Similarly, with web sites, we block access to any web categories which might present a threat to the company network.", "I would class 95% of our user base as non-IT orientated - they wouldn't know what \"Operating System\" they we were running, if asked (or indeed how to find out).", "Quite frequently, we get asked to allow access to TeamViewer and the many other similar services. The reason is usually to allow a third-party to assist one of our users with third-party software.", "This is something which we (as technical personnel) hate doing, due to the security implications.", "We have had instances of people (of dubious intent) calling our branches, stating that \"your IT department has asked me to update some software on your computer, please go to ", " and I will connect.\".", "No matter how much you try and educate your users, most of the time, they will just trust in what they are hearing, and allow these strangers to connect to the machines.", "The problem is, if we outright block all third-party remote access/assistance, then management will just overide our policy, stating \"we need it do business\".", "I am interested to hear what your security stance is when it comes to allowing your users to grant access to third-parties via such mediums.", "I would also love to hear your pros and cons for allowing or disallowing such access. Or, even, if you have found alternative solutions; such as only allowing third-parties in via pre-arranged VPN services.", "Thank you very much for your time.", "Best Regards,", "EJ                "], "title": "You stance on third party assistance/support tools?", "from_forum": "security"},
{"votes": "0", "content": ["\n                    i want to secure my website ", " from hackers and someone suggest me ssl certification for website. is it helpful for website?                "], "title": "Is SSL Certification for Website Help to Secure from Hackers?", "from_forum": "security"},
{"votes": "0", "content": ["\n                    Were you hit by WannaCry? There are some great lessons to be learned...", "/blog-not/2017/7/25/wannacry-post-mortem-lessons-for-msps                "], "title": "Post-mortem on WannaCry for MSPs", "from_forum": "security"},
{"votes": "1", "content": ["\n                    Hey all, I often use apps below on my smartphone:", "1.Social app: WeChat,Twitter,Facebook and Facebook Messenger, Instagram.", "2.Share+: Fast and safely transfer photos, videos, apps and documents. No need mobile data or Internet.", "3.Browser app: UC, Google", "4. Hootsuite: to manage my social networks!", "5. WhatsApp Messenger", "6. MixNote & Next, for daily memo, plan and remind!", "7. AppLock, privacy guard secure my personal data and apps.", "8. LONPIC: collage several photos into a long, skinny picture, just like those photos on Pinterest.", "Share your idea with me! Thanks!                "], "title": "What are some must have Android apps?", "from_forum": "security"},
{"votes": "0", "content": ["\n                    I just updated the transport certificate on Exchange Server 2010.  I have 2 Exchange servers and noticed this error message when going into the Server Configuration:  ", "\"The Exchange Certificate operation has failed with an exception.  The error message is: Access is denied.  It was running the command 'Get-ExchangeCertificate -Server 'Name'\"", "Does anyone have an idea why I would be getting this?  I am not really good with Exchange Administration but learning. ", "TIA                "], "title": "Get-ExchangeCertificate -ServerName in Exchange 2010", "from_forum": "security"},
{"votes": "0", "content": ["\n                    My complete data is lost and I want to recover it.Please suggest some solution as I don't have the recent back up?                "], "title": "How to recover lost volume on my windows 10 pc?", "from_forum": "security"},
{"votes": "0", "content": ["\n                    HI, we have subscribed an extensive back up plan with crashplan. ", "/en-us/", "They have now erase critical data because of one device inactivity, while the subscription was still being paid.", "These are very important data and despite us asking for restoration they responded that they are unable to restore this data now.", "Their response is as follow \"We strongly believe you shouldn't trust just a single provider or destination, even our cloud.\"", "We truly need this data back now. What would you recommend to do. Thank you very much!                "], "title": "Crashplan", "from_forum": "security"},
{"votes": "0", "content": ["\n                    The marketing department wants to use our primary domain name in a marketing email campaign via an online marketing software package.  This sounds like a bad idea and a risk at getting our domain blacklisted.  Anyone have any thoughts on this?  Should we use a different domain?  Perhaps a \"sent on behalf\" address, etc?                "], "title": "Blacklist potential", "from_forum": "security"},
{"votes": "0", "content": ["\n                    Two computers  have been compromised by the Cerber ransomware.", " AS an IT REP how do I  recovered the computers in detail from this Ransomware? and what can be  put in place to ensure that other machines on the network will not become compromised in the future.                "], "title": "Cerber ransomware Question", "from_forum": "security"},
{"votes": "0", "content": ["\n                    Do you know that there are two types of hackers?", "Black Hats, are hackers who use their skills for criminal activities. This is not a great option as the chances are you will end up in prison.", "White hats, are hackers with the same skills as Black Hats. But, they hack into systems that give them permission first to improve security and protect from criminal hackers.                "], "title": "Do you know that there are two types of hackers ?", "from_forum": "security"},
{"votes": "0", "content": ["\n                    Last week, my little son used my iPhone 6 to paly mobile games. Unfortunately, when he returned my iPhone to me, I find my whatsapp message has gone somehow, it's very important for me. Now, I want to recover them. Anyone has effective way? Thanks.                "], "title": "How can I retrieve my deleted whatsapp message?", "from_forum": "security"},
{"votes": "0", "content": ["\n                    Hey.. I hope someone here can help us with a good advice. Our company website- employee section has been restricted to access using login verification method for the authentication. The working is simple. A login notification with a verification code will be sent to the user mobile and once it's verified, they will be granted the access. ", "This section had some issue with company management when a group of ethical hackers successfully broke the authentication and accessed the restricted area. Data was safe, but a serious security glitch was exposed. ", "We approached a cyber security company named NCI, and they mentioned about using two factor authentication to protect from hacking and possible malware and spyware attacks ( ", "/what-can-you-do-to-protect-yourself-from-spyware-malware-and-ransomware/ ). What else can we implement in our website to make it more secure? I hope someone can give a proper advice on this.                "], "title": "Website Authentication issues", "from_forum": "security"},
{"votes": "0", "content": ["\n                    I administer the network for the small municipality where we live. The Board has decided to upgrade all the hardware. Fortunately, it's a small, straightforward proposition: One server, three PCs, and three printers. SBS 2011 Essentials on the server, Windows 10 Pro on the PCs. ", "The main difference is that they want wireless access. Up to now I've made do with the router's firewall. We haven't had any issues mostly because this is a community of about 3300 residents evenly split between young families and seniors. ", "There is a small core group of \"haters\" that has issues (mostly irrational) with the current administration. None of them are likely to stoop to hacking but I'd rather not count on that being a guarantee for the future. ", "Being that there are only two full-time users as well as the 5 member, part-time Board of Trustees who have access to the system, is a dedicated firewall necessary or am I relatively safe sticking with the router? ", "Thanks!                "], "title": "Do I need a dedicated firewall", "from_forum": "security"},
{"votes": "0", "content": ["\n                    So, basically, my friends in Russia are experiencing a local turmoil. The government wants to ban Telegram — one of the best messengers in my opinion — and people want to avoid it at all costs. They consider using VPN. I understand that most will look at lists like that ", "/ and use whatever they find attractive. But I'm interested in what you think about that? What is the best way to ensure private and secure messaging?", "Thanks.                "], "title": "Privacy for messenger", "from_forum": "security"},
{"votes": "0", "content": ["\n                    Why does a security resource publication such as TechRepublic still use Flash videos??                "], "title": "techrepublic's use of flash video", "from_forum": "security"},
{"votes": "0", "content": ["\n                    Hello all,", "I've developed a quick 5-minute ransomware readiness assessment based on brainstorming with a couple dozen of my closest infosec advisors. Take a look and tell me what you think:", "/ransomware-readiness-assessment                "], "title": "Ransomware readiness assessment...", "from_forum": "security"},
{"votes": "0", "content": ["\n                    Hello all,", "I have a trouble while I have meeting with my customers, all of them try to record all sound while we have meeting.", "So I want to know what devices? that can making noise to all sound recorder, i mean I want to protect face to face meeting sound from recording device?", "Thanks                "], "title": "I want to know device for making noise while I have secret meeting", "from_forum": "security"},
{"votes": "0", "content": ["\n                    I switched to nordvpn some months back (W10 64-bit PC). Since then, any attempt to connect to a techrepublic web page produces an error message that I am not connected to the Internet (ADSL2+/ethernet) even though other web pages work perfectly. It makes no difference whether I am tunneling in from the UK (where I live) or the US. Has anyone else encountered/overcome this problem?                "], "title": "Why does techrepublic block nordvpn?", "from_forum": "security"},
{"votes": "0", "content": ["\n                    I received an email from Techrepublic that looked genuine", "/wp-content/uploads/2017/09/tech-repub-hoak.png", "Should I be worried my email is compromised?                "], "title": "Tech Repub Hoax?", "from_forum": "security"},
{"votes": "0", "content": ["\n                    Yahoo says all 3 billion accounts hit by 2013 hack. If you have a Yahoo account, are you concerned? Are you taken measures to protect yourself?", "TechRepublic explains how to protect yourself:", "/article/all-of-yahoos-3b-accounts-were-hacked-back-in-2013-heres-how-to-protect-yourself/", "Let's hear your thoughts on this hack?                "], "title": "Do you have a Yahoo account? Are you concerned about the hack?", "from_forum": "security"},
{"votes": "0", "content": ["\n                    Hello!", "I am checking if my PC has any malware/spyware.", "I have 3 Q for now. I would really appreciate your advice as I have reason to believe my PC is hacked and being spied on.", "Among other checks and Q i have, I would like to ask how one checks if the background processes running in task manager are not viruses. I googled all of them and it seems they are legit, and I think most are located within system 32. Does that mean they can;t be viruses with a name of a legit program?", "When I try to download a program that checks such background processes, it starts to download in the lower left corner of my screen, but when it;s done(quickly) it is ''white'' and nth open when I click on it. (pardon my lack of tech language or language in general ", ")", "My second Q is how do I download a TCP viewer to check my outbound ports? The same happens. Nth opens when I click on the white file in the lower left corner of the screen. Same happens when I try to download process explorer.", "My third Q is if I disabled the camera and internal mic on my laptop, does this mean if I had spyware that used it, would it still be able to listen in? ", "and how do you disable cam and mic fully to make sure they can't be used? ", "In system sounds---recording it says: No audio devices installed.", "Under imaging devices in device manager i uninstalled the camera but not that I looked, it was there again so I uninstalled it again.", "And I think I uninstalled the YouCam app or sth", "Thanks a lot!", "M                "], "title": "How do I check which background processes are legit? ...", "from_forum": "security"},
{"votes": "0", "content": ["\n                    I need to find an app which allows to see incoming calls and location of other person's smartphone? I want to know where my child is 24/7.                "], "title": "Is there any app that can track another smartphone?", "from_forum": "security"}
]