[
{"votes": "0", "title": "React On Rails – part 1 [tutorial]", "content": ["\n                    Let us know your thoughts.", "/blog/react-rails-part-1-tutorial/                "], "from_forum": "web_development"},
{"votes": "0", "title": "How to make The News and last episodes section with PHP", "content": ["\n                    I'am not very experienced  at web development. I know html and css but i am very new at php. I am making a web site for my fansub(anime translation group) i made the css and html part but i got many problems with php part. How can i make a last news and last episodes section which show the lastest episodes or news automatically.                "], "from_forum": "web_development"},
{"votes": "0", "title": "about codeigniter url", "content": ["\n                    hi i have a problem .my CodeIgniter template cant support utf8 in it url ", "when i search a persian word not find any thing and this word ", "Ù\u0081Ø§Ø±Ø³Û\u008c", "find in url ", "permitted cahrs is =>", "$config['permitted_uri_chars'] = 'a-z 0-9~%.:_\\-';", "and i changed it but dont have any benefit                "], "from_forum": "web_development"},
{"votes": "0", "title": "Web Development Company", "content": ["\n                    I want to create a new website, can any one help me with the website development company?                "], "from_forum": "web_development"},
{"votes": "0", "title": "How to Connect multiple database in WordPress?", "content": ["\n                    Hi everyone, I have been working on a project related to php development and want to know your views on connecting multiple database in a WordPress. I am also very curious about various other php questions and answers because I also got stuck in some coding issues, that is why I am looking for such a platform where the evolving community can help me to resolve my queries here ", "/e1Q5kv                "], "from_forum": "web_development"},
{"votes": "0", "title": "Apache web server", "content": ["\n                    I did this for my client's project which had the issue of returning error pages e.g., 404 not found, i had to turned off the server signature as it was a great security risk as you are essentially telling attackers known vulnerabilities of your system therefore it is  recommended for you to disable all web server signatures as part of server hardening process. Apache web server is worlds most used server as it works on all os and compatible with all languages like Perl, Python, Tcl, and PHP( the one My client's website ", " is in php).                "], "from_forum": "web_development"},
{"votes": "0", "title": "Web Hosting", "content": ["\n                    Hello,", "I am little bit confused to choose which web hosting ??", "I want unlimited MSSql & Mysql Database with PHP & .Net Development ?", "Can anyone please help me with this matter please ?                "], "from_forum": "web_development"},
{"votes": "0", "title": "connections in WordPress website", "content": ["\n                    I have a website, kindly put together from an older one by a friend I do not wish to trouble more. You can see it at ", ", where you will notice a table at the left with references to various pages. Some of these pages, including Stories, themselves have lists referring the visitor to further pages. Two of the stories, \"Osama at Heaven's Gate\" and \"The Vixen and the Grapes\" are referenced both in the Stories page and in the start page. I would like to remove the references from the start page while leaving them in the Stories page. Something is missing in my grasp of WordPress, and I am not able to achieve this. What should I do?                "], "from_forum": "web_development"},
{"votes": "0", "title": "Product Configurator Software Solution", "content": ["\n                    WebiProg company develop web tools for configuring and customizing products and services for e-commerce solutions like Magento, WordPress/WooCommerce, Shopware, OpenCart etc. Such web applications (or web customization tools) increases the conversion and customer satisfaction, and also improves the behavioral factors of website, which contributes to a better indexing at search engines.", "Today, many web studios offer services for web development of business websites, corporate websites or online stores. But if you need a complex web-system, the amount of web-studios that can undertake such a task and bring it to the end is greatly narrowed.", "Historically, we often got projects where we should develop individual web solutions and web applications. Basically, it was about to develop product configurators where the end users could customize their products. That's why we pay special attention to the development of the configurator for the site.", "It does not matter in which area you work. Online configurators can be used on websites of various kinds and specializations. For example you sell accessories to mobile phones and would like to allow your clients to customize products. If the prices of your products or services can not be specified in the price list, the online configurator on your site is the most optimal option for simplifying your business life.", "Details on the site ", " in the news line.                "], "from_forum": "web_development"},
{"votes": "0", "title": "Need Help With Checkout Page", "content": ["\n                    I want to set up a checkout page where the user can choose a product that they want to buy and fill out a form relating to the product and once done filling out the form it would lead you to pay for the product while also sending the information they filled out through an e-mail to me. Is it possible to do this without programming it onto my website?                "], "from_forum": "web_development"},
{"votes": "0", "title": "Access Subform Data export to Word", "content": ["\n                    Hi!", "I really some help! Here's a link to a google drive zip of the db.", "/file/d/0BwjnhQS2X7_Qamt4clFLc1Ztb2c/view?usp=sharing", "So, what I have is an access database made up of a few tables and a form and some sub forms. The database info gets inputted to the tables via a form that I've created. In the example, the form is called \"Database\". This form exports to a word document, fields on the database go to bookmarks on the word doc. This works great so far. ", "In the attachment there is a \"template\" folder with the original word document, when the code runs it saves the completed form to the \"generated\" folder - works like a charm. Its a very long form for applications for liquor licenses. ", "So you fill in the form in access, it saves to the tables and exports the data to the word template document. ", "The problem that I have is that there is a subform on tab8 of the form where \"director details\" are saved. There can be any number of directors per application. I've managed to access the data on the subform's table, but have no idea how to loop through the data in that table to get all the information that is applicable to that application only and not data related to other applications. There is a relationship between the director details table and the application details table(this is the main table) and I'm using an application identifier field that I've created called and \"ACNumber\" which is unique to each application. There is a combobox on the form that selects the application and the form and subforms bring up the correct data when you select it.", "The other part of the problem is how do I output this to word? A bookmark won't work, because all the fields are being repeated. Is there a way that all the data entries can be outputted to a single bookmark mabe in a textbox with the labels?", "This is how it looks on the word document form:", "(First person)  ", "Full name\t\t        :  [ generate from item 5.4(a) from database]", "Physical address\t:  [ generate from item 5.4(b) from database]", "Postal code\t        :  [ generate from item 5.4(c) from database]", "Postal address \t:  [ generate from item 5.4(d) from database]", "Postal code\t\t:  [ generate from item 5.4(e) from database]", "Identity number \t:  [ generate from item 5.4(f) from database]", "(More person’s to add if needed)      ", "Ok, I hope that describes my problem accurately.", "I've tried all sorts to get this working, but its beyond me, please help guys!!!                "], "from_forum": "web_development"},
{"votes": "0", "title": "I'm looking for a software similar to Python virtualenv", "content": ["\n                    I started learning Node.js a couple of weeks ago. I would like to have an opportunity to create isolated programming environments for my node projects. For example I would like to", "1) Run different versions of Node on my machine, and I have an opportunity to work with projects that use different versions of Node.", "2) Use different versions of node packages in different projects.", "I have all those opportunities when working in Python. What do you use when working with Node.js?", "Thank you in advance for all the answers!                "], "from_forum": "web_development"},
{"votes": "0", "title": "Client based branding of SaaS web application", "content": ["\n                    Hi,", "I am developing a SaaS based web application. My requirement is that all my users can have custom look-n-feel of the application.", "Are there some standard tools to implement this.", "I know I can write server side code or use javascript to update CSS and Images during page access. But is there anything I can use off the shelf?", "If this question has already been asked, please point me to it.", "Thanks.                "], "from_forum": "web_development"},
{"votes": "0", "title": "web development", "content": ["\n                    I am looking for a solution for stopping spam getting through my website form. My website completely  design and devolve in  HTML and also used Jquery.  Please suggest me solution for this problem.                "], "from_forum": "web_development"},
{"votes": "0", "title": "Php vs .Net", "content": ["\n                    Why mostly people go for PHP instead of .Net.  And which platform is on high priority.                "], "from_forum": "web_development"},
{"votes": "0", "title": "Filter Code Goes On Which Line ?", "content": ["\n                    Folks,", "The following code is cURL script fetching a page and filtering it's content for banned words.", "Where on Mini Proxy, on which line, would I add the banned words filter code (the code which you see below or something like it) so that, when banned words are found on the proxied pages, then the banned words are substituted by the proxy ?", "Mini Proxy is here:", "/joshdick/miniProxy", "Filter Code:", "                "], "from_forum": "web_development"},
{"votes": "0", "title": "Programming", "content": ["\n                    Which programming language is best for building a system that has a feature of  booking appointment? Thank you                "], "from_forum": "web_development"},
{"votes": "0", "title": "Website Development Company", "content": ["\n                    Hello there, ", "I just created a new website in Wordpress format. But I am facing lots of problems while setting up and hosting this on the online server. Then I just visit a new website development site named ", "/ and I found various information regarding website designing. If you want to know more details about web development procedure, visit here :                "], "from_forum": "web_development"},
{"votes": "0", "title": "How to change logo in magento?", "content": ["\n                    Hi i am new for magento and using magento 1.5, i am trying to change logo in my website. but its not changed anyone can give suggestions about this.                "], "from_forum": "web_development"},
{"votes": "0", "title": "website design company in delhi", "content": ["\n                    We are egainz.com a web deisgn company based in delhi looking for web developerin magento                "], "from_forum": "web_development"},
{"votes": "1", "title": "Get Registered IELTS certificates without attending the Exam(jamesnigel6", "content": ["\n                    Get Registered IELTS certificates without attending the Exam(", ")", " We sell registered IELTS & TOEFL, ESOL, and CELTA/DELTA and other English Language ", "Please note that we offer two types of IELTS & TOEFL Validation &", "Verification services depending on your needs.", "Please note that all IELTS & TOEFL certificates etc", "Buy a TOEFL or IELTS fully Verified by Accredited University", "BUY IELTS CERTIFICATES- scores", "IELTS Certificate.Without attending the Exam", "IELTS, or IELTS certificate is an important step in your education!", "buy International English Language Testing System(IELTS)", "What is IELTS?", "IELTS stands for “International English Language Testing System”.", "It’s a system for testing the language ability for people who need to", "study or work in", "an environment where English is the language of communication. It is", "jointly managed by Cambridge English Language Assessment, the British", "Council and IDP", "Education.  It was established in 1989 and is one of the two major", "English-language tests in the world (TOEFL being the other).", "IELTS is accepted by most British, Canadian, Australian, Irish, New", "Zealand and South African academic institutions.  Over 3,000 academic", "institutions", "in the United States and various professional organisations across the", "world also accept IELTS. It is now a requirement for people wishing to", "immigrate to", "Australia and New Zealand and is also accepted by immigration", "authorities in Canada", "IELTS certificate for sale  buy orginal ielts certificate", "and other products for a number of countries like: USA, Australia,", "Belgium, Brazil, Norway", "Canada, Italy, Finland, France, Germany, Israel, Mexico, Netherlands,", "South Africa, Spain, United Kingdom.", "This list is not complete.", "buy orginal ielts certificate For more information and ordering simply", "contact us by email.", "BUY IELTS certificate for sale  BUY IELTS CERTIFICATES (United", "Kingdom), AMERICAN, CANADIAN", "The IELTS Specialists", "7+ Band Score in IELTS - Is Achievable When You Score in Simple Process", "Buy Orginal IELTS no need to appear in exam easy process you get", "result with 3 weeks .", "Best Ielts Online Score.No Need to  Attend The Exam.", "For anyone wishing to pursue higher education abroad or migrate,", "knowledge of English is absolutely indispensable. International", "English Language Testing System or IELTS as it is known is an", "internationally recognized method of testing capabilities of people", "from countries where English is not t                "], "from_forum": "web_development"},
{"votes": "0", "title": "If traffic to my site grows, how can hosting scale with my needs?", "content": ["\n                    In Holiday season my store traffic behavior changes rapidly, How can be a hosting provider can help me to care about this sudden change.                "], "from_forum": "web_development"},
{"votes": "1", "title": "I'm looking to hire PSD to WordPress Conversion Service Providers", "content": ["\n                    Can anyone recommend some good wordpress service providers?                "], "from_forum": "web_development"},
{"votes": "0", "title": "Seo", "content": ["\n                    What is the actual strategy of seo??                "], "from_forum": "web_development"},
{"votes": "0", "title": "What is a MySQL database?", "content": ["\n                    What is a MySQL database?And how to ues it? Which server can apply it? I came across .vpb.com and found out that  they  are  providing  server  with all  needed features for me. does anyone have personal experience with them?                "], "from_forum": "web_development"}
]