[
{"url": "https://www.python.org/jobs/2916/", "loc": "Joinville, Santa Catarina, Brasil", "title": "Desenvolvedor FullStack Python", "job_type": ["Back end", "Front end", "Web", "Developer / Engineer"], "descrip": ["Suas responsabilidades serão:\n- Desenvolver nossa arquitetura BackEnd\n- Garantir a qualidade do código com testes automatizados\n- Garantir o desempenho da API JetBov utilizando as melhores práticas de código e infraestrutura\n- Otimizar a utilização de banco de dados e a velocidade das pesquisas\n- Capaz de analisar problemas em equipe e propor soluções, usando bons argumentos.", "Benefícios:\n- Vale Transporte\n- Vale Refeição ou Alimentação\n- Plano de Saúde\n- Salário digno e compatível com as suas responsabilidades\n- Flexibilidade de horário\n- Ambiente de trabalho ágil e informal\n- Fazer parte na transformação da forma que a carne é produzida no Brasil\n- Morar em uma cidade com ótima qualidade de vida", "Requisitos Mínimos:\n- Domínio de Python, Django - ou capacidade para aprender e tornar-se produtivo rapidamente;\n- Boas habilidades de comunicação, indispensáveis para o trabalho em equipe;\n- Lógica para solução de problemas;\n- Curiosidade e vontade de aprender novas ferramentas, plataformas e tecnologias;\n- Domínio e conhecimento sobre testes automatizados;\n- Residir em Joinville-SC ou disponibilidade para se mudar para a cidade.", "Requisitos diferenciais:\n- Inglês técnico nível intermediário.\n- Experiência prévia com linguagem Python.\n- Experiência prévia com arquitetura REST, para criação de APIs, Django Rest Framework\n- Tecnologias de FrontEnd(CSS, HTML e JavaScript)\n- Angular\n- Conhecimento em design e arquitetura de software: Domain-Driven, TDD, Design Patterns.\n- Experiência prévia com Amazon Web Services\n- Conhecimento em técnicas de CI/CD\n- Envolvimento em projetos open-source.\n- Perfil ativo no GitHub.", "Somos uma startup que busca integrar a cadeia da produção pecuária, permitindo uma produção de carne com qualidade e sustentabilidade. Ajudamos o controle do gado e gestão da fazenda sem complicação. Levamos inteligência e tecnologia em gestão para a cadeia produtiva da carne.\nwww.jetbov.com"]},
{"url": "https://www.python.org/jobs/2889/", "loc": "New York, NY, United States", "title": "Lead Python 3/Django Developer (3mo Contract)", "job_type": ["Back end", "Database", "Lead", "Systems", "Testing", "Web", "Developer / Engineer"], "descrip": ["Croscon is seeking a Django Python developer to join our team as we build out a total greenfield insurance enterprise SaaS product. The end result product with be a fully REST API built in Python (Django) + PostgreSQL. The API will be consumed by a frontend written in ReactJS and Redux (separate team).", "Eligible candidates will have considerable experience in building and launching enterprise apps are self-starting and can meet aggressive deadline targets. This is a great opportunity for an experienced senior engineer to work remotely on a new product (must overlap EST by 3-5 hours per day).", "Strong possibility of an ongoing relationship beyond this project for the right candidate.", "To learn more about our clients and our business, please visit our website @ croscon.com.", "NO RECRUITERS. If you try to find a way to contact me, or anyone on my team I will come and find you and take away your internet. Sorry guys, it's not us, it's you.", "Benefits:\n$7-9k/mo", "Croscon plans, builds, and grows the digital products and services that help companies become leaders in their industry."]},
{"url": "https://www.python.org/jobs/2891/", "loc": "Lake Oswego, Oregon, USA", "title": "Back-End Insights Engineer", "job_type": ["Back end", "Developer / Engineer"], "descrip": ["Cinder is looking for a Back-End Insights Engineer to fill a role for our clients in Lake Oswego, OR. This is a full time, 40 hour per week opportunity with a full benefits package that includes PTO!", "We’ve got our eye out for a developer who is eager to solve problems, collaborate with team members, and work in a DevOps-supported, continuous deployment environment. We are looking for candidates who have a deep knowledge of multiple programming languages, particularly those that comprise our stack: Python, Go and JavaScript. Ideally, you are a fellow Pythonista/Gopher who has a passion for clean, well-tested and expressive code.", "Currently, we are seeking someone who can dive into our Python codebase managed by our “Insights” guild, which helps bridge the gap between our Data Sciences and Engineering teams. Our teams work to build new services & features in modern apps using experience gained from previously developed legacy apps. We practice collaboration, UX prototyping, test-driven CI, and pull request code reviews (ticket tracking, acceptance testing, etc.) to produce high-quality code and continue to learn and improve the system", "Job Duties may include but are not limited to:", "Contribute ideas, research, and knowledge to the team to increase skills for self and the team at large", "Develop programmatic solutions to business problems and ability to automate business processes", "Take ownership of functionality from development through deployment.", "Be ready to learn new languages, tools, and systems quickly, and be able to communicate challenges and ask for help regularly", "Deploy quality code, write tests, and learn from mistakes to build a better system and improve your skills", "Work with Product Owners, Business Analysts and other Developers to estimate, size, and scope of work", "Required Skills:", "3+ years experience in Python, Go and Javascript application development.", "5+ years working in a team environment as a programmer, preferably in a back-end role", "Ability to learn and understand the media buying process and business goals in order to develop intelligent solutions for users and clients", "Experience using distributed code repositories (git, Mercurial) in a team environment or a large open source project", "Prior experience supporting multiple browsers, operating systems and devices", "Preferred Skills:", "Experience in Ruby, MySQL or frameworks like React.", "Prior development on a service-oriented / microservice architecture", "Prior development of REST APIs", "Prior experience with Python frameworks like Flask or aiohttp", "Prior experience with PostgreSQL, PostGIS and Elasticsearch", "Prior experience with Mapbox GL JS or similar map rendering tech", "Established gibhub account with coding examples/projects", "Our client is a up and coming Ad Tech company looking to challenge stagnant culture in programming. They are highly focused on excellent culture and great benefits to attract the best engineers."]},
{"url": "https://www.python.org/jobs/2892/", "loc": "Dallas, Texas, USA", "title": "Scientific Programmer", "job_type": ["Back end", "Front end", "Integration", "Numeric processing", "Operations", "Testing", "Developer / Engineer"], "descrip": ["Dr. Russell Stoneback at the William B. Hanson Center for Space Sciences (CSS) is seeking a scientific programmer to support research activities in two broad areas, satellite based measurements of the ionosphere and the development of novel musical instruments. Over the next 12 months 8 spacecraft will be launched with instruments designed and managed at the CSS. Measurements performed by these instruments will be reduced into relevant geophysical parameters using new Python software built by Dr. Stoneback. Ionospheric measurements from these and other platforms need to be integrated in near real time as part of a local space weather center based upon the Python Satellite Data Analysis Toolkit (pysat), ", ", and other tools as needed.", "Dr. Stoneback is also pursuing the development of novel musical instruments (", ") that require development of audio plugins to run in Logic Pro and Garageband on MacOS systems.", "Bachelor’s degree in computer science, mathematics, physics or related title", "Desireable Experience", "The William B. Hanson Center for Space Sciences (CSS) is a part of the University of Texas at Dallas. Founded in the 1960s, the CSS has developed spaceflight hardware for a variety of missions to study the space environment.  Most recently, the CSS developed the Ion Velocity Meters that will fly on the upcoming NASA Ionospheric Connection Explorer (", " ", ") and the NOAA/NSPO COSMIC-2 constellation."]},
{"url": "https://www.python.org/jobs/2851/", "loc": "Munich, Bavaria, Germany", "title": "Junior Full Stack Developer", "job_type": ["Back end", "Database", "Integration", "Testing", "Developer / Engineer"], "descrip": ["We are looking for a code enthusiast who is interested in further optimizing and automating the technical integration of our partner shops through developing new features for our business teams. We’re a fashion company but you won’t have to wear the latest Karl Lagerfeld. A hoodie or your favorite Docker shirt will do just fine. If delivering high quality software is your number one priority - then Stylight is your place to be.", "Your Responsibilities", "Our Tech Stack", "Your Profile", "Why Join Stylight?"]},
{"url": "https://www.python.org/jobs/2841/", "loc": "San Antonio, Texas, United States", "title": "Python Developer", "job_type": ["Front end", "Developer / Engineer"], "descrip": ["Python Developer - Software Tool Developer.  Creates software-based Cyber prototype tools that enhance cyber warfighter capability.", "Duties:", "Designs, codes, tests, debugs, and documents. Develop software based on pre-defined set of requirements into production grade software in accordance with industry best practices and secure coding methodologies. Tasks includes identification of objectives, requirements, system design, system/software development, testing, upgrades, and training needed for deployment and installation of the software; and updates to requirements reflecting feedback from any technical interchange meetings and testing and evaluation activities. Support to, at least, five simultaneous development efforts. Examples of developed software include: exploits, implants, payloads, countermeasures, proof-of-concept, plug-ins, and scripts.", "Analyze, enhance, and demonstrate prototype exploits that serve as proof-of-concept for discovered or acquired vulnerabilities that can be exploited. Refine proofs-of-concept and demonstration code based on pre-defined set of requirements into production grade software in accordance with industry best practices and secure coding methodologies.", "Qualifications:", "•Active government clearance, or have eligibility", "•Coding languages (C, C++, Java, C#)", "•Scripting languages (Python, PowerShell, etc.)", "•Network Analysis (Wireshark)", "•BA/BS degree or equivalent experience", "•4 years Agile software development experience and/or CSDP", "Physical Demands:", "The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.", "While performing the duties of this job, the employee is regularly required to sit; use hands to fingers, handle, or feel and talk or hear. The employee is frequently required to reach with hands and arms. The employee is occasionally required to stand; walk; climb or balance; stoop, kneel, crouch, or crawl and taste or smell.", "The employee must regularly lift and/or move up to 10 pounds, frequently lift and/or move up to 25 pounds and occasionally lift and/or move up to 50 pounds.", "Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus.", "Work Environment:", "The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.", "Charles Todd", "Python Developer skills", "Company History", "Founded in 2000 in San Antonio, Texas, IPSecure originally operated into the world of software development. The company soon evolved to include Telecommunication and Computer Security with the goal to provide aggressive security and Information Assurance support to all of our customers. Through many years of success, our company has grown to include computer network attack/defense/exploitation of government and commercial networks while continuing to provide unsurpassed customer service to our clients."]},
{"url": "https://www.python.org/jobs/2842/", "loc": "San Francisco, United States", "title": "Backend Engineer", "job_type": ["Back end", "Big Data", "Database", "Finance", "Systems", "Developer / Engineer"], "descrip": ["As an early-stage company, we have many projects and tasks that you can take on, depending on your preferred area of focus. Broadly, we offer the following areas of work:", "This is a generalist’s role, though it is possible to focus on an area of your interest. You will join our 4-person engineering team and work closely with our product design team. As such, this role comes with a significant amount of autonomy and responsibility. You should enjoy the challenge of building large, scalable infrastructural components from the ground up.", "We don’t expect you to be an expert in our entire stack, but we expect general familiarity with:", "Bonuses:", "Coalition is working to solve cyber risk. Perfect security is impossible, so businesses need a mechanism to stay resilient against a growing number of cyber threats. We are a small, well-funded team of security experts, insurance professionals, and intelligence community veterans building a better cyber insurance product. Coalition is automating risk assessment to remove obstacles to purchasing the right insurance against this peril. We are also constantly monitoring and educating our customers about different threats and how to mitigate them. And, for the unavoidable incidents, we’re helping our customers bounce back with a superior claims process."]},
{"url": "https://www.python.org/jobs/2850/", "loc": "Remote, Remote, United States", "title": "Software Engineer / DevOps", "job_type": ["Back end", "Database", "Finance", "Integration", "Lead", "Operations", "Systems", "Developer / Engineer"], "descrip": ["We’re a small investment firm in New York, run by two quants. Even though we’ve been trading stocks successfully since 2012, we have never hired anybody to help – we have done all the strategy, trading, and technology ourselves. Our focus is on the investment strategy, but we are good coders and have built a solid infrastructure for a two-man operation.", "Now it’s time to take off, and we’re hiring a small team to expand the business.", "Here’s where you come in—", "We need a top notch tech guru to handle the entire tech infrastructure of our firm as we expand. Think of it as a one-man CTO type role – you will report directly to the founders. You’d have a wide range of skills (enterprise IT admin, app dev) and be managing everything infrastructure-related from top to bottom – from finding the right enterprise solutions as we expand, to extending our Python quantitative backend, to managing databases, networks and permissions. At least initially, you will be the only person on our team focused on tech full-time (i.e. not a managerial role).", "Our culture is casual with a start-up feel. We care deeply about efficiency and robust tech, but not how you choose to manage your schedule. We care about our lifestyles but don’t want to dictate yours. You’ll be working remotely but will have constant access to the founders, who will give you feedback and growth.", "Some examples of projects you might do:", "Ideal candidate would have:", "We are a small quantitative investment firm focused on trading equities globally. The firm consists of two partners, and since 2012 when we co-founded the firm together in New York we have been building all the technology that supports our analysis and automation ourselves."]},
{"url": "https://www.python.org/jobs/2885/", "loc": "Christchurch, Canterbury, New Zealand", "title": "Software Developer", "job_type": ["Back end", "Big Data", "Database", "Evangelism", "Front end", "Image Processing", "Machine Learning", "Numeric processing", "Operations", "Systems", "Web", "Developer / Engineer"], "descrip": ["We’re looking for a developer to help us to rid New Zealand of invasive predators. We're a small team with big ambitions. This is challenging, varied and fun role - you can expect to be dealing with embedded, backend and frontend systems using Python and a variety of other technologies and languages. There's scope for machine learning (using TensorFlow) and computer vision work too if that interests you.", "We’re happy to consider junior, intermediate or senior candidates. Finding someone who fits the project well is more important to us than years of experience. The role is permanent and home based (we have no office). Candidates ", " and ", ".", "Candidates should have the following essential skills and attributes:", "Experience with any of the following areas are highly desirable:", "The Cacophony Project brings a technological approach to the problem of New Zealand's invasive predators which are having a major impact on native bird populations. The project has two high-level aspects:", "We believe our approach has the potential to be vastly more effective than the measures currently in use to manage invasive predators.", "The project is being run in a completely open source manner. Anyone is able to see what we're doing, contribute improvements or build something else from it. We have a core team of full time engineers and numerous external contributors and advisors.", "You can find out more about the project at ", "."]},
{"url": "https://www.python.org/jobs/2845/", "loc": "London, UK", "title": "Senior Python Developer", "job_type": ["Back end", "Cloud", "Database", "Developer / Engineer"], "descrip": ["Here at CrowdScores we have a fantastic team of people working on a product used by more than 1 million football fans monthly. Established for over three years, but retaining a friendly startup culture, our aim is to create the best football community in the world and we need to grow our backend team to achieve this.\nWe offer flexibility in where and how you work, what we care about is what you deliver. We regularly create substantial new features alongside dealing with significant scaling challenges as CrowdScores and our userbase continues to grow.", "In our backend team you will:", "Working with us, you will:", "To apply for this role please email your CV and cover letter to ", ".", "The person we are looking for:"]},
{"url": "https://www.python.org/jobs/2888/", "loc": "Gdynia, Pomeranian, Poland", "title": "Python Developer - Internship", "job_type": ["Back end", "Web", "Developer / Engineer"], "descrip": ["We offer:", "More about us:", "Check devs reviews:", "More about us:"]},
{"url": "https://www.python.org/jobs/2895/", "loc": "Berkeley, CA, USA", "title": "QA Engineer", "job_type": ["Testing", "Developer / Engineer"], "descrip": ["Bonsai’s Automation and QA team is looking for a talented programmer, creative software-breaker, and passionate tester, to maintain Bonsai’s high standard of software quality and help the engineering team go faster without breaking things.", "As the champion for software quality and correctness, you’ll work with all areas of Engineering and AI, as well as Product and Customer Success, to consult on and create test plans, manage our CI infrastructure, build tools to make testing easier company-wide, and implement black-box tests that exercise our platform end-to-end.", "RESPONSIBILITIES", "Work with Engineering teams, including Backend, Compiler, Web, and AI, to design and implement test plans for features that span multiple teams.", "Design and implement tools that enable Bonsai developers to more quickly create tests that can be seamlessly automated.", "Provision and manage test automation and continuous integration systems.", "Create reports detailing test failures, test coverage, and system performance.", "A passion for software quality.", "At least 2-3 years of industry experience as a Software Developer Engineer in Test or similar.", "Proficiency with a general purpose language like Python or C++, plus experience with a test framework in that language.", "Experience with Jenkins or a similar Continuous Integration tool.", "Demonstrated experience working collaboratively with teams of developers.", "Bonsai brings together state of the art techniques in machine teaching and machine learning, enabling enterprises to more effectively program and manage AI models"]},
{"url": "https://www.python.org/jobs/2896/", "loc": "Sydney, NSW, Australia", "title": "Software Engineer (Python/Django)", "job_type": ["Developer / Engineer"], "descrip": ["Mathspace (mathspace.co) is searching for talented Python developers at various levels of experience to join us in sunny Sydney, Australia over the next few months. Sponsorship/work visa can be provided if needed.", "You'll be working directly with the founders and be given every opportunity to build on your already outstanding Python/Django and database skills to build a scalable adaptive learning algorithm.", "Only a few people actually get an opportunity to make a difference. Fewer people, still, have the drive to do it. Out of those few we’re looking for the best.", "The role will involve anything and everything back-end with a strong focus on our StepSmart Mathematical engine and our Adaptive Learning Algorithm. Imagine a world where every student gets delivered a learning experience based on their ability, their learning style and their progress. With our back-end step-by-step approach we have the opportunity to do this like no one has done it before and we need you to help put this in place.", "What you will need:\nPython 3\nDjango\nGit/GitHub\nPostgreSQL", "Bonus Points if you have:\nSympy\nScikit-learn\nAWS\nDjango REST Framework\nRedis\nJavaScript/ReactJS\nHTML/CSS\nMathematics background", "We're a global technology leader in personalised maths education and you will join a dedicated, high performing team, changing the way students learn Maths in Australia and around the world. Casual and inspired, our company culture puts everyone in control of shaping our product - if you have a great idea and want to see it done, then all you have to do is DO IT.", "What we offer:", "The opportunity to use cutting edge technology to transform Mathematics education and make an impact\n", "Flat hierarchy / management structure\n", "Bright and open Surry Hills office near Central Station, surrounded by great lunch places\n", "Weekly team lunches\n", "Monthly team outings\n", "Flexible work hours\n", "Remote working 10 days per year - from home, as part of a holiday, or from where ever you want\n", "$1500 towards the computer of your choice and sit/stand desks\n", "Staff development with weekly lunchtime lightning talks about the latest technologies\n", "We partner with pledge1percent.org to donate 1% of time, product and profit to help nonprofits in our community. Each employee has 2.5 days to volunteer with the charity of their choice\n", "Free entry to exclusive Mathspace table tennis competition :)", "Please send us:\n", "Cover letter with examples of your awesomeness\n", "Github account\n", "Resume"]},
{"url": "https://www.python.org/jobs/2913/", "loc": "Munich, Germany", "title": "Data Engineer", "job_type": ["Back end", "Big Data", "Database", "Developer / Engineer"], "descrip": ["We’re looking for a Data Engineer for our Data Platform to become part of our outstanding development team in Munich. You are responsible to develop new features that help us to improve our data gathering and event processing products. If you love to continuously improve and deliver high quality software - then Stylight is the place to be for you!", "Your Responsibilities", "Your Team", "Why Join Stylight?", "Your Profile", "It all started with four students from Munich who wanted to make the fashion landscape a bit more accessible for all of us. Back in 2008 Stylight started as s simple fashion search tool. People loved it and our story began.\nToday Stylight is Europe’s leading style aggregator available in 17 countries worldwide. As part of  ProSiebenSat.1 Media SE we are on a mission to Make Style Happen. Our mission is based on the core insight that people aspire to a fashionable and vibrant style: a life of beautiful things, good things, fun things. But, due to the lack of time, money and knowledge, it’s often hard to make style inspiration become a reality.\n That’s why we build a place you can visit to find and discover products from all retailers and brands, personal recommendations, shopping guides, curated picks, how-tos, and the latest trends. A place giving brands and retailers the platform, solutions, and support they need to grow their businesses.\nThe team behind Stylight are 100 style geeks and tech professionals, a data-driven lifestyle force, coming from 20 nations all around the globe, operating from our headquarter in Munich and our US office in Philadelphia."]},
{"url": "https://www.python.org/jobs/2914/", "loc": "Newport Beach, CA, USA", "title": "Advanced Python Engineer", "job_type": ["Back end", "Finance", "Lead", "Numeric processing", "Systems", "Developer / Engineer"], "descrip": ["We are a small team of software engineers passionate about creating fast, lean, and robust Python code. We use Python 3, and broadly employ modern language features and libraries such as type hints, generators, decorators, functools, itertools, and collections. We leverage high-performance libraries like NumPy and Pandas, and use Flask for web apps. While we do not write much C, we understand Python at the C level. To increase code quality and knowledge transfer, we spend significant time reading and discussing each other's code. We tame large datasets filled with noise and irregularity, and develop reusable approaches to data pipelining, caching, and numerical processing. We habitually test everything we write, and practice continuous integration and continuous deployment. We develop on Linux and deploy to a fleet of VMs via Ansible and Supervisor. We take the time to refine old code, find optimal designs, and invest in building powerful, general-purpose tools, some of which we have open-sourced. As full-stack engineers, we contributing to code, test, back-end, front-end, operations, and deployment.", "We are the core engineering team in Investment Management at Research Affiliates, a global leader in innovative indexing and asset allocation strategies. We build the tools that construct hundreds of different portfolios; we create and maintain an expanding network of applications for processing portfolios and financial data, from back-end reporting to front-end comparison and analysis.", "We are looking for software engineers who share our interests.", "Substantial experience with Python is required, as well as a bachelor's degree in Computer Science (or a related field) and 3 years experience in software engineering (or equivalent professional experience). Advanced degrees (MA, PhD) are welcome, as are applications from exceptional junior candidates.", "We offer resources to attend conferences, continue expanding your skills, and pursue activities that drive personal growth and creativity. As a company, we embrace the core principles of responsibility, collaboration, curiosity, and authenticity, and actually try to live those values. We have a comfortable office near the ocean with daily catered lunches. Benefits are excellent, and salary is commensurate with experience, education, and competitive with top tech firms. Relocation assistance is available."]},
{"url": "https://www.python.org/jobs/2827/", "loc": "Ghent, Belgium", "title": "Principal Python Software Engineer", "job_type": ["Back end", "Developer / Engineer"], "descrip": ["Do you want to be part of the Engineering team of Western Digital, with a development center in Belgium, Ghent?\nDo you want to work on their latest Object Storage systems that deliver storage capacity up to 52 PetaByte?\nDo you want to write software for the ActiveScale product line?\n", "We are currently looking for an ", " who wants to work on extending the customer facing Storage API, different storage compliance features, Disaster Recovery options and tuning the system for better performance and scalability.", "We are looking for someone who wants to lift his (or her?) career to the next level by learning from some of the worlds brightest storage experts and contribute to a revolutionizing product.\nWhen you want to (learn to) write software with a focus on Enterprise Quality, Performance, Scalability and Robustness, Amplidata/Western Digital is the place to be.", "Required Skillset", "Skills considered a plus", "Personality", "Amplidata has been acquired by Western Digital Company.\nThe acquisition supports the company’s strategy to expand into higher value data storage platforms and systems that deliver breakthrough value and scalability to address the massive growth in storage requirements in cloud data centers. Amplidata’s primary offering is Himalaya®, an advanced object storage software product that enables scale-out software-defined storage systems. By delivering industry leading scalability with the efficiency, resiliency, and flexibility required for demanding cloud data center environments, Amplidata’s products and technology have earned the trust of leading OEMs and cloud service providers. Building on its reputation for producing reliable HDDs, SSDs, and developing tighter integration with software, HGST is optimizing storage efficiency and reliability for today’s data-centric economy. HGST had previously selected Amplidata as a joint development partner for its Active Archive platform which aims to enable breakthrough levels of storage efficiency at an ultra-low total cost of ownership. Having greater control and expertise over the fundamental building blocks of hard drives, solid state drives, and software, enables tighter end-to-end system integration and a more optimal use of software and underlying device capabilities.", "To learn more about HGST visit ", "To learn more about Amplidata visit "]},
{"url": "https://www.python.org/jobs/2826/", "loc": "Chesterfield, MO, United States", "title": "Python Developer with .Net Experience", "job_type": ["Back end", "Database", "Front end", "Numeric processing", "Systems", "Testing", "Text Processing", "Developer / Engineer"], "descrip": ["Design, build, test and maintain scalable and stable off the shelf application or custom built technology solutions to meet business needs. Act as a subject matter expert for Application Software developers and Engineers.", "Qualifications:", "Education/Experience:\n*  Bachelor’s degree in Computer Science, MIS, related field or equivalent experience.\n*  3+ years of related experience.\n*  Healthcare experience strongly preferred, requires demonstrated understanding of business process as it relates to experience in the field.\n*  Advanced knowledge of agile methodology.", "Preferred Skills:\n*  Strong Python programming experience. Will consider .NET skills, but primary duties will be in Python. .NET skills would be a plus as a secondary skill as well.\n*  Strong SQL. Inner and Outer Joins.\n*  Stored Procedures.\n*  Strong team and collaboration skills.", "Client is a provider of health plans through Medicaid, Medicare and the Health Insurance Marketplace and other Health Solutions through their specialty services companies."]},
{"url": "https://www.python.org/jobs/2905/", "loc": "Greenbelt, Maryland, USA", "title": "Backend Software Developer", "job_type": ["Back end", "Integration", "Developer / Engineer"], "descrip": ["Job Description:\nWe are looking for a software developer who values exploration, discovery, efficiency, and finding resolutions to complex issues.  This position will be on-site at NASA Goddard Space Flight Center in Greenbelt, MD.", "What You’ll Do:\nYou’ll work closely with our engineers, developers, operators, and our NASA customers to develop and support GIBS, an open-source (", ") web service and the backend to NASA’s Worldview, as it migrates its existing Linux-based on-premises system into an Amazon Web Service cloud-computing environment. Your primary responsibilities will include:", "Required Qualifications:", "Desired Qualifications:"]},
{"url": "https://www.python.org/jobs/2829/", "loc": "SAN DIEGO, California, USA", "title": "Software Engineer (Python/AWS)", "job_type": ["Back end", "Cloud", "Database", "Testing", "Web", "Developer / Engineer"], "descrip": ["As a valued member of a small team you will help in design, implementation, deploy and operate microservices that serve millions of users in a DevOps manner fully on AWS Stack using Python, SQL, NoSQL technologies.", "ForeSee Medical is developing the next-generation open platform, cognitive processing software solutions that place data in the hands of providers and care teams to empower them to positively influence health outcomes. With the transformation to value based payment – more than ever physicians need software like ForeSee, the virtual assistant that helps them become a value based payment winner.   In our last venture, we invented the 1st EHR to work in the Cloud and on an iPad and later Medical Economics recognized our EHR as one of the “Top 10” in the country. We brought touch technology to the EHR world, simplifying the way that providers interact with their patient’s health record.", "ForeSee Medical is the next logical step for our team – cognitive software built for the move from volume to value."]},
{"url": "https://www.python.org/jobs/2828/", "loc": "San Diego, California, USA", "title": "Senior Software Engineer(Python/AWS)", "job_type": ["Back end", "Big Data", "Cloud", "Database", "Lead", "Testing", "Web", "Developer / Engineer"], "descrip": ["From the ground up you will architect, design, develop, deploy and operate microservices that serve millions of users in a DevOps manner fully on AWS Stack using Python, SQL, NoSQL technologies.", "If this sounds interesting, we would like to hear from you!\nPlease apply via our careers page.", "ForeSee Medical is developing the next-generation open platform, cognitive processing software solutions that place data in the hands of providers and care teams to empower them to positively influence health outcomes. With the transformation to value based payment – more than ever physicians need software like ForeSee, the virtual assistant that helps them become a value based payment winner.   In our last venture, we invented the 1st EHR to work in the Cloud and on an iPad and later Medical Economics recognized our EHR as one of the “Top 10” in the country. We brought touch technology to the EHR world, simplifying the way that providers interact with their patient’s health record.", "ForeSee Medical is the next logical step for our team – cognitive software built for the move from volume to value."]},
{"url": "https://www.python.org/jobs/2839/", "loc": "Edinburgh, UK", "title": "Python Web Developer (all levels)", "job_type": ["Back end", "Web", "Developer / Engineer"], "descrip": ["An opportunity has arisen for a talented developer to join our team.  You would be filling a key technical role at our Edinburgh office, providing scope and direction for exciting new projects, implementing robust solutions to specification and ensuring excellence on best practice with the rest of the team.", "Our company has and will continue to grow via the input and decisions of the entire team, based both on formal team meetings as well as impromptu chats at the kettle. Our office is fairly chilled and you will have 3 options; listen to the office radio with optional cross office chat, put your headphones in and listen to your own beats, or start an epic elastic band battle with the testers.", "Oh yeah, we have testers! They are like our office siblings; we are best of friends but they do insist on breaking everything we own. It’s cool though, we don’t have a blame culture...we don’t find it to be very productive!", "What you’ll be getting up to:", "Designing and building neat software solutions and products using Python and Django\nPlanning with other members of the team\nSolving dev world problems in a supportive environment!", "What you’ll get in return:", "When we say flexible hours we mean flexible hours!\nPrivate health insurance including dental and optical\nAn extra day's holiday for each year of loyal service...long live The Empire!\nAn invite to “The Real Coffee Club”, as well as their arch nemesis “The Biscuit Club”\nFree fruit to mellow out that caffeine and sugar come down\nDevs Assemble! Support from your fellow devs when the call comes\nStability: Mercurytide is pushing 20 with a low staff turn around\nPizza...tonnes of Pizza! Successful project? Pizza! New streamlined process? Pizza! matching socks? PIZZA!", "Mercurytide is built upon a foundation of great people. We love all things digital, and our clients benefit from our full-service delivery - from online strategy and web design through to web development and ongoing support. In order to keep up with the demand for our expert services, Mercurytide is looking to hire talented new recruits with a passion for the web. You will join a culture of exceptional people, who pride themselves on being up to speed with the latest technologies.", "Life at Mercurytide is never dull; we have a busy calendar of work, social events, plus we know the best local spots for coffee, tea and food."]},
{"url": "https://www.python.org/jobs/2831/", "loc": "Bangalore, Karnataka, India", "title": "Python Backend Engineer", "job_type": ["Back end", "Cloud", "Database", "Front end", "Integration", "Systems", "Testing", "Web", "Developer / Engineer"], "descrip": ["Make sure you read ", " before you proceed", "We have built some Microservices, Device Farms (Android & iOS) & IDE Plugins with Python/Django, Node, Java, Ember to help developers and enterprises to automatically detect and fix security loopholes in their Mobile (iOS, Android, Windows, etc.) / IoT Apps within a few minutes. Before you wonder: No, you need not know anything at all about security to apply for tech positions in Appknox. We have experienced security professionals on-board who will give us scripts to detect vulnerabilities. Our job is to refine it and integrate it with the whole system. Only requirement to apply for Appknox is to know how to write good code.", "Our tech team is close-knit family of handful of developers. But the size of company is about 25+ people strong (security, sales, marketing, design & other teams). The tech team intentionally tried being as small as possible for as long as possible. Because we love to do as much work as we can - on our own. Only hire when we can no longer handle things on our own. It gives you a lot of opportunity to learn a lot of things.", "We are very picky about hiring. Because the core members will set the engineering culture that the entire tech team will follow in the future. Which means the core team should reflect the kind of culture we wish to have at out startup: A close knit family of learners trying to leave behind a mark in the world. To make today - safer & better than yesterday - however small the change may be. This is what it means to be a KnoxStar."]},
{"url": "https://www.python.org/jobs/2834/", "loc": "Lyon, France", "title": "Python Developer", "job_type": ["Back end", "Front end", "Testing", "Web", "Developer / Engineer"], "descrip": ["We love IT, we love programming ! We expect from you the same to join our team. You will work on critical applications for Mobile Operators of the group that are located in different countries. You will travel !", "IT Solutions Factory is a company part of the NJJ group. Our company build and maintain software for Mobile Operators that are part of the group. Since its creation, in 2015, the team, coming from 42, works on projects that will simplify the operator : CRM, billing, ERP, network tools... NJJ is growing, our team needs to grow as well to face our new challenges."]},
{"url": "https://www.python.org/jobs/2832/", "loc": "Hamilton, Ontario, Canada", "title": "Software Developer", "job_type": ["Back end", "Cloud", "Database", "Integration", "Operations", "Systems", "Testing", "Web", "Developer / Engineer"], "descrip": ["Maintain and develop Airport Winter Operations software Write, modify, integrate and test software code. Maintain existing computer programs by making modifications as required. Identify and communicate technical problems, processes and solutions. Prepare reports, manuals and other documentation on the status, operation and maintenance of software. Assist in the collection and documentation of user's requirements. Assist in the development of logical and physical specifications. Research and evaluate a variety of software products. Program animation software to predefined specifications for interactive CDs, DVDs, video game cartridges and Internet-based applications. Program special effects software for film and video applications. Write, modify, integrate and test software code for e-commerce and other Internet applications.", "Requirements:", "Experience:", "Netquity Corporation is a leading provider of Enterprise software development. We've delivered projects starting from startup mobile applications to globally distributed & operationally mission critical platforms. We integrate a mix of concepts and strategies with our passion of technology to bring your ideas to life. With unparalleled industry knowledge, technical talent and a unique company culture, Netquity makes complex problems simplified."]},
{"url": "https://www.python.org/jobs/2840/", "loc": "Greenbelt, Maryland, USA", "title": "Senior Software Developer AWS Python and Node", "job_type": ["Back end", "Cloud", "Front end", "Image Processing", "Integration", "Testing", "Developer / Engineer"], "descrip": ["SSAI is looking for a highly qualified, seasoned software developer who values exploration, discovery, efficiency, and finding resolutions to complex issues.  This individual must be self-motivated, demonstrate initiative, exhibit a strong work ethic, and have excellent written and verbal skills, time management, organizational skills, as well as the ability to work in a distributed team environment.", "Our team provides architecture, development, and operations support for NASA’s Global Imagery Browse Services (", "), an open-source (", ") web service designed with the goal of advancing user interactions through full-resolution earth science data visualizations captured by NASA’s Earth observing satellites.  On a daily basis, thousands of users explore the past and present state of the planet to support a wide range of activities – from locating remote forest fires to navigating around ice laden seas to tracking the progress of tropical cyclones.  Our goal is to enable this exploration and discovery of our ever-changing and evolving Earth.  Additionally, we are committed to open source ideals and believe in sharing what we’ve done while learning from others.", "You’ll work closely with our engineers, developers, operators, and our NASA customers to develop and support GIBS as it migrates its existing Linux-based on-premises system into an Amazon Web Service cloud-computing environment. Your primary responsibilities will include:", "Participate in software requirements and test plan reviews\nMature an AWS cloud-based software design, integration process, and deployment model\nDevelop open-source software leveraging AWS services\nSupport operations and testing activities", "Required Qualifications:", "-Bachelor’s degree in Computer Science or related technical field and 5 years of professional software development experience or equivalent combination of education and experience.\n-Senior experience developing software with Python and Node\n-Experience developing and executing continuous integration tests (e.g. Bamboo, Jenkins)\n-Ability to effectively maintain a version controlled code repository using modern tools (e.g. git).\n-Experience supporting functional and performance testing activities\n-Experience supporting operational deployment troubleshooting and issue resolution\n-Dedication to clear and thorough code and design documentation.\n-Familiarity with Unix/Linux operating systems and networking concepts", "Desired Qualifications:", "-Experience with continuous deployment practices (e.g. Docker Containers, CloudFormation)\n-Experience designing, developing, and maintaining software that leverages AWS core services.  (e.g. compute, network, storage, database, management, etc.)\n-Demonstrable experience participating in open-source software projects\n-Good knowledge of security as it relates to an AWS infrastructure\n-Experience with AWS step functions\n-Familiarity with GDAL/OGR\n-Familiarity with NASA Earth Observing System (EOS) data products", "Please apply through the company website"]},
{"url": "https://www.python.org/jobs/2825/", "loc": "Cincinnati, OH, United States", "title": "Senior Software Developer", "job_type": ["Back end", "Cloud", "Database", "Systems", "Web", "Developer / Engineer"], "descrip": ["Senior Python developer capable of going beast mode at a fast growing data startup.", "You will be helping to develop our REST API, grow our data infrastructure, and support our growing data analysis pipeline.", "WHAT WE DO - Human-driven data analysis", "We’re focused on changing how humans experience data on maps. Spatial is building a future that empowers people to navigate like a local anywhere on earth. To achieve this, we build interactive and dynamic social layers directly into maps and navigation applications through a human-driven, machine-assisted analysis.", "Ethnographers | Engineers | Adventurers", "Our data and front-end interfaces for our data are in use in the automotive, real estate, and travel industires. Everything we build contributes to our goal: to help people understand what an area or place is like without having to be there.", "Whether it's our map interface (spatial.ai/re), our natural language interface (we'll show you if you apply!), or our stealth projects in development, being a part of Spatial means building new things and testing the limits of technology."]},
{"url": "https://www.python.org/jobs/2814/", "loc": "Leipzig, Saxony, Germany", "title": "Django Developer", "job_type": ["Back end", "Database", "Front end", "Web", "Developer / Engineer"], "descrip": ["The Max Planck Institute for Cognitive and Neurosciences (MPI CBS) in Leipzig examines the function of the human brain. Our studies lead us to significant results in fundamental research. Other institutes of the Max Planck Society (MPG) (e.g. the Max Planck Institute for Human Development, Berlin) also carry out such studies, to enable a collaborative project of MPG to develop an open source management system for the organisation and implementation of such studies. Within the scope of this project we search a Django Developer.", "The Max Planck Society is committed to increasing the number of individuals with disabilities in its workforce and encourages applications from such qualified individuals. Furthermore, the Max Planck Society seeks to increase the number of women in areas where they are underrepresented and therefore encourages women to apply. Please submit your application via our online system at ", " by 25/10/2017 (the subject heading is “DJE 18/17”).", "For further details, please contact: Dr. Goldau: ", ". Max Planck Institute for Human Cognitive and Brain Sciences Stephanstraße 1A, 04103 Leipzig"]},
{"url": "https://www.python.org/jobs/2796/", "loc": "London, United Kingdom", "title": "Python Software Engineer / Developer", "job_type": ["Developer / Engineer"], "descrip": ["Currently working on their first platform release and planning theirsecond, our client is looking for Software Engineers to join the team in London, who will work closely with the current development team and founders to shape the product.", "You’ll be responsible for designing, developing and testing high-performance, intuitive, data-driven web applications and APIs using Python, Django and anything else you feel strongly about.", "You must-have most, if not all of:", "Bonus points for:", "This young start-up has recognised that it's time for a change in financial services.", "Since March 2016, the team has been building a new lending & banking platform using modern technologies, offering a far faster, more flexible & cost-effective alternative to existing banking platform vendors.", "Everyone who is a part of the team can contribute to its growth - everyone is supported in trying new ideas in their day to day roles and given freedom to shape a product which does something good for consumers and businesses."]},
{"url": "https://www.python.org/jobs/2806/", "loc": "Houston, TX, USA", "title": "Software Engineer -- Python/C++ and SWIG", "job_type": ["Big Data", "Front end", "Integration", "Numeric processing", "Systems", "Developer / Engineer"], "descrip": ["Integrated Informatics is a software development shop servicing the Energy and Natural Resource sectors offering a positive working environment and a competitive compensation package with excellent benefits . This role is focused on integration across multiple languages within a high performance desktop applications for data analysis and visualization.  Salary commensurate with experience, no phone calls please.", "5+ years developing commercial grade applications using Python and C++", "Writes highly readable, maintainable, and elegant code", "Experience with Cython, Python C API, SWIG, and/or CFFI", "Works well nice with source control (git, tfs, svn, etc.)", "Writes tests (unittest/boost), uses a debugger, and understands PEP-8", "Smart, strong work ethic, enthusiastic, driven, and gets things done", "Familiarity with Agile development practices and ability to work in a team environment", "Bachelor's Degree in mathematics, computer science, engineering or relevant experience.", "There is a large amount of client interaction; candidates will need to have excellent communication and organizational skills."]},
{"url": "https://www.python.org/jobs/2799/", "loc": "Vancouver, BC, Canada", "title": "Software Developer - Python", "job_type": ["Back end", "Cloud", "Systems", "Developer / Engineer"], "descrip": ["Join us at our Vancouver office or remote to work on an exciting project involving Python, Apache Cassandra and Apache Kafka. You will work as part of our backend team, directly interfacing with our clients to help them develop the next generation backend services.", "Momentus is an innovation studio based in Vancouver, BC, Canada. We work with everything from Fortune-50 companies to scrappy start-ups."]},
{"url": "https://www.python.org/jobs/2816/", "loc": "Cambridge, Cambridgeshire, United Kingdom", "title": "Senior Python Developer", "job_type": ["Back end", "Front end", "Developer / Engineer"], "descrip": ["Position Summary:", "Bromium endpoint security is controlled and monitored through a series of web services deployed at scale both on individual corporate enterprises and across multiple Amazon AWS instances. These services provide the binding that ensures customers are always protected and alerted to threats, and act as the primary UI to our products.", "You will be joining a team to design, engineer, test, and deploy such systems at scale that need to deal with millions of clients, both for Bromium’s customers and our OEM partners. You will be enabling users to aggregate configuration and management information and to view and analyse any attacks isolated by the Bromium software.", "Responsibilities:", "Required Qualifications:", "Preferred Qualifications:", "Work Schedule: Full Time", "Location(s): Bromium, Cambridge, UK", "Company Overview: Bromium was founded in 2010 with a mission to restore trust in computing. The company’s founders, Ian Pratt and Simon Crosby have a long and deep history of innovation in virtualization and security. Inspired by the isolation principles of traditional virtualization, the Bromium team has created a game-changing new technology called micro-virtualization to provide powerful enterprise by protecting end users against advanced malware. Bromium has its headquarters in Cupertino, California and an R&D center in Cambridge, UK. The company is backed by top-tier investors, including Andreessen Horowitz, Ignition Capital, Highland Capital Partners, Intel Capital, Meritech Capital and Lightspeed Venture Partners.", "For more information visit our website: ", "To apply:", "Please submit your resume and cover letter to: "]},
{"url": "https://www.python.org/jobs/2800/", "loc": "Remote, USA", "title": "Python3 developer for data access", "job_type": ["Back end", "Big Data", "Cloud", "Database", "Systems", "Developer / Engineer"], "descrip": ["Python developer at a stealth-mode startup capable of hitting the ground running.", "We don't care where you live or what you did yesterday - or twenty years ago - its just important that you can write quality code in a fast-paced, challenging startup environment.", "We also don't care (too much) where you live - as long as you are in a US timezone i.e. between EST and PST.", "Zuar is zuar.", "Zuar Inc. is a funded, 10 person startup based in Austin, Texas."]},
{"url": "https://www.python.org/jobs/2797/", "loc": "Hoogstraten, Belgium", "title": "Remote Python Developer for GAE microservices", "job_type": ["Back end", "Cloud", "Developer / Engineer"], "descrip": ["You assist in programming the foundations of Pit&Pit on Google App Engine. You ensure optimal user convenience of our website for employees and clients through application of backend microservices. You create a fast and solid code that is well-structured and documented.", "Within your first month, you understand our repositories and the concept of our code base. You know the structure and grasp the what's, where's and why's of our code. You know the code and understand the underlying parts and foundations. You know our focus points. You will ", " from scratch by use of a clear API definition. You receive approval from the users and feel hungry for more.", "Within the first quarter you will be able to elaborate a complete subproject, consisting of new and existing microservices, ", ". Throughout the process, you communicate efficiently with all stakeholders to ensure that the result meets the demands and goals of the project. You make suggestions to improve working conditions and tools so that everybody can work in a more efficient and enjoyable way.", "On the longer term, you will learn to ", ". You give shape to the infrastructure and manage large parts of the system. You can easily respond to the needs and demands of the team.", "We believe that everybody should be able to enjoy a healthy life. We want to make our customers happy, without any frustrations or hassle.", "At Pit&Pit we do not focus solely on our products; instead we sell solutions for our customers' problems. We provide an answer to their wishes, fulfill their curiosity, give them faith in and hope for a healthy and tasty life. We help them create cosiness, like cooking food for friends and family. We want our customers to feel unique and special, and we support them in their change towards a more wholesome and flavourful way of life.", "Pit&Pit, based on the border between Belgium and the Netherlands, is on of the largest webshops in natural food, herbs, nuts, teas and superfoods in Belgium, the Netherlands and Germany. Passion for our products and our original and customer-focused vision on e-commerce have ensured a spectacular growth of our company in Europe over the last couple of years. Recently we opened a brand-new warehouse in Hoogstraten. The succes of Pit&Pit stems from a unique and extensive assortiment of quality products, a continuous striving towards full customer-satisfaction, impeccable organization and sustainable business relations. At Pit&Pit you will work in a young, dynamic team of ca. 40 employees and a small IT team.", "At Pit&Pit we enjoy working together with highly motivated people. We find it very frustrating to work in a team in which not everyone is equally dedicated. Hence you will only find top talents at Pit&Pit; driven and enthousiast colleagues, full of energy and always with a big smile on their face."]},
{"url": "https://www.python.org/jobs/2815/", "loc": "London, United Kingdom", "title": "Python Engineer", "job_type": ["Back end", "Front end", "Lead", "Developer / Engineer"], "descrip": ["We are  working with one of the UK’s most prestigious brands who have recently opened a brand new innovation laboratory, a developer’s paradise playground. They will produce products that will compete with likes of Facebook and other media giants using the latest cutting edge tools. It offers such an impressive prospect it has lured top professionals from the likes of Google and eBay.", "we are looking for numerous Python developers from mid –level up to Lead.", "This great opportunity to work in a start-up environment but with the backing and security of one of the most powerful companies in the UK. Joining this high calibre team you will have the opportunity to rub shoulders with some of the best professionals on the market.", "The role is located in London, England and salaries varies dependant on experience and skillset.", "Prestigious Brand  with a network of more than 100 websites."]},
{"url": "https://www.python.org/jobs/2818/", "loc": "Barcelona, Barcelona, Spain", "title": "Java/Python Developer", "job_type": ["Back end", "Cloud", "Database", "Web", "Developer / Engineer"], "descrip": ["WHAT WE LOOK FOR", "We are looking for talented Java or Python developer to join our young and international team based in Barcelona. As Cloud Developer Specialist you will be responsible of providing outstanding support for Google Cloud Platform products and gather feedback to help improve the Cloud Platform products.", "WHAT YOU WILL GET", "You will get a full time and permanent contract with an international company, with the chance to grow up and develop your career in the IT Field.", "The base salary is 25.000 euros gross a year, up to 3.000 euros gross a year as a bonus, plus 1.540 euros a year as a ticket restaurant, private health insurance and employees discounts, relocation package in case is needed.", "The shift will be rotating between 6am and 8pm, Monday till Sunday, working normally one weekend a month.", "The recruitment processes and people involved in them (both recruiters and Project Managers) will not discriminate any candidacy because of age, disability, ethnic, marital status, gender, nationality, ideology, political, race, religion and sexual orientation.", "Minimum requirements:", "100% fluent in English (minimum C1)\nPrevious experience as Developer\nFamiliar with web protocols (HTTP, TLS, SSL etc)\nFirm understanding of programming (Python or Java)\nBackground in SQL\nAbility to read and understand logs and stack traces.\nAbility to research using internal knowledge bases and public facing documentation (Google Developers, StackOverflow..)\nFamiliarity with modern API technologies (OAuth, HTTP RPCs).\nAble to work with rotating shifts Monday till Sunday.", "WHO WE ARE", "SELLBYTEL is a consolidated and dynamic international company providing service to the top 10 companies belonging to the IT and social networking world. We are based in the heart of Barcelona with more than 3000 employees from all over the world. On top of that, we offer an attractive environment with a great team spirit."]},
{"url": "https://www.python.org/jobs/2821/", "loc": "Amsterdam/Rotterdam, Netherlands", "title": "Python Developer", "job_type": ["Back end", "Cloud", "Developer / Engineer"], "descrip": ["Bynder is looking to hire you, a Back-End Developer, who wants to help build the most advanced and easiest to use branding automation software in the industry. Our Development team is building a cloud-based SaaS product for marketeers to automate and streamline their workflow in today’s globalized business environment.", "Our clients are some of the world’s largest brands, including Spotify, KLM, and Nest to name but a few. We’re looking for someone who understands the challenges involved in creating a globally available, distributed system with four nines of reliability. We don’t take “no” for an answer and we stress the boundaries of what’s available.", "We work with a microservice architecture, using multiple asynchronous systems and pushing the limits of both the technology and AWS to the limits to adapt our product to use state of the art technologies. We are hiring for this role in Amsterdam and Rotterdam, where our rapidly growing team of developers are situated. Both offices are situated in the heart of the city.", "Our development team is split into autonomous squads, each with responsibility for their own area of the product. We have perks: each developer gets their own mac. We supply daily lunch at the office. We relax every day with beers, and we have ping-pong tables on hand for when you need a break. You will join an international team: we have 20 nationalities between our 60 developers - and many more when you include our other offices in London, Boston, Dubai, and Barcelona. Bynder Amsterdam has cutting-edge innovations and free spirited lifestyle, where we bike to work and hang out at the canals.", "You’re a skilled software engineer who is interested in developing smart solutions in a globally distributed cloud computing environment. You’re a Python expert first and foremost, with knowledge of at least one Python web framework (ideally Pyramid). You will know Amazon Web Services inside and out. You know and care about continuous delivery and automated testing. You will have an international and user focused mindset: our success is built on putting user experience first. You are passionate about building scalable and reliable engineering solutions.. You are a fan of agile working practices: you get things done and enjoy it.", "At Bynder, we <3 innovation! We challenge each other every day and we are all into the latest technical stuff. We love the freedom to come up with new ideas and initiatives – we test, trial, fall and learn all the time and that’s what makes us awesome. You’ll work in a team of motivated and driven development boys and girls (who also like chill at the bar to grab a cold beer.)", "Bynder is award-winning marketing software that allows brands to easily create, find and use content, such as documents, graphics and videos. More than 150,000 brand managers, marketers and creatives use Bynder’s brand portals every day to collaborate globally, produce, review and approve new marketing collateral, and circulate company content at the click of a button. Brands using Bynder go to market faster and achieve end-to-end brand consistency across all channels and regions, with simplified collaboration across the organization.", "Founded in 2013 by CEO Chris Hall, Bynder is established globally with headquarters in Amsterdam and offices across the Netherlands, UK, US, Spain and UAE."]},
{"url": "https://www.python.org/jobs/2822/", "loc": "Rome, Italy, Foreign State, Italy", "title": "Django / Python Developer Consultant", "job_type": ["Back end", "Cloud", "Database", "Front end", "Integration", "Management", "Web", "Developer / Engineer"], "descrip": ["The United Nations World Food Programme (WFP) is the world's largest humanitarian agency, fighting hunger worldwide. We are seeking to fill a consultancy position of Django/Python Developer based at our Headquarters in Rome, Italy.", "Under the general and functional supervision of the Head of Applications Development RMTD (Digital Solutions Delivery Branch) the incumbent will be responsible for the following functions:", "Qualifications & Experience Required:", "Code Development\nAnalyse business requirements and design/develop new system functionality.\nRapidly and independently, develop application prototypes in Python-Django, following the rigorous software development and quality assurance.\nCreate and maintain software design models and technical documentation", "Technical Coordination with External Developers\nDevelop fully functional web applications in coordination with remotely located software developers, adopting the SCRUM methodology, a team ticketing systems and a shared source code repository.", "Platforms Maintenance\nDevelop enhancements to implement new features and to strengthen application automations, validations, and reports.\nTroubleshoot technical issues and fix bugs affecting the web application in different environments (production, sandbox, training, etc.).", "Education:", "Advanced University Degree and/or advanced courses/training with emphasis in one or more of the following disciplines: Computer Science, Mathematics, Software Engineering", "Experience:", "Minimum 3 years post graduate, progressively responsible professional experience as Web Developer within an organization and proven record of accomplishment in development and implementation of IT applications. Possess a combination of broad business skills and IT experience including:\nIT solution development: Requirements, Design, Development, Implementation.\nBusiness analysis: creation and review of business, functional and non-functional requirements for IT solutions.", "Technical Skills & Knowledge:", "Strong experience with Development standard tools/methodologies\nGood knowledge of WFP IT infrastructure / Services.\nStrong and proven experience with Django/Python development stack (Django, Python 2.7 or 3.x, Postgres SQL, Nginx).\nStrong and proven experience with CSS, LESS, SCSS\nStrong and proven experience in using Git versioning system and GitFlow.\nStrong and proven experience in working in a Scrum Agile environment.\nKnowledge of one JavaScript Libraries between KnockoutJs, AngularJS, ReactJS is desiderable.", "Competencies:", "A certain degree of autonomy and self-management skills are required in order to identify solutions to be submitted to the related Team Leader for final approval.", "Language:", "Fluency in oral and written English", "The United Nations World Food Programme is the world’s leading humanitarian organization. Voluntarily funded, WFP is a leader in the global movement to achieve Zero Hunger, delivering food assistance in emergencies and partnering with communities to improve nutrition and build resilience.  With 90% of our workforce based in Country Offices and field operations, WFP serves more than 80 million people in 81 countries worldwide.", "In more than half a century of humanitarian engagement, we have learned that fighting hunger involves not just food delivery, but also building country capacity and strengthening cooperation by working with governments, NGOs, suppliers and local communities. We engage businesses and smallholder farmers, invest in local economies, markets and the private sector."]},
{"url": "https://www.python.org/jobs/2823/", "loc": "Dublin, Leinster, Ireland", "title": "Mid-Senior Python Developer x 2", "job_type": ["Back end", "Database", "Integration", "Systems", "Developer / Engineer"], "descrip": ["This role is with a large games developer in Dublin City. Their first game has over a million people playing it and they are now developing their 2nd title.", "I am looking for a 2 full-time Server developers who will be instrumental to the success of their new game and if it is anything like the last, it will be a huge success. You will be part of a small, highly skilled game server development team, developing highly scalable systems with a focus on consistency and low latency.", "Large Gaming Company - brilliant place to work and they should be able to assist with flights from overseas etc."]},
{"url": "https://www.python.org/jobs/2820/", "loc": "Barcelona, Barcelona, Spain", "title": "Big Data Developer", "job_type": ["Back end", "Big Data", "Cloud", "Database", "Machine Learning", "Web", "Developer / Engineer"], "descrip": ["Do you have experience as Big Data Developer with Python or Java? Are you looking for a place to grow up and improve your technical skills working with the most important companies in the world?", "THIS IS YOUR CHANCE!", "WHAT WE LOOK FOR", "We are looking for a Talented Big Data Developer in Python or Java to join our team in the Google Cloud project.Your main responsibility will be provide outstanding support for cutting edge products, solutions and APIs, including Google App Engine, Compute Engine and Storage to Google Cloud Clients.", "WHAT YOU WILL GET", "You will get a full time and permanent contract with an international company, with the chance to grow up and develop your career in the IT Field.", "The base salary is 25.000 euros gross a year, plus 1.540 euros a year as a ticket restaurant, up to 3.000 euros gross a year as a bonus, private health insurance and employees discounts. The shift will be rotating between 6am and 8pm, Monday till Sunday, working normally one weekend a month.", "The recruitment processes and people involved in them (both recruiters and Project Managers) will not discriminate any candidacy because of age, disability, ethnic, marital status, gender, nationality, ideology, political, race, religion and sexual orientation.", "Minimum requirements:", "100% fluent in English (minimum C1)\nPrevious experience as Big Data Developer\nFamiliar with web protocols (HTTP, TLS, SSL etc)\nFirm understanding of programming (Python or Java)\nBackground in SQL\nExperience with Big Data architectures and technologies (more than 1TB of data) and BI solutions\nAbility to read and understand logs and stack traces.\nFamiliarity with modern API technologies (OAuth, HTTP RPCs).\nExperience with distributed computing frameworks (e.g. Hadoop, Spark, Flink, Storm, Samza, Beam, Google Big Query, etc.)\nExperience with distributed data stores (HBase, Cassandra, Riak, Google Bigtable, Amazon Dynamo DB, etc.) and/or distributed message brokers (Kafka, RabbitMQ, ActiveMQ, Google Pub/Sub, Amazon Kinesis, etc.)", "WHO WE ARE", "SELLBYTEL is a consolidated and dynamic international company providing service to the top 10 companies belonging to the IT and social networking world. We are based in the heart of Barcelona with more than 3000 employees from all over the world. On top of that, we offer an attractive environment with a great team spirit."]},
{"url": "https://www.python.org/jobs/2781/", "loc": "London, London, Shepherds Bush, United Kingdom", "title": "Software Engineer (Python)", "job_type": ["Back end", "Developer / Engineer"], "descrip": ["Our technology team are highly skilled, diverse and experienced in a wide-range of technologies to build cutting edge solutions to global challenges, some of the techologies we work with are; Python, Django, GeoServer, PostGIS, Java, AWS, Vagrant.", "Role Summary:", "We require a Software Engineer at Pole Star to help build and maintain our core Python based platforms and services. You will work closely with the Front End Developers, QA Engineers and with the Product Manager both in our Boston and London offices.", "Key Responsibilities:\n•       Work in a small, agile team\n•       Identify production and non-production application issues\n•       Identify opportunities to fine-tune and optimize applications of projects both existing and upcoming.\n•       Provide direct support to the team’s development’s efforts, as and when requested\n•       Develop, test, implement and maintain application software working with established processes and procedures.\n•       Support formal testing and resolve test defects\n•       Create services and applications utilizing various programming languages", "Essential Skills:\n•       Strong Python with Django\n•       JSON, REST, SOAP and RESTful Services and API’s\n•       Experience working with a JIRA bug-tracker\n•       Linux/Unix knowledge (Redhat/CentOS/Fedora)\n•       RabbitMQ and Redis experience", "Desired Skills:\n•       Web development: HTML (HTML5 & CSS) and XML/XSL\n•       Knowledge of GeoServer or GIS services would be beneficial\n•       Some database and SQL knowledge, Oracle and/or PostgreSQL, Post GIS\n•       Jenkins, CI integration\nCompany Benefits", "At Pole Star, it takes a wide range of skills to develop, maintain and support the high-quality products for which we have become renowned. Each department, team and individual within the company plays a vital role in that process. From the initial idea to the development, testing and maintenance of products, through to winning the big deals and supporting the customer and our employees, everyone at Pole Star contributes to making the business a success and a great place to work.", "Why Work at Pole Star?\nAt Pole Star, it takes a wide range of skills to develop, maintain and support the high-quality products for which we have become renowned. Each department, team and individual within the company plays a vital role in that process. From the initial idea to the development, testing and maintenance of products, through to winning the big deals and supporting the customer and our employees, everyone at Pole Star contributes to making the business a success and a great place to work.", "Whether you've just entered the job market, have recently graduated or are already experienced in your field, we will help support you with our employee development programme. By offering you secure employment, a challenging and interesting work environment, on-the-job learning and professional training and development opportunities, we hope to help you achieve your career aspirations and maximize your potential.", "Pole Star is a privately-owned global maritime technology company. For 20 years we have developed innovative SaaS and API solutions for multiple industries. Today, we track over 40,000 ships for clients in over 90 countries, providing 24/7/365 support and world-class service in over 20 languages.", "Our products are enterprise grade, consistently award-winning, and continually evolving to best serve our key market sectors: Shipping & Offshore, Maritime Trade RegTech, and Governments. Our suite of services include a broad range of tracking, security, LRIT, alert systems, and regulatory technologies with the key purpose of increasing efficiency, safety, profitability and compliance at sea.", "From our HQ in London, 6 global offices, and over 50 trusted suppliers, we currently serve 46 governments and thousands of commercial customers. Our diverse multi-lingual, multi-national team are passionate about quality, excellence, and delighting our customers."]},
{"url": "https://www.python.org/jobs/2782/", "loc": "London, Mayfair, United Kingdom", "title": "Mid-level / senior Python Developer / Equity Partner position", "job_type": ["Back end", "Database", "Front end", "Lead", "Systems", "Web", "Developer / Engineer"], "descrip": ["Plug Financial Markets API, Vessels locations API.\nWeather Stations API (all API are well documented).\nCall data on 100 websites and import it on our database.\nBuild MVP/Prototype.\nBe able to build basic front-end for MVP", "Ability to deliver on a project.\nAbility to build prototype from A to Z alone.\nParticipate in key management decisions regarding product.", "Fintech Start-up operating in the commodities data market is looking for a Partner/ Senior Back-end engineer based in Central London"]},
{"url": "https://www.python.org/jobs/2783/", "loc": "Mountain View, California, United States", "title": "Senior Python Software Engineer", "job_type": ["Developer / Engineer"], "descrip": ["About The Opportunity:\nOur platform services team is growing and looking for a Senior Python Software Engineer to support the engineering teams developing Lytro Immerge, our Light FIeld solution for Virtual Reality, as well as Lytro Cinema, our Light Field solution for film and television. As Lytro’s project sizes and data volumes continue to increase, automation and configuration management will be key to managing the immense amount of data that we are sharing and storing both locally and in the cloud.", "In this impactful role you will be creating solutions that will enable our internal rendering and post-production teams to create efficient and scalable workflows and engineering processes.  You will have the opportunity to work with petabytes of data on thousands of machine instances that will have a large impact on making Lytro’s Light Field solutions the global industry standard in high-end VR and cinema productions.", "Main Responsibilities:", "Responsible for improving and automating Lytro’s hybrid data storage solutions both in the cloud and on local servers.", "Develop software solutions, tools, and processes that allow non-developers to easily and efficiently harness the power of 100,000 cores, at the push of a button.", "Write Python software to manage the installation, maintenance and monitoring of production servers for our Lytro team and clients.", "Manage cloud based environments via automation and configuration management tools in a Linux environment.", "Write highly performance Python and shell scripts and / or Python software to handle the transfer and storage of petabytes of light field data.", "Ensure that code is of highest quality, reliable, and properly versioned to ensure regular, safe, staged rollout of new features.", "Leverage Chef or other related technologies (i.e. Puppet, Ansible, etc.) to automate the deployment of solutions to the cloud.", "Create and maintain documentation and diagrams for distributed system architecture, scripts, and deployment processes.", "Required Skills & Experience:", "Strong Python programming skills and Python scripting or shell scripting experience.", "Experience developing software and writing scripts within Linux and cloud environments.", "Experience managing virtual machines and software deployments for the Google Cloud Platform and/or Amazon Web Services.", "Handling the transfer and storage of petabytes of data against highly performance distributed file systems in the cloud.", "Bonus Points:", "Hands-on usage of git and experience managing Jenkins jobs.", "Experience with nfs, smb, and rsync protocols, large data transfers and networking.", "Familiarity with render farm management software such as Deadline or Qube.", "Interest in virtual reality, cinematography, and/or photography.", "About Lytro:\nLytro is revolutionizing high-end content creation for Virtual Reality and Cinema with the world’s first professional Light Field based solutions. We are backed by top-tier VCs including Andreessen-Horowitz, Greylock Partners, NEA, and North Bridge Venture Partners and have built a world-class team and dynamic culture driven by innovation and collaboration."]},
{"url": "https://www.python.org/jobs/2784/", "loc": "Sofia, Sofia, Bulgaria", "title": "Python with Django Developer", "job_type": ["Developer / Engineer"], "descrip": ["The characteristics of the role are connected to designing, coding and modifying the getstocks trading platform according to our clients' specifications and system performance needs:", "Working with development teams across multiple platforms", "Building a variety of high-traffic, high-visibility and data-intensive applications", "Full life cycle development from gathering customer requirements, to design, development, implementation and product support", "Regular exposure to business stakeholders and executive management, as well as the authority and scope to apply your expertise to many interesting technical problems.", "Experience in planning and delivering software platforms used across multiple products and organizational units.", "Experience with Python with Django", "Previous experience with Java Script (server side)", "NodeJS will be considered as an advantage", "Familiar with MongoDB, MySQL/PostgreSQL", "Multi-threading programming", "Strong Middle Tier and Server Side Development Skills", "Experience with Test Driven Development and Agile Methodologies", "If you find the role interesting, wait until you join us, because we can offer you:", "Very competitive remuneration package", "Young, friendly and professional working environment", "Job-specific trainings and regular team buildings", "Office in a class-A building", "Additional benefits: sports card, health insurance, additional vacation days, parking"]},
{"url": "https://www.python.org/jobs/2788/", "loc": "berlin, Germany, Allemagne", "title": "Full-Stack Developer (Python)", "job_type": ["Back end", "Front end", "Machine Learning", "Web", "Developer / Engineer"], "descrip": ["We’re looking for a Full Stack Developer with the ability to help imagine, prototype, build and refine the experiences of our chatbots and B2B product. As part of our small team you’ll work closely with everyone from Engineering, Product and Business.", "WHAT WE OFFER", "WHO WE’RE LOOKING FOR", "What We're Building", "We build AI-powered chatbots that automate the communication between employers and candidates. For jobseekers and candidates chatbots offer a fundamentally new way to apply for a job — through their interface of choice, more intuitive and more engaging. For companies chat as a channel means higher engagement of their talent pool and the technology behind it gives companies the opportunity to automate many tasks of the recruiting process that are not value-add."]},
{"url": "https://www.python.org/jobs/2789/", "loc": "Vienna, Austria", "title": "Software Development Engineer Python", "job_type": ["Back end", "Big Data", "Front end", "Integration", "Lead", "Machine Learning", "Text Processing", "Web", "Developer / Engineer"], "descrip": ["What we offer:", "Sales teams spend about 10% of their time typing data into a CRM. Time that would be better spent building meaningful relations with their customers. Thrive for Email automates this work completely and frees the employee from repetitive copy pasting. We are changing the way CRMs are used, by leveraging technologies that are available today.", "As a Software Development Engineer, you will be responsible for the integration of other platforms and implementation of new features. You will join our developer team to improve the existing backend processes (Google App Engine & Python) and further develop the logic that supports our customers.", "Thrive for Email is a dynamic international startup with offices in London and Amsterdam. You will have the unique opportunity to specialize in fields of your interest – this could be Natural Language Processing, Machine Learning, Big Data Analysis or similar – and to help sharpen our virtual assistant even further."]},
{"url": "https://www.python.org/jobs/2813/", "loc": "London, UK", "title": "Python/React Lead Software Engineer", "job_type": ["Back end", "Database", "Front end", "Management", "Web", "Developer / Engineer"], "descrip": ["7Bridges is looking for a software engineer to lead development and build a team on a very exciting project that we’re working on. We are developing a web application that helps services companies manage their highly complex billing processes. We have won a 3 year contract with one of the world’s largest technology firms and are looking to expand the team as we ramp up product development and take on new clients (we're in stealth so you won't see much about us online).", "Currently it takes our client nearly 10 people to manage billing on one of their accounts alone. Little process control is in place and lot of manual data entry error results in invoices that are 5-20% wrong and take 90 days to bill due to lengthy dispute resolution discussions. This creates cashflow problems and damages the customer relationship. We’re solving these problems on a $150m account for our first client - and there’s another $4bn of revenue we’ll be able to manage.", "7Bridges are looking for a UK based person to either work remotely or in our offices in Central London. We will consider hiring whole (non-UK) teams if you’ve worked with people in the past that you like developing with. If you are not based in London this could be an opportunity to build a team around you and create a hub near your home location. If this sounds interesting please get in touch!", "The technologies we use are:\n-- Front end: React, GraphQL, Bootstrap\n-- Back end: Python, Django, Postgres\n-- Testing: TDD with Selenium, Mocha and Pytest\n-- Devops: Gitlab CI & CD\n-- Infrastructure: AWS\n-- Workflow mgmt: Git, Pivotal, Slack", "The product is just 2-3 months old, and we are looking for someone to take the project on as a lead engineer in the next 1-2 months and design and lead the build of the product."]},
{"url": "https://www.python.org/jobs/2790/", "loc": "Denver, Colorado, United States", "title": "Python Data Engineer", "job_type": ["Big Data", "Database", "Integration", "Machine Learning", "Developer / Engineer"], "descrip": ["Looking for an experienced Python programmer to help build a Python, Kafka, microservices, DevOps data solution for a fortune 500 building supply company.  This solutions is the backbone of the organizations entire data strategy.  Initial contract is 4-5 months and extensions are very likely. Office is a short walk from the Belleview light rail station.  Position starts ASAP!", "Python, SQL and Linux are musts, Kafka is a nice to have."]},
{"url": "https://www.python.org/jobs/2791/", "loc": "Cambridge, Cambridgeshire, United Kingdom", "title": "Lead Python Developer", "job_type": ["Back end", "Front end", "Lead", "Developer / Engineer"], "descrip": ["We are looking for a highly talented full stack engineer who is looking to build a new multi-faceted greenfield platform and who relishes the unique challenges of working in a new business. The role is very much focussed on writing top code, alongside which, you will be expected to mentor and help the more junior engineers in the team.", "Main points of the role are:", "You’ll be working with the CTO, developing greenfield products on a young platform.\nChallenges will range from building 3rd party integrations, to accounting and reconciliation processes, to locking and concurrency issues on the back end.\nYou’ll continually be working on new products including supporting ecommerce user journeys, database architecture, and where needed, the front end as well.\nYou will be supported by both mid-level and junior developers whom you will have the opportunity to nurture and develop.", "You are an accomplished Python developer.\nStrong experience of creating and using Web APIs.\nComfortable using Linux and general Internet systems.\nOutstanding programming skills.\nFamiliar and comfortable with object oriented programming techniques.\nYou have mastered at least one web application framework such as Flask, Django or another mainstream framework.\nGood knowledge of html, javascript and css.\nExperience of working with a relational database and preferably knowledge of SqlAlchemy.\nRestful web services.", "And the nice to haves:", "Celery.\nJinja2 templating.\njQuery.\nPostgresql (database).\nGit (version control).\nBash scripting (Linux).", "We may produce API's and analytics for Gift Cards, but we are NOT a Gift Card company.  For us, it is all about the Tech.", "We’re unlocking a $150 billion analogue gift card market through the power of real time data connectivity.", "Through a set of powerful API and ecommerce solutions we’re enabling instant ordering, advanced analytics and a revolution in payments by creating a new payment rails by turning plastic analogue gift cards into a real-time digital currency.", "We simply couldn't achieve this without our Tech Team."]},
{"url": "https://www.python.org/jobs/2793/", "loc": "Paris, France", "title": "Python Developer - Telecom Security", "job_type": ["Back end", "Front end", "Developer / Engineer"], "descrip": ["P1 Security is looking for an experienced Python developer.\nYou will be working in a medium-sized team of developers, on the following products :", "Your insights are important to us, and your knowledge and decisions will be highly valued for the development.", "Here are some of the tasks that you will do as a PTA/PTF developer :", "You will be working at our office located in Paris.", "P1 Security is looking for :", "Following skills will be strongly appreciated :", "P1 members are french and/or english speaking: Good written and spoken English skills required.", "P1 Security is a pioneer of security vulnerability and intrusion detection technologies for telecom networks.", "P1 Telecom Audit and Monitor are the only solutions available today for the  auditing and monitoring of large scale telecom networks for vulnerabilities and security events.", "P1 Security was founded in 2009 by Philippe Langlois, former founder of Qualys, INTRINsec, Worldnet and the Telecom Security Task Force (TSTF) research forum.", "P1 Security’s team includes former executives of Telecom Italia and Neuf Telecom as well as renowned security researchers who present unique P1 Security research at leading international security conferences. P1 Security has also presented numerous times to the Security Group of the GSMA.", "This company sets itself apart with the qualities of its employees, people making a difference with creative ideas, helpings each other to make those ideas a reality. People like you! This is a job with plenty of opportunities and challenges. We give you the necessary tools and help you make the most of yourself. At the Engineering department we obviously work with agile/scrum, with varying degrees of formality depending on the needs of a project."]},
{"url": "https://www.python.org/jobs/2794/", "loc": "Remote/US, US, US", "title": "Remote Python Django Developer", "job_type": ["Back end", "Cloud", "Database", "Front end", "Integration", "Testing", "Web", "Developer / Engineer"], "descrip": ["Remote Python Django Developer", "Required Qualifications", "Bonus Qualifications", "This is a full-time W2 employee position with the following benefits:", "JBS is a custom software solutions provider based out of the Greater Philadelphia area. At JBS, our employees are distributed geographically and work remotely from home offices. We cluster our staff into project teams and then set them free to do great work within specific guidelines and timetables. The combination of developer accountability and cutting edge development technologies allows us to attract the very best in the business and perform at a high level for our clients."]},
{"url": "https://www.python.org/jobs/2773/", "loc": "London, London, United Kingdom", "title": "Mid to Senior Python Developer", "job_type": ["Back end", "Database", "Image Processing", "Machine Learning", "Operations", "Web", "Developer / Engineer"], "descrip": ["We are looking for someone to work with one of our PHP developers to convert and extend our existing PHP based web crawler into a beautiful Python based crawler amongst many other challenges.", "We want you to write great object orientated Python code, make our web crawlers and browser automation smarter, and do clever things with images and other data.", "Strong Python skills.\nNatural problem solver.\nGreat attitude.\nExcellent communicator.\nExperience with Selenium an advantage but not essential.\nAn interest in Machine Learning.", "Listed in the London Stock Exchange’s ‘1,000 companies to Inspire Britain’ report for three years running we are a leading media specialist working exclusively across the financial industry providing media intelligence, planning and buying. Founded in 2003, we have grown substantially and now boast a global reach and offices in London, Dubai, Hong Kong and Boston (USA)."]},
{"url": "https://www.python.org/jobs/2772/", "loc": "London, United Kingdom", "title": "Mid-Level Python Developer", "job_type": ["Image Processing", "Integration", "Operations", "Systems", "Developer / Engineer"], "descrip": ["Milk VFX is looking to recruit a passionate Python developer with a strong interest in Visual Effects / Computer Graphics.", "You will join our growing Pipeline department. We aim to assist the day-to-day work of the studio, while trying on the long term to design a scalable and reliable system for production and artists to use and rely on. You therefore have to be reactive, be able to quickly identify problems but also be able to design tools, libraries and systems to a high standard, with a focus on usability and reliability.", "You will work closely with the Editorial department to help streamline the whole ingestion, review and delivery processes.", "Milk VFX is a London based visual effects company focused on creating innovative and complex sequences for high-end TV, feature films and VR experiences. Our recent work include Fantastic Beasts and Where to Find Them, Free-Fire, Ex-Machina, High-Rise and popular TV series Sherlock, Doctor Who, Thunderbirds Are Go, etc."]},
{"url": "https://www.python.org/jobs/2763/", "loc": "Enstone, Oxfordshire, United Kingdom", "title": "Software Developer (Aerodynamics)", "job_type": ["Back end", "Big Data", "Database", "Evangelism", "Front end", "Numeric processing", "Testing", "Developer / Engineer"], "descrip": ["An exciting opportunity exists for a Software Engineer to join our Aerodynamics department.", "We are looking to improve our existing software and create ambitious new tools to more efficiently extract and understand results from wind tunnel, track and CFD. Assisting the engineers by developing capabilities to compare car performance data across these three domains in an intuitive and seamless manner.", "The successful candidate will produce clear, maintainable, extensible, scalable code with high performance and quality design that meets or exceeds the needs of the end user.", "The candidate will be organised, methodical and demonstrate the ability to communicate complex ideas with clarity and articulate challenging concepts in understandable terms.", "The ability to write robust tests and write comprehensive documentation is crucial.", "Please apply in writing with current CV, salary expectations, details of your notice period and quoting job reference RSR-UKAER6 to: ", "Applicants must be eligible to work in the UK"]},
{"url": "https://www.python.org/jobs/2779/", "loc": "London, London, Shepherds Bush, United Kingdom", "title": "Senior Software Engineer (Python)", "job_type": ["Back end", "Developer / Engineer"], "descrip": ["We require an experienced Software Engineer with strong commercial experience of Python at Pole Star, to build and maintain our core Python based platforms and services. You’ll work in a talented and interdisciplinary team, with a strong creative culture, and help us deliver high impact work. You will work closely with all facets both in our Boston and London offices.", "Key Responsibilities:", "Technologies we work with are cutting edge and here are some examples below:", "Python\nDjango\nJava\nSpring\nHTML5\nCSS\nVagrant\nREST\nGeoserver", "Essential Skills:\n•       Four or more years of solid commercial Python experience\n•       JSON, REST, SOAP and RESTful Services and API’s\n•       Experience working with a JIRA bug-tracker\n•       Linux/Unix knowledge (Redhat/CentOS/Fedora)\n•       Experience in migrating legacy systems and knowledge of the software development lifecycle\n•       A strong drive and interest to learn new technologies quickly and work in a fast paced software development environment.\n•       Teamworking\n•       Bachelor’s or Master’s degree in Computer Science, Engineering, or related field", "Desired Skills:\n•       Web development: HTML (HTML5 & CSS) and XML/XSL\n•       Knowledge of Geo-Spatial technology or GeoServer\n•       Some database and SQL knowledge, Oracle and/or PostgreSQL, Post GIS\n•       Jenkins, CI integration\n•       RabbitMQ and Redis experience\n•       AWS experience\n•       Docker experience", "Pole Star is a privately owned, London headquartered technology company developing innovative SaaS software solutions and APIs for the maritime, banking & finance and government sectors.", "We serve over 2,500 clients in three industries; Shipping and Offshore, Finance Markets & Compliance and Government.", "For nearly 20 years we have offered the maritime industry cutting edge vessel tracking as well as SSAS and LRIT conformance testing solutions.", "We help our clients in the banking, trade & commodity sectors to manage their financial crime risk with advanced sanctions screening and vessel monitoring solutions.", "Our government clients benefit from comprehensive end-to-end service and the highest levels of reliability, redundancy and scalability.", "Why work for Pole Star?\nAt Pole Star, it takes a wide range of skills to develop, maintain and support the high-quality products for which we have become renowned. Each department, team and individual within the company plays a vital role in that process. From the initial idea to the development, testing and maintenance of products, through to winning the big deals and supporting the customer and our employees, everyone at Pole Star contributes to making the business a success and a great place to work.", "Whether you've just entered the job market, have recently graduated or are already experienced in your field, we will help support you with our employee development programme. By offering you secure employment, a challenging and interesting work environment, on-the-job learning and professional training and development opportunities, we hope to help you achieve your career aspirations and maximize your potential.", "Pole Star is a privately-owned global maritime technology company. For 20 years we have developed innovative SaaS and API solutions for multiple industries. Today, we track over 40,000 ships for clients in over 90 countries, providing 24/7/365 support and world-class service in over 20 languages.", "Our products are enterprise grade, consistently award-winning, and continually evolving to best serve our key market sectors: Shipping & Offshore, Maritime Trade RegTech, and Governments. Our suite of services include a broad range of tracking, security, LRIT, alert systems, and regulatory technologies with the key purpose of increasing efficiency, safety, profitability and compliance at sea.", "From our HQ in London, 6 global offices, and over 50 trusted suppliers, we currently serve 46 governments and thousands of commercial customers. Our diverse multi-lingual, multi-national team are passionate about quality, excellence, and delighting our customers."]},
{"url": "https://www.python.org/jobs/2780/", "loc": "Dublin, Ireland", "title": "Senior Python Developer (Providing Services To Half A Billion Users)", "job_type": ["Back end", "Database", "Evangelism", "Numeric processing", "Systems", "Developer / Engineer"], "descrip": ["This is a senior engineering role with an amazing company based in Dublin City. Everyone knows this company and would want to work for them.", "It is a Python engineering role in Dublin City Centre with a company that provide services to tens of millions of people every day. They are looking for someone who is extremely strong technically from an algorithmic point of view - the role is critical to the companies success.", "If algorithms are your thing, this is definitely the role for you.", "They are a technology-driven company who provide matchmaking, microtransactions, and data analytics for almost half a billion users. Definitely a company to join!"]},
{"url": "https://www.python.org/jobs/2757/", "loc": "San Francisco, CA, United States", "title": "Software Engineer - Python", "job_type": ["Back end", "Front end", "Machine Learning", "Developer / Engineer"], "descrip": ["Why can you lease a car, but not a MacBook? Over half of Americans do not have access to fair and inexpensive credit offerings. We want to change that.", "CSC Generation is creating a world where you can lease any product with residual value.", "Your Responsibilities:", "Working directly with our CTO to build a sophisticated underwriting engine using innovative data sources and machine learning, which approves as many good customers for leases as we can, and rejects fraudsters.", "Blowing through technical debt of companies we acquire by eliminating unnecessary systems, etc...", "Recruiting other 10x engineers. There are only so many productive hours in the day - building a badass team is critical to our success.", "A full-stack engineer with 2+ years of production experience with a strong foundation in Computer Science. BS in CS or EE preferred, but is obviously not necessary if your Github and Open Source contributions speak for themselves.", "Python/Django and JavaScript/Angular experience preferred.", "Extremely detail-oriented.", "A fast learner. We are a start-up and do not have the training infrastructure of larger organizations.", "Has an appreciation for performance tradeoffs and technical debt.", "Has zero tolerance for assholes or politics. Candidates who negatively impact our culture are let go, even if it doesn’t make financial sense to do so.", "Values work ethic, intellectual curiosity, and dedication.", "Open to travel - we have offices in SF, LA, SLC, Austin, and Chicago\n(Chicago office is an hour away from the city but we hope to be moving closer soon)", "By the time Justin Yoshimura turned 25, he was a veteran in the startup world: guiding three companies from start to acquisition and many more as an advisor, mentor and board member. Nevertheless, he had yet to achieve his original dream of building a publicly held Fortune 500 Company, so he founded CSC Generation.", "We are looking for people who are interested in joining us on what is likely to be a very long and difficult journey: building the next Liberty Interactive/IACI/Berkshire Hathaway is going to take decades. If your resume shows that you've \"moved\" every 18 months, it is unlikely that you are a fit."]},
{"url": "https://www.python.org/jobs/2760/", "loc": "Remote, Remote, US", "title": "Web Applications Developer", "job_type": ["Back end", "Cloud", "Database", "Front end", "Integration", "Testing", "Web", "Developer / Engineer"], "descrip": []},
{"url": "https://www.python.org/jobs/2734/", "loc": "Amsterdam, Netherlands", "title": "Software Developer", "job_type": ["Back end", "Database", "Developer / Engineer"], "descrip": ["Are you ready to work in a technology driven team with serial entrepreneurs in the center of Amsterdam?", "Join us to build Europe’s #1 marketing bots platform. Our technology stack consists of Python, AMQP, mongoDB, docker, and React. We work according to Scrum and are big fans of continuous integration.", "Due to our customer growth we are looking for talented software developers to join our Amsterdam based messaging automation startup. We are open for CV’s from worldwide software developers who have experience with Python development and scalable applications.", "Key Responsibilities", "Skills & Requirements", "Bonus Points", "At Maxwell, we believe in offering frictionless commerce through a conversational user interface. With this in mind, we have build our first product, an intuitive chatbot builder that helps marketers grow their business through popular messaging services such as Facebook Messenger. We work with leading brands such as Catawiki, Zalon by Zalando, Hellofresh and many more. Our team builds software with the following principles in mind: domain-driven design, highly componentized application landscape and a test-driven approach with real unit tests.", "What We Offer"]},
{"url": "https://www.python.org/jobs/2736/", "loc": "Anywhere, Remote, Remote", "title": "Senior Software Engineer - Backend", "job_type": ["Back end", "Developer / Engineer"], "descrip": []},
{"url": "https://www.python.org/jobs/2735/", "loc": "Jeddah, Saudi Arabia", "title": "Sr. Python developer", "job_type": ["Big Data", "Cloud", "Integration", "Machine Learning", "Developer / Engineer"], "descrip": ["This is a very flexible job that is project based for independent minded developers.", "We currently are in stealth mode."]},
{"url": "https://www.python.org/jobs/2739/", "loc": "Salisbury, United Kingdom", "title": "Senior computational mathematical modeller", "job_type": ["Back end", "Big Data", "Cloud", "Machine Learning", "Numeric processing", "Researcher / Scientist"], "descrip": ["To provide specialist expertise implementing and developing inferential statistical and mathematical models as high performance computer programs. These will improve the efficiency of decision making in emergency health operations, such as infectious disease outbreaks.", "For a full list of requirements, please see the link below:", "Public Health England (PHE) is an executive agency of the Department of Health providing; strategic leadership, research, advice and support for Government, local authorities and the NHS in protecting and improving the nation’s health.", "The ERD S&T group is a multidisciplinary group that includes infectious disease biologists and epidemiologists, mathematical modellers, behavioural scientists, specialists in geographic information systems, and scientific computing. In partnership with others both within PHE and from outside, we collate data and information from across the world on new and emerging infectious disease threats including potential bioterrorist threats. This information is integrated with a wide range of other UK specific data in order to develop risk assessments and mathematical models and other IT/computer-based applications to assist with emergency planning, training and response functions."]},
{"url": "https://www.python.org/jobs/2741/", "loc": "Codicote, Hertfordshire, United Kingdom", "title": "Mobile Application Python Engineer ", "job_type": ["Cloud", "Database", "Front end", "Integration", "Systems", "Web", "Developer / Engineer"], "descrip": ["Reporting to the Principal Engineer", "This is a permanent position at ETB's offices in the UK.", "European Technology for Business Holdings Ltd. creates technological solutions for healthcare challenges using patented micro sensor technology applied to human and animal movement.  The Company was founded 1997 originally as a research and design consultancy.  In 2010, ETB began development of a commercial gait measurement system for humans.  Today, the Company has two products:  GaitSmart™, a 6-sensor gait measurement system for humans; and Pegasus™, an 8-sensor gait measurement system for horses.", "ETB's products are used worldwide into healthcare; elderly, orthopaedics and sports."]},
{"url": "https://www.python.org/jobs/2742/", "loc": "Dublin, Dublin, Ireland", "title": "Lead Software Engineer - Python", "job_type": ["Back end", "Big Data", "Cloud", "Front end", "Integration", "Lead", "Systems", "Developer / Engineer"], "descrip": ["A lead software engineer with at least 3 years’ experience and advanced expertise in Python is required to lead design and engineering efforts within Parameter Space. The software platforms developed by Parameter Space are built using Python.", "Essential functions", "Mandatory:", "Technologies:", "Experience:", "Desirable:", "Earth Observation satellites are creating data volumes on the order of petabytes. Cloud-based analysis platforms that bring compute to the data are being implemented to deliver services across multiple sectors such as marine, agriculture and environment.", "Parameter Space is currently developing a prototype Platform as a Service (PaaS) to facilitate the exploitation of Earth Observation satellite and in-situ data for a broad user-base and range of applications. Further information can be found at www.parameterspace.ie."]},
{"url": "https://www.python.org/jobs/2737/", "loc": "Waterloo, Ontario, Canada", "title": "Senior Software Engineer", "job_type": ["Back end", "Cloud", "Database", "Front end", "Machine Learning", "Testing", "Text Processing", "Web", "Developer / Engineer"], "descrip": ["IMA Ltd. is in the Material Master Data solution market.  We live and breath manufacturing data and we have been doing so for over 30 years.  So, what does IMA really do anyways?  Well, for starters, we help fortune 500 and fortune 100 companies from around the world govern, organize, and enhance their manufacturing part data.  Manufacturing plants can have hundreds of personnel working with hundreds of thousands of parts everyday.  This part data needs to be accurate and searchable so that their purchasing department can order effectively, maintenance personnel can avoid downtime, and the finance team can track their assets. Sounds logical, but over time large lists of parts can become a daunting task to handle as parts are entered incorrectly, duplicates are added, and incomplete part data makes it’s way into a master item list.", "That’s where we come in.  IMA cleans and improves a customer’s existing material master data using software automation and then provides a SaaS platform called uManage, to implement processes and data validation to maintain their data integrity.  We are looking for talented software engineers to build version 2.0 of our existing platform.  Come work with us as we use modern technologies to disrupt the MRO Data Cleansing industry.", "As a Senior Engineer at IMA, you will...", "Requirements:", "We’re excited to speak to applicants who…", "What We Offer", "We are building a brand-new office in Waterloo, help us grow and have the opportunity to really make a difference.  IMA provides a laid back corporate culture, flex time, and a mentorship program encouraging personal growth. We compensate our employees by offering a competitive salary, benefits, and other various generous perks.  You’ll get the chance to work with some of the world's most recognizable brands whilst working with some of the newest technologies in the industry.", "IMA is an equal opportunity employer, committed to supporting a culture of diversity and accessibility across the organization.  All qualified applicants will receive consideration for employment without regard to race, color, religion or belief, social or ethnic origin, gender, sexual orientation, national origin, disability, or age."]},
{"url": "https://www.python.org/jobs/2743/", "loc": "London, London, UK", "title": "Python Developer (Data Science/ML)", "job_type": ["Back end", "Database", "Machine Learning", "Testing", "Text Processing", "Developer / Engineer"], "descrip": [" is looking for an experienced Python developer to work as part of our data science team based at our London Bridge offices in London, UK.", "You will work closely with our technical engineering team reporting jointly into our Chief Technology Officer and our Chief Data Officer. You will be responsible for building stable, production ready, performant products which will underpin our primary business proposition.", "As part of our data science team, you can expect to be working on projects with a diverse toolbox. We are already working with data cleansing; lexical analysis; NLP; semantic analysis; classification and machine learning. Training and mentorship in all these technologies will be provided where required. Your own experience and opinions will be very important in helping us build industry leading data-led solutions.", "This is a greenfield opportunity for someone who is able to contribute at the very core of the business. You should be able to deliver solutions that are robust, highly testable and which adhere to best practice software development methodologies in an agile environment.", "It might also be beneficial to have:", "Founded at the end of 2016, we are a well-funded startup, working on exciting data-focused solutions within the commercial real-estate market in the UK. We have a diverse and dynamic team designing and building interesting products for launch in 2018 and beyond."]},
{"url": "https://www.python.org/jobs/2745/", "loc": "Munich, Germany", "title": "Python (Django) Web App Developer", "job_type": ["Back end", "Database", "Front end", "Developer / Engineer"], "descrip": ["Take responsibility for success of challenging projects;\nDrive the implementation from specification to QA;\nCollaborate with the team.", "What do we expect from you?", "Experience in development of job applications 2+ years;\nExperience in Python;\nStrong knowledge of JavaScript, AJAX (EmberJS);\nExperience with databases (PostgreSQL)\nFamiliarity with TDD;\nFamiliarity with HTML & CSS;\nFluency in English.", "What do we offer?", "Flexible hours;\nLearning development;\nFree snacks, fruit and drinks;\nTeam breakfast;\nBeer O’clock;\nForeign languages classes;\nTeam events;\nSport groups;\nAdventure days", "The company is the leading guest feedback platform in the world. Their goal is to improve the travelling process from finding the best hotel to spending the best stay. So, the company collaborates with hotels and travel websites all over the world. The system analyzes hundreds of millions of travels reviews and transforms it into data visualizations for hotels all over the world.\nYou’re supposed to be a part of a great international team with experience in machine learning, natural language processing and big data technologies. We’re looking for the person who is keen on researching, prototyping and finetuning algorithms to solve novel problems to join the team. The team will encourage you to take on responsibility."]},
{"url": "https://www.python.org/jobs/2750/", "loc": "New York, NY, USA", "title": "Python Developer", "job_type": ["Finance", "Developer / Engineer"], "descrip": ["Description", "We are looking for developers to support a portfolio analytics and intelligence platform for institutional investors. This is a client-facing role with tremendous opportunity for growth. You will be tuning and modifying our home grown application for our client’s needs, and resolving any necessary fixes.", "Requirements", "Python development and extensive knowledge of Python libraries\nExperience with a relational database\nExperience in Linux/Unix command line shell (Bash, ZSH, KSH, etc.).\nBS or MS degree in a STEM field", "Preferred Skills", "Financial Markets knowledge is a huge plus.\nStrong preference for a candidate with Java experience.\nKnowledge of SQL and Oracle PL/SQL functions, procedures & packages.", "Hedge Fund analytics platform"]},
{"url": "https://www.python.org/jobs/2747/", "loc": "Redruth, Cornwall, United Kingdom", "title": "Python Developer", "job_type": ["Back end", "Cloud", "Database", "Integration", "Management", "Numeric processing", "Systems", "Testing", "Developer / Engineer"], "descrip": ["About the Python Developer job", "We are looking for a Python developer to join an existing Agile software development team.", "Developers with commercial experience in similar or related languages will fit in well.", "This role will involve working on the backend of a very exciting and cutting edge web application, in the cloud arena, for one of the largest companies in the world.", "Benefits of working at Headforwards:", "Enhanced company pension\nFun monthly team socials (Beach BBQ’s, Laser Tag, Film screenings, Rugby trips etc.)\nEnd of summer company festival – Headstock\nHeadtalks – monthly internal technical ‘conference’\nFresh fruit\nCorporate gym membership rates\nChild care vouchers\nSalary sacrifice bike scheme", "Hours:", "Monday – Friday\n0900 – 1730 with a one-hour lunch break.", "Location:", "Near Redruth, Cornwall, UK", "Salary: £25,000 – £45,000. Dependent on experience.", "Looking for a different role? We have other positions available.", "Our Application Process - To help prospective employees understand our process, we have a breakdown of our application process on our careers site.", "This is a \"Rolling Recruitment Programme\" and the closing date for this vacancy is the last day of October 2017.", "Recruitment Agency?", "We do not accept CVs or assistance from recruitment agencies. We have a dedicated internal recruitment team who fully manage the acquisition and assessment of all new applicants. Any CVs submitted to us become the property of Headforwards Solutions LTD. We have the right to hire applicants without paying any fees to the submitting party.", "Essential experience and attributes:", "Python development experience (or experience with similar/related languages)\nTeam worker\nProblem Solver\nAbility and desire to learn\nOptional experience", "Some knowledge of non-relational (NoSQL) databases (we use MongoDB, Redis, InfluxDB)\nSome knowledge of front-end technologies (HTML, CSS, JavaScript)\nUnderstanding of the web application stack\nExperience working with development team tools (e.g. continuous integration systems (we use Jenkins) and version control systems (we use Git)\nWe are working with some pretty cool new technologies, which we don't expect you to have experience of. However, if you do, please let us know. For example, Docker containers, Kafka, Elastic Search, MongoDB, InfluxDB...", "About Headforwards:", "We are an outsource software development company based in Cornwall, South West England. Cornwall is fast becoming a hub for Agile software development. It is home to the renowned Agile conference Agile on the Beach. It was also ranked as the second fastest growing Tech Hub in the UK in the 2016 Tech Nation report.", "Our outsourcing model of putting together dedicated teams to work solely for one client on long-term projects is proving to be extremely successful. In just 6 years we have grown to a team of over 100 people, doubling in the last year alone and we show no signs of slowing down.", "You will be joining an organisation that has a well-established company culture that revolves around valuing people and being a team. Take a look at the Headforwards Team Adventures page for an idea of what we get up to. We were also recently named Cornish Business of the Year at the 2016 Hub Awards, and we won 3 awards at the Cornwall Business Awards 2017.  Best Dynamic Growth Business, Young Business Person Of The Year and Winner of Winners."]},
{"url": "https://www.python.org/jobs/2749/", "loc": "BELGRADE, PRAGUE,BERLIN, Serbia, Czech republic, Germany", "title": "SENIOR FULL-STACK WEB DEVELOPER - LIVE BLOG ", "job_type": ["Back end", "Front end", "Developer / Engineer"], "descrip": ["Sourcefabric is a nonprofit that builds open-source tools for media organisations all over the world. We're looking for an experienced full-stack web developer to join our Live Blog team.", "Live Blog is an open-source web app that allows journalists to include text, multimedia and social media snippets into a series of blog posts that become a structured timeline for moment-by-moment news coverage. It is a creative, digitally native format that is being used by major media organisations such as Germany's national news agency dpa, Zeit Online, NZZ, Rheinische Post, and others.", "What we offer\nWe offer a position in a highly international organisation of interesting and cool people, with projects and staff on nearly every continent.\nWe also invite you to work in a small and highly nimble team that likes to move quickly. We’ve got big plans for Live Blog in the next six months.\nIf you have an interest in new forms of online journalism, this position will certainly give you some great insights. Our developers often visit or interact with newsrooms directly, consulting with them on how to make the most of our tools.", "Contact us\nIf you’re interested in this position, please send your CV, a short motivational letter, and examples of projects you’ve worked on to jobs(at)sourcefabric.org.", "Wait for us to reply. Even if we don’t think it will be a good fit for the both of us, we will get back to you!", "Sourcefabric is Europe’s largest developer of open source tools for news media. Headquartered in Prague, Czech Republic, Sourcefabric z.ú. brings together minds from all corners of the globe to promote media development through the creation of open source software. All of our tools are open source and free to download: Superdesk, Newscoop, Booktype, Airtime, Live Blog, and Citizen Desk.", "We work with some of the most prestigious news organisations around the world and our goal is to become a household name in newsrooms everywhere.", "Through Sourcefabric and its daughter companies, we offer a range of services from managed hosting (SaaS) and support, to bespoke feature development and integration into existing workflows. Our international list of clients includes online-only and multi-channel newspapers, radio stations, self-publishing and print-on-demand service providers as well as NGOs and news agencies.", "Sourcefabric develops and maintains a strong media development portfolio which has enabled us to work in some of the most challenging political environments since our inception in 2010. In this way, our open source code is our contribution to the dissemination of free speech. As a nonprofit organisation, we solicit grants and funding on a project-by-project basis."]},
{"url": "https://www.python.org/jobs/2746/", "loc": "Dublin, Ireland", "title": "Senior Python Developer", "job_type": ["Back end", "Front end", "Integration", "Lead", "Operations", "Systems", "Testing", "Web", "Developer / Engineer"], "descrip": ["I am working with an exciting south Dublin based client who are building an innovative risk based platform. The ideal candidate will have excellent programming skills with a focus on quality, performance, extensibility and maintainability of code.", "We are looking for a dynamic, skillful and enthusiastic person to join our client who takes ownership for their work, is committed to building high quality, extensible code and who has experience working within an agile software development team.", "The role:", "Design and developing code with performance optimization, extensibility and maintainability in mind\nOwn and drive development tasks that you are involved in, participating and supporting your agile development SCRUM team. Provide support to the business for critical issues.\nFunctionally and Unit test all developed code to a very high standard to enable QA to test efficiently", "What You Need:", "Desirable:", "Unfortunately due to the urgency of this role we cannot consider work permits or visa applications.", "If you are interested in hearing more than get in touch by sending an email to ", " or calling Richie on 00353-(0)1-6741413."]},
{"url": "https://www.python.org/jobs/2751/", "loc": "Carmel, Indiana, United States", "title": "Software Product Engineer", "job_type": ["Back end", "Big Data", "Cloud", "Database", "Front end", "Systems", "Web", "Developer / Engineer"], "descrip": ["Rook Security is currently hiring for a Software Product Engineer at our Carmel, IN office. Our opportunities involve cutting edge technologies ranging from advanced systems development, implementation of emerging web technologies, storage and mining of big data, and cloud automation design. We believe in taking an agile approach with a focus on improving ourselves and our products every day. You will have the opportunity to work with our products from their inception to release to ensure stability, reliability, and scalability.", "As one of the fastest-growing small businesses in our industry, you will have ownership in the development of tools and systems that will help lead the security industry. You will be a key contributor in protecting our community and the peace of mind of our clients.", "Primary Responsibilities:", "Work with engineering team to create innovative solutions to technically challenging problems in the Information Security space\nDesign, implement, and maintain highly performant systems and large scale scale services\nIntegrate with existing data stores & third-party applications\nLeverage machine learning to detect anomalies in data\nProduce cleanly designed code that is testable and reliable\nPassion for understanding, exploring, and experimenting with emerging technologies\nKnowledge sharing through internal symposiums and external meetups\nProvide detailed and constructive design and code reviews\nCreate clear documentation of design and implementation of software solutions\nThe Job Description is intended to be a general representation of the responsibilities and requirements of the job. However, the description may not be all-inclusive, and responsibilities and requirements are subject to change.", "Required Qualifications:", "Prefered Qualifications:", "Headquartered in Carmel, IN, Rook Security is a global provider of IT security solutions protecting against dynamic emerging threats. Rook’s consulting and managed security services deliver visibility, intelligence, and response in security operations to overcome the complex problems that continue to plague most organizations. As an integrated extension of their client’s internal teams, Rook helps organizations achieve a mature security and risk management program. Rook's consulting and managed security services have helped to improve the way organizations from start-ups to Fortune 100 firms protect their data and manage their risk. For more information, join us on Twitter @RookSecurity, Facebook, or www.rooksecurity.com."]},
{"url": "https://www.python.org/jobs/2754/", "loc": "Mountain View, CA, United States", "title": "Director of Engineering", "job_type": ["Back end", "Big Data", "Cloud", "Database", "Evangelism", "Front end", "Integration", "Lead", "Machine Learning", "Management", "Numeric processing", "Operations", "Systems", "Testing", "Text Processing", "Web", "Manager / Executive"], "descrip": ["Director of Engineering", "Boston (area), MA\nFULL-TIME", "Company Background:\nActivePrime is a dynamic entrepreneurial SaaS company providing CRM Data Governance solutions to Enterprise level organizations.  We are seeking a Director of Engineering & Full-Stack Engineer to help us continue building out our solution set.  The Director of Engineering will be a hands-on technical architect & developer with our full stack of technologies while providing direction and leadership to the technical team.  A major responsibility for this role is internal and external communication about timelines.", "This is a partial-telecommuting (maybe a couple days/week from home depending on team progress) position.  In-person, as well as remote management will be part of the job. This person will lead the Boston-based engineering office for ActivePrime.  The Director of Engineering will support our goals to stay on-time and within budget.   It’s a creative role involving some product management to define builds that are predictably achievable within a timeframe.   This role is ideal for a person who enjoys operating as both an individual contributor, as well as a team manager.  Our employees enjoy independence in a quickly changing environment; no two days are the same.  At our company, there’s an abundance of opportunity to make a difference in a fast-paced competitive marketplace.", "Responsibilities:", "Lead full life-cycle software development\nDrive the development process through design, implementation, and deployment\nWork closely with the executive team to develop a software roadmap for future features and improvements\nMentor team members, encouraging career and personal growth\nEnsure your team meets deadlines and launch dates through an effective sprint planning process and daily standups\nCollaborate effectively across teams, including outside of engineering\nFront-end Javascript, HTML, CSS development.\nBack-end Python3 development to support existing and future ActivePrime products.\nModify Nginx configurations as needed.\nAssess and recommend new technologies, libraries, and modules to build and enhance ActivePrime products.\nRecommend infrastructure to increase the automation used to manage ActivePrime services.\nProvide assistance with development operations\nChanging server configurations\nInstalling code and 3rd party libraries on production and test instances.\nDebugging running services", "please email resume & cover letter to hr AT activeprime.com\nnote - applications without a cover letter will not be considered", "Qualifications:", "B.S. or M.S. degree in Computer Science or a related technical field.\n5+ years of development experience and 2+ years of experience leading a team of 5-10 engineers\nCustomer focused.\nComfortable making quick decisions, when possible\nFamiliar with Python, Flask, Zurb, JQuery, JSON, REST, OAuth, Postgres, Salesforce.com, Act-On, Zendesk, Jira, Linux and git\nStrong foundation in software architecture and design\nLeadership in progressive software development practice evaluation and analysis with the ability and desire to improve processes\nAbility to work collaboratively with other engineers and senior professionals across functions; have strong influencing and leadership skills.\nSolid experience leading & motivating engineers.", "Desired Characteristics:", "You are an excellent listener and naturally engage in reflective listening\nYou have excellent written communication skills, both inward and outward facing\nYou express empathy, and that helps your ability to influence others.\nYou are clear, concise, and comfortable developing and presenting information to executive-level audiences\nYou are current in the state of the art technologies and talent\nYou are a long-term planner and creative short-term executor\nYou are able to deal with ambiguity in a fast-paced dynamic environment\nYou are innovative, curious, adaptable and can get things done in a timely fashion", "ActivePrime is a dynamic entrepreneurial SaaS company providing CRM Data Governance solutions to Enterprise level organizations.  We are seeking a Director of Engineering & Full-Stack Engineer to help us continue building out our solution set.  The Director of Engineering will be a hands-on technical architect & developer with our full stack of technologies while providing direction and leadership to the technical team.  A major responsibility for this role is internal and external communication about timelines."]},
{"url": "https://www.python.org/jobs/2752/", "loc": "London, United Kingdom", "title": "Python / full-stack Developer", "job_type": ["Back end", "Database", "Front end", "Developer / Engineer"], "descrip": ["We're looking for full stack devs who want to work in a small developer team (currently 4!). We’re looking for core members of the team who want to work on a wide range of projects (we’ve built everything from stock exchange algos to mobile backend solutions) that you find interesting; our current projects are in the edtech, medtech and fintech space.\nWe’re looking for people who are proactive and able to work with initiative and independence.", "Devs should be comfortable with a few of these technologies:\nPython\nFramework -> Flask - Blueprints + Jinja2 + WTForms\nDatabase -> PostgreSQL and MongoDB\nFront End UI -> Bootstrap + React.js + Ajax\nWebsockets / Docker\nOur work flow follows a SCRUM methodology and using Trello, Slack and GitHub.", "Whitespace Ventures started as a VC firm, investing in early stage startups and helping them grow. The core Whitespace team are all developers and were able to help investee companies scale out their products. We got so good at building out software that we started getting approached by established corporates and are having to turn down work. We are now looking to build out our internal dev team to build out various products and work with some larger corporate clients while staying true to helping early stage companies build out their products.", "One of our key products is myOS, an appstore for the web. With apps, companies can perform a range of functions from incorporating a company to completing an IPO.  What makes this project cool is that we’re designing a simple tool system that allows tools to be built by anyone, including non- technical people. Though enterprise focus is our start, we want to roll it out to general consumers in the long-run."]},
{"url": "https://www.python.org/jobs/2758/", "loc": "Tampa, Florida, United States", "title": "Software Engineer Python", "job_type": ["Back end", "Database", "Front end", "Operations", "Systems", "Web", "Developer / Engineer"], "descrip": ["Day to Day:\nAutomate use Python to get information, present and receive date, using web services  within a large enterprise environment with the security division.", "Summary:\n•       Current process is manual today, need to automate Database and administrative tasks.  There is no front end and no UI to perform operations.  Most of the work will be new development and occasional assisting with the existing code.", "Technologies:\n•       Python, Oracle DB, Linux O/S, HTML, CSS, JavaScript, AWS", "Digital Intelligence Systems, LLC (DISYS) is a global staffing and IT consulting services company", "Our vision is to be a global business partner, delivering highest quality and most consistent services at the best value to clients worldwide.", "Incorporated in 1994 as a certified Minority Business Enterprise, DISYS is one of the largest IT staffing firms in the US according to a report by Staffing Industry Analysts. DISYS is headquartered in McLean, Virginia, with offices and delivery locations worldwide in North and South America, Europe, and the Asia Pacific region."]},
{"url": "https://www.python.org/jobs/2720/", "loc": "New York, New York, United States", "title": "Full Stack Engineer (Frontend Focus)", "job_type": ["Back end", "Cloud", "Database", "Finance", "Front end", "Integration", "Systems", "Testing", "Web", "Developer / Engineer"], "descrip": ["You’ll help financial institutions better their customer experiences and transform themselves into mobile, digital institutions. You’ll work closely with the founders while working on the development of either the web (Django + Vue.js) or mobile platforms (Django + React Native). As an early stage employee, you’ll be expected to work up and down the stack, wear several hats, and make many decisions independently. As a SaaS provider to banks and credit unions, security and reliability are a top concern. So while we like to move quickly, you’ll be expected to take part in code reviews, audits, and testing. You’ll work with modern programming languages / frameworks, but will also have to work with integrations to banking legacy systems that still run on mainframe computers and archaic payment schemas.", "Minimum Qualifications", "Preferred Qualifications", "We are helping 10,000+ banks and credit unions transform themselves to better attract, retain, and engage their customers through a white labeled, SaaS based online banking, mobile banking and open banking API solution. We were founded in mid-2016 and have seen quick growth thanks in part to awesome investors like Techstars."]},
{"url": "https://www.python.org/jobs/2722/", "loc": "Remote, Europe", "title": "Senior Python Web Developer (f/m)", "job_type": ["Back end", "Cloud", "Database", "Web", "Developer / Engineer"], "descrip": ["At ÜberResearch, we are looking for a capable Senior Python Web Developer and are offering a place in an experienced and well skilled technical team, a clear vision of the technological and engineering excellence we are aiming for, and the exciting setting of an agile start-up working on both sides of the pond.", "ÜberResearch is providing sophisticated domain specific search functionality to its customers. Our UI needs to provide convenient access to complicated and effective search features, which will be customized on a per customer base.", "Responsibilities", "ÜberResearch is a software solutions company focused on helping funding and research organizations, non-profits, and governmental institutions make more informed decisions about science funding. Our solutions provide better views of the organization’s grant data, peers’ activities, and the data of the funding community at large. More and better data combined with proven analytical techniques provides a new look at grant portfolios of different funders, in addition to and going beyond publication databases.  ÜberResearch has offices in Germany, the US and the UK, serving clients globally.", "For more information please contact us at or send your application to ", "."]},
{"url": "https://www.python.org/jobs/2725/", "loc": "Cambridge, MA, USA", "title": "Python/Django Software Engineer", "job_type": ["Developer / Engineer"], "descrip": ["MORSE is looking for Pythonistas to help us build a big data storage and analysis website. We strive to be as Pythonic as possible, with test-driven-development (TDD) guiding us. We hit 100% unit testing coverage wherever possible (we are at 96.7% overall for the system now).", "The Python/Django Software Engineer will be focused on testable design and implementation of software in a Django environment. The engineer will participate in reviews of their designs and others’ designs, and in code reviews using pull requests. Additionally, the engineer will be writing some HTML/CSS/JavaScript. Creative candidates who want to make an immediate impact will thrive in the MORSE environment.", "Additionally, the candidate must be eager to learn new technologies and stay on top of the latest trends. The candidate will work on a team developing new code bases that are heavily object-oriented, extensible, and maintainable. Therefore, the candidate must have a tacit understanding of design patterns and anti-patterns; polymorphism and encapsulation; high cohesion and low coupling; and the different strengths and weakness of various programming languages.", "US CITIZENSHIP REQUIRED or the ability to obtain a U.S. Security Clearance", "Expertise in Python 3", "Expertise in Django", "Proficiency in relational databases", "Proficiency with HTML, CSS, JavaScript, ReactJS, and Angular 1", "Experience with version control systems Git and Subversion", "Experience with Agile development (Scrum or Kanban)", "BS or MS (preferred) in computer science or equivalent degree, or significant professional experience", "Tired of writing login pages and designing shopping carts? Tired of e-commerce? Want to do something important? If so, then being a software engineer at MORSE Corp may be for you. MORSE Corp is an exciting small business located in the technical hub of Kendall Square in Cambridge, Massachusetts. We are an employee owned company that provides customer-focused algorithm and software development services. We focus on developing leading edge technology in robotics, autonomous air and undersea vehicles, and coordination of human teams."]},
{"url": "https://www.python.org/jobs/2756/", "loc": "London, London, United Kingdom", "title": "Back-End Developer", "job_type": ["Back end", "Cloud", "Database", "Web", "Developer / Engineer"], "descrip": ["We're looking for a full time back-end developer to join our team.", "In this role, you'll be the sole back-end developer, and will develop new projects while maintaining existing ones. You’ll build new features and work to improve existing sites, and will be responsible for fixing issues that have been flagged up by clients and partners.", "You’ll collaborate with a front-end developer and a designer on all of our projects, from start-to-finish.", "Responsibilities", "Code & invent", "You'll spend most of your time coding, so we expect you to enjoy it! We expect you to always be on the lookout for new solutions and best practices that you can apply to our projects. We use modern tools as much as possible, and always do our best to make our developers' work as smooth, painless, and efficient as we can.", "Maintain & improve", "Our existing projects need to be maintained and improved from time to time to take advantage of new technologies, accommodate new features, and have pesky bugs squashed.", "Think & innovate", "We'll always want you to come up with new ideas – and not just regarding your specific role and skillset! Being a small and flat company, we all work together to try and innovate as much as possible. Our tech stack is always evolving, and we want your inputs and suggestions to help us develop!", "Be proactive", "Don’t expect to be told what to do all the time! You’ll have time to work on your own tools and projects, and will have opportunities to share your work with others in the company. We dedicate a few hours every week to personal projects, and we like to share the code for our projects as much as we can, following the OSS standards.", "Be involved", "Most of all, we want you to be passionate about what you do, and to share that passion with us! We all are engaged with our work and happy to be working on meaningful projects, and we hope you'll feel the same!", "Skills & experience", "Required", "As a back-end developer, we expect you to have:", "Even better if you have the following:", "We’re an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, gender, sexual orientation, religion, age, or disability status.", "Small Media is a young but rapidly growing organisation based in London that works to improve the flow of information in closed societies. We are a vibrant, hard-working, and diverse team of designers and developers that collaborates with researchers, journalists and bloggers to take on real problems in creative ways.", "About us", "Small Media is an action lab, providing digital research, training and advocacy solutions to support the work of civil society actors that provides assistance to at-risk communities globally.", "Our approach is grounded in a focus on innovation and local leadership, and on fostering partnerships to accelerate the progress of social impact initiatives.", "What We’re Building", "Our projects are incredibly varied, but innovation is at the core of everything we do. Over the past year we’ve designed and developed an interactive website telling the stories of Syrian women refugees, collaborated with another design lab to produce an animated graphic novel about sexual health in Iran, and launched a trilingual learning platform for journalists and civil society activists across the MENA region."]},
{"url": "https://www.python.org/jobs/2729/", "loc": "London, London, United Kingdom", "title": "Python developer", "job_type": ["Back end", "Cloud", "Database", "Front end", "Lead", "Machine Learning", "Systems", "Testing", "Web", "Developer / Engineer"], "descrip": ["Use your tech skills for social good! Help build a world beating platform to match people who need care with those who provide it, without exploitation.", "We work in a Agile (XP+TDD) team in Old Street, London. You will be working closely with a fun and talented team of front and back end developers. The company is pre series-A which means you can make a real difference to the technology and direction. Everyone gets their hands dirty and there are no silos allowed.", "We offer a competitive salary and share options.", "Required:", "Bonus:", "SuperCarers is an online platform where families can find trusted local carers for the people they love. We provide families with simple digital tools to manage the scheduling, logistics and payment of care directly with a carer, bypassing the high overhead costs of agency middlemen."]},
{"url": "https://www.python.org/jobs/2727/", "loc": "Framingham, MA, US", "title": "Senior Test Automation Engineer", "job_type": ["Testing", "Developer / Engineer"], "descrip": ["We are seeking a talented individual with an appropriate level of experience and interest in Software Validation Automation. You will be working with a team that has a tradition of creating market leading speakers and award winning headset products.", "As an embedded automation team member, you will help guide our future expansion in automation to extend Bose’s tradition of excellence by ensuring that software enabled wireless products are robust and reliable and that they will work well with source devices (e.g. phones, tablets, mp3 players, laptops).", "You will work with engineers to support all phases of the software development lifecycle, from product inception to start of production and beyond. You will be tasked with providing potential solutions to new technologies and new features. Support will include demonstration interfaces and manufacturing API’s.", "Responsibilities:", "Design and implement Python code for new or existing automation framework components including interaction with mobile phone, sending commands to embedded products, fixtures, logging, reporting, etc.\nDesign, implement and execute test procedures for wireless headphone and mobile speaker products.\nDevelop automation test scripts to automate manual test cases.\nFollow best practices and ensuring coding standards\nSupport team direction to best implement continuous integration and automated overnight build testing\nSupport all phases of the software lifecycle including requirements analysis, testing, release validation, and documentation\nUtilize test case management and issue tracking systems.\nCollaborate across the organization with a desire to teach and learn from others.", "Qualifications:", "BSEE/BSCS/BSCE with a minimum of 3 years of Python Experience.\nExperience working with Embedded product automation\nExperience with test management tools (JIRA, Testrail, etc.) and source code management (SCM) tools (Subversion, Git, Jenkins, etc.)\nExpertise with Bluetooth, Wifi, or other networking protocols.\nDemonstrate strong troubleshooting and root cause analysis skills\nStrong oral and written communication skills.", "BSEE/BSCS/BSCE with a minimum of 3 years of Python Experience.\nExperience working with Embedded product automation\nExperience with test management tools (JIRA, Testrail, etc.) and source code management (SCM) tools (Subversion, Git, Jenkins, etc.)\nExpertise with Bluetooth, Wifi, or other networking protocols.\nDemonstrate strong troubleshooting and root cause analysis skills\nStrong oral and written communication skills."]},
{"url": "https://www.python.org/jobs/2726/", "loc": "Coffs Harbour, NSW, Australia", "title": "Full Stack Python Developer (relocate to Coffs Harbour, Australia)", "job_type": ["Back end", "Cloud", "Database", "Finance", "Front end", "Integration", "Lead", "Management", "Operations", "Systems", "Testing", "Web", "Developer / Engineer"], "descrip": ["We're looking for a full stack Python developer in Australia who is willing to relocate to beautiful Coffs Harbour.", "The role involves 2-days per week working on a client's in-house python web app doing bug fixes, enhancements/new features & high-level support.", "The remainder of the role will involve working on various in-house tools & automation for our IT services business and also a greenfields SaaS product. This all be Python work with the Zato SOA Framework and Django for the front-end web application, as well as working on the front-end side in HTML/CSS/JavaScript etc.", "Full details can be found in our job ad here:\n", "However, please contact me directly if you're interested and we can arrange a chat.", "We need someone who is highly experienced with Python (and related web frameworks) and front-end development.", "C3 Group is a leading regional-based Information and Communications Technology (ICT) company providing professional services to small and medium-sized organisations throughout Australia."]},
{"url": "https://www.python.org/jobs/2728/", "loc": "New York, New York, United States", "title": "Vice President of Software Development", "job_type": ["Back end", "Big Data", "Cloud", "Database", "Finance", "Front end", "Integration", "Lead", "Management", "Systems", "Web", "Manager / Executive"], "descrip": ["Our highly successful Fintech startup is rapidly expanding and we need more great people stat!", "You’ll closely manage a small team of onshore and offshore software developers and QA resources. Hands on experience coding and architecting applications written in Python/Django, ReactJS among other JavaScript libraries, CSS3 and HTML5 is needed. You’ll also work closely with the team to productionalize Python analytical programs created by our Data Science Team. This is a brand new position that reports directly to our CTO.", "Key skills:", "If you’re an entrepreneurial, high-energy technical leader ready to motivate and mentor a growing team, this is a great opportunity for you. Come join us as we get ready to launch our new, game-changing BI platform.", "Who we are:", "FXCintel’s offerings provide solutions in a variety of areas, including, Market dynamics, sizing and landscape, Brand positioning, Market entry strategy, Customer acquisition, Pricing, Customer profiles, Benchmarking.", "We serve customers who touch all aspects of the international payments and FX space. Our goal is help all these organisations significantly deepen their understanding and capabilities within the space. Our unique datasets and analytics tools ensure every user of our product can gain a unique set of value for their own use case.", "What we are building:", "FXCintel is a market intelligence company with a sole focus on high grade, independent, real market data on the FX and International payments sector.", "We are based in the global financial centers of London and New York, and own FXcompared.com, the leading independent money transfer comparison website. We were the first website to offer a money transfer comparison and we provide the most in-depth analysis and broadest of products to compare.", "FXcompared strives to be the most trusted and best informed money transfer experts, offering both businesses and individuals timely and relevant information in the space. The division is comprised of economists, FX experts and analysts dedicated to producing beneficial research and data on the money transfer industry.", "FXCintel’s offerings provide solutions in a variety of areas, including, Market dynamics, sizing and landscape, Brand positioning, Market entry strategy, Customer acquisition, Pricing, Customer profiles, Benchmarking."]},
{"url": "https://www.python.org/jobs/2713/", "loc": "London, United Kingdom", "title": "Senior Software Engineer - Python", "job_type": ["Developer / Engineer"], "descrip": ["Bloomberg Enterprise Content data products drive the financial industry. Enterprise Content is a rapidly growing business that provides clients with rich programmatic access to the best financial data and services in the industry. Our products span a wide variety of asset classes and data products including Pricing, Corporate Actions, Regulatory and Reference data content sets (", "). We build high-performance systems that feed billions of data points per day to our customers that include key financial players.", "Given our rapid growth globally, we are setting up a new team in London to build out the next generation of our data request model. This team will focus on building components via a microservice architecture as distinct resources with RESTful API access. Flask (", ") and React (", ") are used to drive a RESTful web interface for clients. We utilize Ceph (", ") and PostgreSQL (", ") on the backend to manage the storage and search operations.", "We interact very closely with our business and sales teams using agile development. We have many opportunities to design and develop innovative solutions to accomplish ever-growing customer requirements.", "We'll trust you to:", "As a developer, you’ll have the opportunity to work with a huge array of technologies developed primarily in Python, along with C++, Java, Javascript and SQL as needed. Additionally you’ll gain experience with Flask, RabbitMQ, Celery, Git, Jenkins, Robot Framework, PostgreSQL, Openstack, Chef, dpkg – whatever technology it takes to get the job done. Our work atmosphere is fast paced, high-energy and friendly.", "You'll need to have:", "We'd love to see:", "We are extremely proud of our diverse and open culture, and value diversity of thought and perspective in every form. We're looking for engineers with a real passion for writing reusable, efficient solutions to complex problems, who can adapt to an ever-changing market landscape, and who can collaborate and work effectively on small teams to develop software that impacts thousands of power users around the world. If this sounds like you, please apply below!", "To find out more about Engineering at Bloomberg, check out www.bloomberg.com/careers/technology/engineering/.", "Bloomberg is an equal opportunity employer and value diversity at our company. We do not discriminate on  the basis of race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran  status, or disability status.", "Every day, trillions of dollars pass through the Bloomberg Terminal. As a result, hundreds of thousands of financial professionals rely on our 500 enterprise applications to manage their portfolios, execute their trades and analyse the markets.", "As engineers, we're the ones who build the applications our clients rely on to not just stay informed, but stay ahead of the market. We connect supply and demand across all asset classes on worldwide exchanges. The applications and infrastructure we build embody the speed, agility and financial data that makes Bloomberg the go-to for financial professionals across the globe."]},
{"url": "https://www.python.org/jobs/2707/", "loc": "Coffs Harbour, NSW, Australia", "title": "Python Developer", "job_type": ["Back end", "Front end", "Systems", "Web", "Developer / Engineer"], "descrip": ["Due to ongoing growth, we are currently seeking an experienced full stack Python developer to join our team. The position is a 12 month fixed term contract but we expect it to become a permanent position.", "This role is varied and will see you work on our internal and customer facing projects at our offices, and enhance a large, in-house financial application for one of our clients on-site. In addition, you will be called on as an escalation point for support issues relating to these software projects.", "Several years experience in Python web development and related technologies.\nA keen interest in clean, reusable code and effective testing.\nProven experience with large, complex web apps.\nFront-end skills - HTML, CSS, Javascript.\nSome exposure to liaising with clients directly to define and refine business\nrequirements and specifications.\nExperience with Linux servers, working with API's etc would be highly regarded.", "C3 Group are a leading regional-based Information and Communications Technology (ICT) company providing professional services to small and medium-sized organisations throughout Australia.", "Why join us?", "Relocate to beautiful Coffs Harbour.\nWork with a dedicated, dynamic team of professionals.\nAccelerate your career with unrivalled career opportunities", "You will be working within a supportive team, friendly team with a strong focus on professional and personal development, and work with a company who are serious about providing the best IT services in the industry."]},
{"url": "https://www.python.org/jobs/2699/", "loc": "Christchurch, South Island, New Zealand", "title": "Senior Software Engineers", "job_type": ["Back end", "Cloud", "Database", "Integration", "Lead", "Machine Learning", "Numeric processing", "Systems", "Testing", "Web", "Developer / Engineer"], "descrip": ["We are looking for experienced Software Engineers to fill a number of product development roles in our Christchurch, New Zealand R&D team.", "Tech Stack", "Our technology stack is based on a wide array of open source tech mostly written in Python. We are looking for junior, intermediate or experienced Python developers but Don’t worry if haven’t coded in Python yet, as we have many developers who started off in C# or C++.", "We are an agile development company using state of the art tools like JIRA, GIT and TeamCity to tackle complex problems backed up by code reviews and lots of exploratory and automated testing.", "Benefits", "We value our staff and offer a range of benefits such as medical insurance, fresh barista coffee, delicious craft beers for Friday treat, regular BBQs, food and daily snacks, gym… and did I mention food?", "Our Client ARANZ Geo specialises in the interpretation and 3D visualisation of geoscience information using software modelling. It takes a special mix of people to make our cool and innovative software, and we’re immensely proud of how far we have come.", "We were founded by a bunch of mathematicians from the University of Canterbury, who developed fast algorithms to convert point clouds into triangular meshes using radial basis functions. And if that’s a bit technical, the first application came in the form of a handheld scanner used to digitise models for “Lord of the Rings” (my precious).", "It made sense for us to apply these algorithms to geoscience data and so Implicit Modelling was invented, completely changing the way geologists model. Our Leapfrog3D products are a result of our amazing work culture, the warm, fun environment, and the contributions made by our multicultural, global workforce.", "We currently serve the mining, geothermal and hydrogeology markets. With so many talented people with passion for building great software, we are fast expanding into the energy, civil engineering and environmental sectors. Our products are built for the desktop, enterprise, and increasingly the cloud."]},
{"url": "https://www.python.org/jobs/2709/", "loc": "Remote, Remote, Remote", "title": "(((Remote Fullstack Engineer - django/react)))", "job_type": ["Back end", "Big Data", "Cloud", "Front end", "Web", "Developer / Engineer"], "descrip": ["Local Insights is looking for a remote full-time full-stack software engineer. Your primary focus will be leading development on the web application, which is built in django/postgres/react/sass/material design. As we look to achieve optimal product market fit, we need someone who will work hard to iterate quickly based on user feedback.", "Core Requirement: the succesful candidate will be a generalist working across many different teams. You will mostly work on the web app but also contribute to the web scraping team too. Your ability to grind through difficult problems and think critically will determine how succesful we are together.", "Other Requirements:", "Additional skills useful but not required:", "Perks:", "Local Insights ingests real time data like new home purchases, home remodeling plans, and divorce records so lenders can manage risk and target a specific customer segment."]},
{"url": "https://www.python.org/jobs/2682/", "loc": "Durham, North Carolina, USA", "title": "Junior Python Developer with CCNA", "job_type": ["Back end", "Database", "Web", "Developer / Engineer"], "descrip": ["Robert Half is looking for a Junior Python Developer for a reputable technology company in the Raleigh-Durham area. This is an amazing opportunity to get into the growing information/data security field. The perfect candidate for this role has 1-2 years of Python experience as well as networking experience. This role is ideal for an individual who is eager to learn from a team of very talented information technology professionals.", "Requirements:\n·       CCNA level networking skills\n·       Python – object oriented programming\n·       Linux experience", "For immediate consideration, please email ", ".", "Requirements:\n·       CCNA level networking skills\n·       Python – object oriented programming\n·       Linux experience"]},
{"url": "https://www.python.org/jobs/2688/", "loc": "Remote, Remote, United States", "title": "Python Software Engineer [Clean Energy Job]", "job_type": ["Back end", "Web", "Developer / Engineer"], "descrip": ["UtilityAPI (", ") is a software platform that is used by solar and energy efficiency companies to collect their customer's utility bill and usage data automatically."]},
{"url": "https://www.python.org/jobs/2683/", "loc": "South Pasadena, CA, USA", "title": "Junior to Mid-Level Python Developer", "job_type": ["Back end", "Cloud", "Developer / Engineer"], "descrip": ["Designing, developing and deploying web services", "Meeting deadlines and proper goal setting", "Input into scheduling and resource needs for the project", "Attend estimating and bidding meetings as needed", "Work both as a team member and leader, depending on the project", "Python Junior to Mid level experience", "Experience with frameworks such as Django, Flask and Tornado", "Experience with Postgres, MySQL, No-SQL DBs and Message Queue systems", "Experience with writing deployment automation scripting", "Experience with Object Oriented Programming and appropriate Design Patterns", "Scrum and Waterfall workflow knowledge", "Accuracy and attention to detail", "Strong ability to work on multiple projects simultaneously and under deadlines", "Positive attitude and open, respectful communication", "Ability to work autonomously as well as in a team", "An eagerness to learn and overcome challenges", "WhiteMoon Dreams is currently seeking a highly skilled Junior-Mid level Python Developer to work on some cool console games.  The backend of these projects are used both internally and by external clients, so attention to detail, good code quality and strong ability to work in a team with deadlines are required."]},
{"url": "https://www.python.org/jobs/2689/", "loc": "Durham, North Carolina, United States", "title": "2017 - 2018 Fall & Winter Django Web Developer Internship", "job_type": ["Back end", "Front end", "Web", "Developer / Engineer"], "descrip": ["Come be a part of a small team of developers and designers passionate about creating fun and interactive web applications. Caktus is looking for someone who is excited about emerging technologies, creating compelling web applications and enjoys writing Python. As a member of the Caktus team, you’ll be involved in every aspect of development, from brainstorming, to prototyping, to front-end HTML/CSS and Django development. You’ll learn and collaborate directly with a great group of talented developers and designers.", "This experience includes:", "As a Django Web Developer Intern, you will:", "To apply:", "Caktus uses a standardized and equitable method to calculate salaries. Salaries are predetermined by a formula, which incorporates market rates, cost of living, candidate experience, and years with the company. They are standardized team-wide and are non-negotiable. For this position, we’re seeking a Level 1 with an hourly rate of $16.00 per hour.", "It is the policy of Caktus to provide equal employment for all persons regardless of race, color, national origin, ancestry, religion, age, disability, gender, sexual orientation, gender identity, body, genetic information, marital status, political belief or activity, or status as a veteran.", "We’d love to meet someone who:", "Caktus builds web and mobile apps with Django. We’ve built over 100 custom solutions that have reached more than 70 million people globally. Join our sharp team and be part of an open, collaborative culture that puts quality at the heart of each project. We’re passionate about solving complex challenges especially when they have a social impact. In addition to building the world’s first SMS voter registration project in Libya, we’ve also built applications for InDemand, Discovery, PBS, Mozilla, and UNICEF."]},
{"url": "https://www.python.org/jobs/2692/", "loc": "Chennai, Tamilnadu, India", "title": "Hiring Python Professionals @ CONTUS ", "job_type": ["Back end", "Database", "Front end", "Systems", "Web", "Developer / Engineer"], "descrip": ["Responsibilities :-", "Complete assigned development tasks.\nDevelop new web-apps using Python,Django,etc.\nDevelop new tools / scripts in PyQT, shell script, java-script, etc.\nWork on MySQL / No-SQL Databases, Cache system.\nMaintain the existing apps and add new features in it.", "Job Summary :-", "Key Skills :-\nPython,Django,\nBasic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3â€‹.â€‹", "Technical Expertise :-", "Strong experience with Python, Django, Flask and Celery.\nStrong knowledge in OOPs concepts\nExperience on HTML/CSS/Javascript, jQuery, Ajax, MySQL/Understanding of Git, task based queuing systems, and asynchronous programming.\nDjango framework.\nHTML, Javascript, Shell Script, GIT/Mercurial (Optional), Networking,\nStrong written & verbal English.", "About CONTUS :-", "CONTUS is a leading Mobility, Cloud and Web solutions company. We've been delivering innovative solutions through our products and services for our clients in more than 40+ countries since 2008. We operate from India (Chennai) and USA (San Jose) allows our clients to work with us effectively at ease. Contus has a strong team of 160+ skilled and experienced technology engineers and experts, which provides a great advantage to our clients on scale, cost and geography.", "To know more about us, visit www.contus.com, a leading mobile application development and web development company."]},
{"url": "https://www.python.org/jobs/2690/", "loc": "London, London, United Kingdom", "title": "Mid-Level / Senior Python Developer", "job_type": ["Back end", "Lead", "Web", "Developer / Engineer"], "descrip": ["We at Sohonet are looking for a Python Developer to come help us build & support cutting-edge, on-demand, highly secure cloud products for the movie industry, counting Warner Bros, NBC Universal, Fox, Dreamworks, Sony among our clients.", "If you've seen the latest Pirates of the Caribbean movie, Transformers, Star Wars: Rogue One, or Fantastic Beasts; you'll have seen our work helping the finest CGI companies collaborate in addition to many other blockbuster hits.", "● Participate in an agile product team building, delivering and operating our software services portfolio.", "● You will help design, build, and operate a multi-tiered system, demonstrating and encouraging best-practises while being always focussed on delivering the most value to our customers.", "● Provide innovative tools to the media industry using the most appropriate technology for the task. Today we're using Python (Django, Nameko, Flask), WebRTC, and Openstack Swift along with modern JavaScript libraries for the browser side. [who knows what we’ll need next?]", "● Understand how to architect a system and why you should use one architecture type over another - Monolithic, Micro-Services, FAAS (Lambda/Serverless).", "● Keep on top of the latest technologies, understand them well and help your team use them to solve the new and interesting challenges our customers face.", "● Master difficult engineering challenges like the real-time interactivity and massive data transfer requirements that are peculiar to the media industry.", "● Maintain high standards whilst working in a demanding environment where your customer's requirements include short production times, tight deadlines and large data volumes.", "● Ensure the products we build are measured so that we can know exactly how our customers are using our products and what makes them a success.", "Sohonet is the global expert in connectivity and data management services focusing exclusively on the media and entertainment industry. With over 20 years’ experience, Sohonet offers an extensive range of solutions backed up by unrivaled technical support to enable clients to manage and transfer valuable and critical content quickly, securely and effectively.", "Currently based in London, Los Angeles and Sydney and has points of presence in over 20 cities across the world."]},
{"url": "https://www.python.org/jobs/2693/", "loc": "Almere and Zwolle, Flevoland and Overijssel, The Netherlands", "title": "Full Stack Python/Django Developer", "job_type": ["Back end", "Developer / Engineer"], "descrip": ["For one of our long-term clients, we are searching for a dedicated developer that will work exclusively on improving their platform.", "TECHNOLOGY", "We have developed a platform, in which customers can create and manage interaction campaigns by uploading their users and inviting them to participate. Invitations are sent by an interactive SMS (in nearby future e-mail or push notifications) and users participate by clicking on the personal link in the invite. As a result of that, a campaign is started in the browser. Participating users generate data and conversion. M.I.C offers real-time KPI reports that allow the customers to see results and track conversion.", "WHAT YOU WILL DO", "This position offers a high degree of freedom in terms of implementing new ideas and improvements. You will work on a variety of tasks related to our platform such as developing new and optimizing existing functionalities, maintaining and extending our API’s and integration with customer systems. You will also work on developing and maintaining our SAAS solution, including online onboarding, billing and customer management. Furthermore, you will optimize performance and scalability and create and check unit tests.", "BENEFITS", "You will thrive in this position, if you are creative and like to think out-of-the-box to come up with technical solutions and if having the sense of ownership over your projects boosts your motivation. It's also crucial that you realize the importance of learning all the ins and outs of this platform and take pride in maintaining a clean, high quality code. Furthermore, you work really well independently and are able to organize your own work and planning, but at the same time you don't shy away from team discussions or knowledge-sharing and are just as passionate about technology as we are.", "WHAT YOU NEED", "Your workplace will be split between two offices. For at least 90% of your time you will be stationed at Elements Interactive in Almere, enjoying full support of the developers, who have been working on the platform until now. The remaining 10% will be spent at the M.I.C office in Zwolle or working from home.", "PLEASE NOTE - We are not able to offer VISA sponsorship for this specific position and can therefore only accept applicants WITH A VALID EU WORK PERMIT.", "APPLY via the this link: ", "ELEMENTS INTERACTIVE", "Elements Interactive builds rock solid applications for web and mobile. We create, discuss, adjust, measure and improve to deliver the best products. We strive to find the right balance between business goals, user experience and innovation.", "Our pragmatic mindset and down to earth attitude have not changed since our early start in 1996. While our relatively small team consists of people from different backgrounds, a passion for technology and user experience brings us together.", "OUR CLIENT", "Mobile Interaction Company (M.I.C) is a Dutch-based software marketing specialist, who offers mobile interaction solutions to companies all over the world and enables them to personally communicate with their customers, employees and other partners when it matters most, driving revenue, optimizing satisfaction, enhancing loyalty and increasing retention.", "M.I.C works for media, hospitality, financial and HR companies (like Talpa, Walibi Village, Cannock Chase, Brunel and many more) and is a mobile-first player, however, it doesn’t develop mobile apps for customers. M.I.C has invested heavily in developing a platform that utilizes Apps (SMS and the mobile browser, among others) already available on all mobile phones and other mobile devices and uses them to invite and activate users and to facilitate relevant interaction."]},
{"url": "https://www.python.org/jobs/2695/", "loc": "London, Shoreditch, England", "title": "Co-Founder/CTO", "job_type": ["Back end", "Developer / Engineer"], "descrip": ["FORWARD PARTNERS", "Forward Partners is the UK's largest dedicated seed stage VC with >£80m AUM. We focus on next-generation eCommerce companies and applied AI startups. Startups that we have backed include: Thread, Zopa, Appear Hear, LostMyName, and Big Health.", "A large part of what we do here at Forward Partners involves investing in 'pre-seed' (idea) stage startups. Usually these pre-seed stage startups are founded by non-technical, solo founders with deep subject matter expertise. Not only do we invest in these companies but we also provide them with 12 months rent free access to our offices (a co-working space a moments walk away from Old Street roundabout in East London) and access to a team of experts. This team of experts covers all the major functions from product management, design and UX through to software development, PR & comms, ops and talent. Over the 12 months these founders are with us we help them build an MVP, scale it and get them to a point where they are raising a significant institutional VC round at a multi-million dollar valuation. We have done this for companies such as Appear Here, Patch, Live Better With, and Lexoo.", "Typically at month 6 - 12 the main requirement is to find a technical Co-founder/CTO to pick up from where our team left off and help raise the series A and help build a world-class business in the process.", "If you are entrepreneurially minded, want to get involved in a start-up at a stage where you can really make a difference and make significant upside (but don't want to take too much of a risk on an unproved idea and need a salary to survive) then register your interest here.", "6 opportunities a year.", "Typical Technology Stack We Build With", "The current technology platform operates on a world class, highly scalable python-oriented stack, setup by the Forward Partners technical team. Continuous integration and deployment processes are already in place, allowing us to continuously deliver value to our customers. The technologies currently in use include: Python, Django, PostgreSQL, Redis, Celery, RabbitMQ, React, MobX, Webpack. The local development environment is built on top of Docker and the production environment is fully powered by Amazon Web Services (EC2, S3, RDS, ElastiCache, Route53, ELB, among others)", "The ideal candidate should be familiar with all or most of those technologies.", "Build things and ship code. He or she will be hands-on with writing and submitting lines of code on a daily basis.", "Define the overall technology strategy and budget, leading the architecture and delivery of an in-house, scalable platform.", "Ensure scalability and robustness of the platform, identifying and driving continuous improvements.", "Ensure company technical challenges are resolved in a timely and cost-effective manner.", "Hire, direct, coach and inspire a high-calibre technical team taking a hands-on approach where necessary e.g. conducting code reviews and driving release schedule.", "Embed an agile software development methodology, taking a lead to ensure a culture of continuous iteration and collaboration flows through the entire organisation.", "Participate in key management decisions regarding product.", "Maintain up-to-date knowledge of technology standards, trends, emerging technologies and software development best practices.", "Ensure that technology standards and best practices are maintained across the organisation as it starts to scale.", "Share knowledge, mentor, and educate the organisation’s investors, management, staff and stakeholders with regard to the company’s technology vision, opportunities and challenges.", "Reports to investors/shareholders with detailed monthly presentations on technical progress and data integrity.", "You are a self-starter, who will be used to working in a hands on and pragmatic manner", "Whilst you can develop thoughtful and strategic plans, you have a bias towards action and you naturally execute at pace with a focus on results", "You are not rattled by ambiguity and change, and you have the resilience to deal with ups and downs and keep a steady head throughout", "You have a positive attitude and mindset, and when things go wrong you automatically start to look for solutions", "You are only satisfied with excellence in all you do, and you motivate others to maintain the same highest standards"]},
{"url": "https://www.python.org/jobs/2715/", "loc": "Pleasanton, CA, United States", "title": "Software Engineer", "job_type": ["Back end", "Database", "Front end", "Web", "Developer / Engineer"], "descrip": ["We are kicking off a brand new project on optimizing a mobile app (both iOS & Android) that streams real time video and audio running on a Python BE & AWS. We are strategizing on how to optimize the latency period of the video stream, along with adding several other significant features.", "Education:\nBachelor’s degree in software engineering, computer science or a related science/engineering field or equivalent, or combination of education and relevant experience.\nExperience:\nExperience with Python and / or IDL required.\nExperience with UNIX shell scripting, and Java is a plus.\nAt least 2 years of software development experience in science applications or related area.\nExperience in mobile app related software position highly desired.", "CitrusBits leads the field in design innovation and digital development within the San Francisco Bay Area. We specialize in building mobile apps on every mobile/tablet platform. One of our apps was actually featured in one of the latest Apple iPhone 7 commercials. CitrusBits - helping you build your business with reliable and affordable technology solutions. Our Services: Web Services, iPhone App Development, Android App Development,", "Contact Info\nContact: Jim Sanders\nE-mail contact: ", "\nWeb: "]},
{"url": "https://www.python.org/jobs/2714/", "loc": "San Francisco, California, United States", "title": "Python Full-Stack Engineer", "job_type": ["Back end", "Database", "Front end", "Integration", "Lead", "Developer / Engineer"], "descrip": ["Pinterest is looking for a senior developer to join the engineering team responsible for two very popular tools. These tools are heavily used by our operations teams to review content on Pinterest and to action on user accounts.", "The role will involve developing automation for a set of legal compliance and user safety requirements. The ideal candidate should be comfortable fully owning and delivering software that meet specified requirements with high reliability. Python and full-stack development experience are a strong requirement. Front-end programming skills are a plus. This role requires a strong foundation in Computer Science, Algorithms and Data Structures.", "This is a contract to start at (4 months +) to complete this teams project.\nNeed to be local to San Francisco, and working W2 (no C2C)", "Skills:", "Proficiency in Python\nFull-stack development experience. Should have experience integrating with APIs and data-bases (e.g., MySQL)\nAbility to write optimal and bug-free code is a strong requirement\nStrong basics in algorithms and data structures\nExperience in JS/HTML/CSS and Flask / Django framework is a plus\nAbility to work independently and solicit guidance from senior developers."]},
{"url": "https://www.python.org/jobs/2717/", "loc": "South Pasadena, California, United States", "title": "Junior Python Developer", "job_type": ["Cloud", "Database", "Front end", "Image Processing", "Integration", "Operations", "Systems", "Testing", "Text Processing", "Web", "Developer / Engineer"], "descrip": ["WhiteMoon Dreams is currently seeking a highly skilled Junior-Mid level Python Developer to work on some cool console games.  The backend of these projects are used both internally and by external clients, so attention to detail, good code quality and strong ability to work in a team with deadlines are required.  ", "Primary Responsibilities", "Requirements", "Pluses", "WhiteMoon Dreams is an independent digital entertainment studio located in beautiful South Pasadena, CA.  We are fortunate to have on our team many industry veterans with decades of insight and experience between them.  Our pedigree includes key players from groundbreaking titles such as Fallout, Descent, Ratchet and Clank, Medal of Honor and many others.  We are also proud to be home to some of the brightest and most promising developers (both young and old) in the industry!  Our company is strongly rooted in video game history while simultaneously pushing the boundaries of bleeding-edge technology and design.  We are united in our shared passion for creating amazing, beautiful, unique, forward-thinking games.", "WhiteMoon Dreams was founded on the belief that video game development should be a holistic experience.  We believe in transparency and collaboration, both within our company and in our interactions with our community (without whom, none of this would be possible)!  We encourage our employees to always be learning and to never stop exploring.  WhiteMoon Dreams was built on a strong philosophy that happy people make the best workers, and strive to never lose sight of our integrity.", "Remember how it usually took all the colors of a crayon box to envision whatever ridiculousness your head came up with?  It similarly takes all the people of WhiteMoon Dreams to envision the amazing worlds we create.  Regardless of where we come from, we all share a common vision: creating games that we would enjoy just as much as the gamers who play them.  We are gamers who make games, and we strive to employ holistic development while going all out on making the most badass games we can. WhiteMoon Dreams last released the slagfest, Warmachine: Tactics in 2013, and now, we’ve taken to the stars!  We recently announced at the PlayStation® Experience 2016, Starblood Arena!  A First-Person Arena Shooter for the PlayStation® VR!  Starblood Arena officially launched on April 11, 2017!", "We seek to be innovators, both in business as well as technology and believe if something is not a challenge it is not worth doing at all."]},
{"url": "https://www.python.org/jobs/2731/", "loc": "London, United Kingdom", "title": "Python/Django developer for backend community mapping system ", "job_type": ["Back end", "Database", "Evangelism", "Lead", "Systems", "Web", "Developer / Engineer"], "descrip": ["The Extreme Citizen Science (ExCiteS) Group (", ") within the Department of Geography is seeking a developer. Key duties and responsibilities will be the continuing development of the Django-based GeoKey (", " and ", ") software used for participatory mapping projects The post is available for immediate start and is for 12 months in the first instance.", "Deadline for applications - 31 October, earlier applications will be reviewed as they come.\nStart date: ASAP", "Experience as a software developer, with proven experience working with Python and the Django framework, experience using Unix-based operating systems and Unix system tools and utilities, providing occasional technical support and managing servers.\nExperience in working in a team of developers to build upon robustly structured code, and managing code in shared environments – in particular GitHub. Knowledge of software development best practices including testing, documentation and version control.\nExperience in workflow automation and continuous integration and deployment using test frameworks (Travis)", "Note that as the main aim of the role is to develop, extend and maintain the GeoKey software, prior to the interview, selected candidates will be asked to clone the GeoKey repository, install GeoKey and configure it to authenticate against an external provider such as Facebook or Twitter.   Candidates will be asked to upload their modifications to their account for review.  During the interview, we would like candidates to make a 5 minute presentation about how they have approached the problem – where they started, what code extensions were required, what modifications were needed, and how they any problems encountered.", "The Extreme Citizen Science group works with communities across the world to address issues that are concern to them, and provide digital tools for data collection and visualisation that can work with people at all levels of literacy.", "ExCiteS  brings together scholars from diverse fields to develop and contribute to the guiding theories, tools and methodologies that will enable any community to start a Citizen Science project to deal with issues that concern them.", "With an interdisciplinary research approach we aim to provide any user, regardless of their background or literacy level, with a set of tools that can be used to collect, analyse and act on information according to agreed upon scientific methods.", "For 'Extreme' Citizen Science projects to succeed, a narrow disciplinary knowledge is not enough. It requires the engagement of communities, overcoming many technical and human-technology interaction challenges and the ability to deliver practical solutions, in addition to an understanding of the questions surrounding the science of Citizen Science. Our interdisciplinary group achieves this by drawing on the knowledge of geographers, anthropologists, computer scientists, Human-Computer Interaction experts, designers, electronic engineers, ecologists and other fields."]},
{"url": "https://www.python.org/jobs/2716/", "loc": "South Pasadena, California, USA", "title": "Senior Python Developer", "job_type": ["Cloud", "Database", "Front end", "Image Processing", "Integration", "Operations", "Systems", "Testing", "Text Processing", "Web", "Developer / Engineer"], "descrip": ["WhiteMoon Dreams is currently seeking a highly skilled Senior level Python Developer to work on some cool console games.  The backend of these projects are used both internally and by external clients, so attention to detail, good code quality and strong ability to work in a team with deadlines are required.  ", "Primary Responsibilities", "Requirements", "Pluses", "WhiteMoon Dreams is an independent digital entertainment studio located in beautiful South Pasadena, CA.  We are fortunate to have on our team many industry veterans with decades of insight and experience between them.  Our pedigree includes key players from groundbreaking titles such as Fallout, Descent, Ratchet and Clank, Medal of Honor and many others.  We are also proud to be home to some of the brightest and most promising developers (both young and old) in the industry!  Our company is strongly rooted in video game history while simultaneously pushing the boundaries of bleeding-edge technology and design.  We are united in our shared passion for creating amazing, beautiful, unique, forward-thinking games.", "WhiteMoon Dreams was founded on the belief that video game development should be a holistic experience.  We believe in transparency and collaboration, both within our company and in our interactions with our community (without whom, none of this would be possible)!  We encourage our employees to always be learning and to never stop exploring.  WhiteMoon Dreams was built on a strong philosophy that happy people make the best workers, and strive to never lose sight of our integrity.", "Remember how it usually took all the colors of a crayon box to envision whatever ridiculousness your head came up with?  It similarly takes all the people of WhiteMoon Dreams to envision the amazing worlds we create.  Regardless of where we come from, we all share a common vision: creating games that we would enjoy just as much as the gamers who play them.  We are gamers who make games, and we strive to employ holistic development while going all out on making the most badass games we can. WhiteMoon Dreams last released the slagfest, Warmachine: Tactics in 2013, and now, we’ve taken to the stars!  We recently announced at the PlayStation® Experience 2016, Starblood Arena!  A First-Person Arena Shooter for the PlayStation® VR!  Starblood Arena officially launched on April 11, 2017!", "We seek to be innovators, both in business as well as technology and believe if something is not a challenge it is not worth doing at all.", "Who knows where we’ll go next?  We’re looking for driven and talented crayons – ahem – people, to join our extended family.  We welcome you to contact us about the potential to make incredible things together.  Let’s see what ridiculousness we come up with next!"]},
{"url": "https://www.python.org/jobs/2733/", "loc": "Batavia, IL, USA", "title": "Python Developer - Grid/Cloud Workload Management", "job_type": ["Back end", "Big Data", "Cloud", "Integration", "Developer / Engineer"], "descrip": ["Work with a team of developers, computing services specialists, and scientists to contribute to the development, deployment and support of the workflow/workload management system (GlideinWMS) used by scientists to provision and manage computational resources in Grids, HPC Clusters and Commercial / Community based Cloud service providers.", "Support the existing GlideinWMS workflow/workload management system on Girds / Clusters\n•       Design and Python development of the next generation service for GlideinWMS utilization on  Cloud products (commercial and community)\n•       Python Code development for enhancements and bug fixes\n•       Provide support to the Scientific operations group & user support of the application suite", "Funded by the U.S. Department of Energy and operated by Fermi Research Alliance, LLC, Fermilab is the country’s top high energy physics research facility. Fermi hosts 1500+ physicists from 38 countries and a 300 person Computing Division.\nLocated on 6800 acres with fishing ponds, jogging/biking trails, cafeteria, Gym, onsite Daycare and even a Fine Arts Program. Outstanding Benefits with 100% Tuition reimbursement through Masters Degree level."]},
{"url": "https://www.python.org/jobs/2680/", "loc": "Barcelona, Spain", "title": "Software Engineer", "job_type": ["Back end", "Big Data", "Database", "Numeric processing", "Developer / Engineer"], "descrip": ["The Holaluz ", " team is comprised of data analysts and developers. We are responsible for managing, manipulating and exploiting the abundant data that Holaluz has to deal with and our goal is to provide value to the other teams in the company.", "Our three main tools are Python, R, and continuous integration. We are looking for an experienced Python developer to help us build tools, automate tasks and manage data.", "Holaluz.com is a power company from Barcelona. It is a young, innovative and progressive company trying to offer power at fair prices and personalised client attention."]},
{"url": "https://www.python.org/jobs/2681/", "loc": "Antwerp, Antwerp, Belgium", "title": "Full stack python developer @ funded startup", "job_type": ["Back end", "Cloud", "Database", "Front end", "Integration", "Web", "Developer / Engineer"], "descrip": ["We're looking for someone to join our team (which is python based) to work on a.o.:", "Server architecture", "Front-end", "3D model", "Plugin development", "Integrate AirShaper, through the API's, in 3D CAD packages (Solidworks, OnShape, Creo, ...)", "Link your brain", "Think like an entrepreneur: what does the user want, how can we tune our\nbusiness model, which markets can we address, ...", "Go wild!", "Do you have crazy ideas? Can you back them up with sound arguments?\nBring it on!", "Way of working", "We're a small team (the founder, the aerodynamics team and you, plus contractors where necessary), so what you do will have a huge impact on our company. Hours are flexible and fun will balance the cool and hard work.", "Salary\nAlthough we are a startup, we aim to provide a fair salary, with additional benefits like hospital insurance, meal cheques and a pension plan / life insurance.", "AirShaper is a startup based in Antwerp, Belgium. We are developing an online platform where designers & engineers can upload their digital 3D model and have the aerodynamics (airstream, wind forces, ...) calculated. Afterwards, results can be analysed in either the browser of their own CAD package via plugin's.", "We're both government and privatly funded, meaning we can provide job certainty for a longer period of time. We're located in a startup incubator, so you'll be surrounded by motivated techies & entrepreneurs!"]},
{"url": "https://www.python.org/jobs/2646/", "loc": "Portland, Oregon, United States", "title": "Python Software Engineer", "job_type": ["Back end", "Cloud", "Machine Learning", "Developer / Engineer"], "descrip": ["Cylance is seeking a Python Developer to design, implement, test and optimize with a high degree of autonomy and an emphasis on tangible results. You'll be joining our cloud platform team and working on a massively scalable data-processing system that produces highly accurate results at exceptionally rapid rates. You'll also research new technologies to improve existing systems and design new ones, writing a lot of highly scalable code, harvesting data from different databases, API's and other sources of information, as well as work with distributed systems.\nIf you love Python like a dog loves a bone and coding infrastructure on Linux is a walk in the park, or in the cloud, we want you on our team!", "WHAT YOU WILL DO", "ABOVE AND BEYOND\n•       Code in C#, either on Windows or Mono", "Cylance is one of the fastest growing companies in the history of cybersecurity. By successfully applying artificial intelligence and machine learning to crack the DNA of malware, Cylance has redefined the endpoint protection market, garnered acclaim from industry analysts and won numerous awards including “Best Emerging Vendor” from SC Magazine. If you have the passion and desire to disrupt industries, protect the world from cyberattacks, and be at the forefront of a revolutionary new technology, we want you to join us!", "BENEFITS AND PERKS\nIn addition to medical, dental, vision and 401(K), we offer other great benefits and a slew of perks such as casual dress attire, plethora of employer-sponsored food and snack items, toll road/public transportation subsidy, gym membership discount, etc. We’re proud to have been named one of the “Best Places to Work in Orange County” by the OC Business Journal.\n________________________________________\nCylance Inc. is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, gender expression, national origin, disability, protected veteran status, or any other basis protected by applicable federal, state, or local law."]},
{"url": "https://www.python.org/jobs/2649/", "loc": "New York, New York, USA", "title": "Python Developer", "job_type": ["Back end", "Big Data", "Front end", "Machine Learning", "Developer / Engineer"], "descrip": ["Python Developer (Mathematical Modeling Expertise)", "Job Title: Python Developer", "Job Req #:06292017", "Job Type: Full-time (3 months converts to direct hire)", "Job Location: New York, NY", "U.S. Citizens and those authorized to work in the U.S. are encouraged to apply. We are unable to sponsor at this time", "Our client, a leader in online small business lending, growing at a rapid pace while receiving several accolades - WorldatWork, 2017 Seal of Distinction, Fortune 30 Best Workplaces , named one of the Best Places to Work as part of Glassdoor's 2016 Employees' Choice Awards - is looking for a full-time Python Developer with Mathematical Modeling Expertise to join its team of bright and innovative thinkers. Our client uses data aggregation and electronic payment technology to evaluate the financial health of small and medium sized businesses and efficiently deliver capital to a market underserved by banks.", "As a full-time Python Developer, you will be an integral key member of the team working on credit models (credit scores to qualify for small business loans are based on these models) that brings their premium user interfaces experience and expertise to create cutting-edge software solutions. The Python Developer position is ideal for a talented front-end developer who is interested in working in an exciting growth environment among people passionate about advanced technologies.", "Required Experience and Skills for the Python Developer:", "Extensive experience with Python and Python frameworks (e.g., Flask, Django)\nMathematical Modeling Expertise - credit models\nExpert in object-oriented and functional programming concepts\nProficient with software design fundamentals and design patterns\nUnderstand web application concepts and HTTP protocols\nProficient with relational database fundamentals (e.g., Oracle, MySQL)\nProficient with computer networking and Unix fundamentals\nProficient with web languages, including HTML and JavaScript\nExperience with Git\nExperience with SOAP/WSDL/XML interfaces\nExperience developing REST services\nBachelor's degree in Computer Science, Mathematics or an equivalent combination of education and experience", "Our client, a leader in online small business lending, growing at a rapid pace while receiving several accolades - WorldatWork, 2017 Seal of Distinction, Fortune 30 Best Workplaces , named one of the Best Places to Work as part of Glassdoor's 2016 Employees' Choice Awards - is looking for a full-time Python Developer with Mathematical Modeling Expertise to join its team of bright and innovative thinkers. Our client uses data aggregation and electronic payment technology to evaluate the financial health of small and medium sized businesses and efficiently deliver capital to a market underserved by banks."]},
{"url": "https://www.python.org/jobs/2679/", "loc": "CHENNAI, Tamil Nadu, India", "title": "Full Stack - Python Developers", "job_type": ["Back end", "Database", "Front end", "Web", "Developer / Engineer"], "descrip": ["Complete assigned development tasks.\nDevelop new web-apps using Python,Django,etc.\nDevelop new tools / scripts in PyQT, shell script, java-script, etc.\nWork on MySQL / No-SQL Databases, Cache system.\nMaintain the existing apps and add new features in it.", "Strong experience with Python, Django, Flask and Celery.\nStrong knowledge in OOPs concepts\nExperience on HTML/CSS/Javascript, jQuery, Ajax, MySQL/Understanding of Git, task based queuing systems, and asynchronous programming.\nDjango framework.\nHTML, Javascript, Shell Script, GIT/Mercurial (Optional), Networking,\nStrong written & verbal English.", "CONTUS is a leading Mobility, Cloud and Web solutions company. We've been delivering innovative solutions through our products and services for our clients in more than 40+ countries since 2008. We operate from India (Chennai) and USA (San Jose) allows our clients to work with us effectively at ease. Contus has a strong team of 160+ skilled and experienced technology engineers and experts, which provides a great advantage to our clients on scale, cost and geography"]},
{"url": "https://www.python.org/jobs/2674/", "loc": "Berlin, Germany", "title": "Backend- / Frontend Developer (m/f) in Berlin", "job_type": ["Back end", "Front end", "Web", "Developer / Engineer"], "descrip": ["YOUR MISSION", "OUR TECHSTACK", "YOU SHOULD HAVE", "NICE TO HAVE", "First experience with using Django as a framework\nKnowledge in React\nExperience in using UNIX / LINUX\nKnow-how in the container application platforms Docker and OpenShift\nExperience with methods such as Scrum and TDD", "momox is Germany’s leading online buying-and-selling service, where everyone can turn their books, films, CDs, games and clothes into money. Via ", " and the momox app (iOS and Android) we buy used products at fixed prices. We offer the purchased items for sale in our online shops ", " (media) and ", " (fashion) and other marketplaces such as Amazon and eBay, faithful to the slogan “We give products a second life” Since starting, we have grown to become a company of 1,200 dedicated people at four locations in Berlin, Leipzig, Neuenhagen and Stettin. We are active in Germany, Austria, France and Great Britain. In 2015 our employees generated a revenue of 150 million euros. Since our launch, we have bought to sell more than 100 million items.\nThe people working for us are as diverse as our products. Logistics experts, team players, communication geniuses, creative minds, IT specialists and many more give their best at our four locations. We are still looking for new enthusiastic colleagues.", "THAT MAKES MOMOX ATTRACTIVE", "WHAT YOU CAN EXPECT"]},
{"url": "https://www.python.org/jobs/2669/", "loc": "New York, New York, United States", "title": "Python / Django Engineer", "job_type": ["Back end", "Cloud", "Web", "Developer / Engineer"], "descrip": ["Songtrust is seeking talented software developers to join us in solving one of the biggest problems facing songwriters in the new music business: getting paid.", "Existing systems of royalty collection around the world are antiquated and inefficient. Songtrust is finally bringing real engineering talent and ingenuity to a part of the music industry that has been notoriously slow in adapting to innovation. We help over 100k songwriters(more than the 3 major publishers combined!) get their money from places like Spotify, Apple Music, TV, Radio, and even bars and grills.", "Requirements:", "Extra points for experience with:", "Perks:", "Songtrust provides a technology platform for royalty collection services. Our industry-leading online solutions help songwriters, artists, managers, labels and publishers simplify music rights management including the administration of music publishing assets, performing rights, and digital licensing."]},
{"url": "https://www.python.org/jobs/2672/", "loc": "San Francisco, CA, United States", "title": "IS Software Developer", "job_type": ["Database", "Systems", "Developer / Engineer"], "descrip": ["Lucasfilm is looking for someone to join a motivated and flexible group of Python and Web developers. The developers in Information Systems write code that stores and tracks data to allow other departments to efficiently create movies, TV shows and games. We're looking for humble experts to join a team of well-rounded developers that thrive in an informal environment, one in which managers are there to support the process and fill in the gaps so that developers are free to do their jobs.", "Software Developers are expected to grow into greater responsibility and take ownership of their projects. We're looking for someone who is comfortable writing database-driven apps from the back- to front-end. We are continuously refining our processes and encourage our self-learning developers to explore tools, techniques and other sorts of meta-development to make themselves more productive.", "Put simply, we have a \"no arrogance\" policy and want to hire awesome people to work in a great department. We value pride and earnestness, idealism and pragmatism, and focusing on the customer as much as the code. We love source control, testing and Linux. We value boy scout coding (\"leave the code cleaner than you found it\") and finding the right tool for the right job. We're at a company that has used Python for nearly 20 years, and balancing legacy systems and future needs is a daily battle, but that is the nature of software—reading code is as important as writing it.", "Information Systems exists to support fast moving production companies, and you will work with the knowledge that whatever you write will immediately make the job easier for someone down the hall, at Skywalker Ranch or in Singapore. You'll be part of a group that gets along well whether it's tackling a technical issue, having a walking code review along Crissy Field, or playing a board game at lunch on Friday.", "Education / Experience:", "Technical Skills:", "Preferred Skills / Competencies:"]},
{"url": "https://www.python.org/jobs/2652/", "loc": "Chicago, Illinois, United States", "title": "Full Stack Developer ", "job_type": ["Database", "Front end", "Systems", "Developer / Engineer"], "descrip": ["The National Association of Realtors® (NAR), the largest trade association in the nation, is currently seeking a Software Engineer to provide ETL, front end development, and API support for the organization’s business intelligence group.", "In this hands-on role, you’ll be working in a small team, assisting a data scientist in developing analytic tools and services for the organization. You’ll be responsible for developing new (and maintaining and improving existing) ETL processes to consolidate data from various internal and external databases into data lakes. You’ll also be responsible for building new, and maintaining and improving existing, analytic dashboards and search tools. The ideal candidate will be a highly creative and proactive individual with the ability to plan and execute projects from beginning to end.", "If you’re a self-motivated technology development professional with 3+ years of relevant experience, excellent interpersonal skills, and the desire to learn, we’d like to hear from you! We value creativity, quality of work, technical leadership, intelligence, and curiosity.", "RESPONSIBILITIES:", "REQUIREMENTS:", "BENEFITS & PERKS", "The National Association of REALTORS® operates with one goal in mind: to help our more than 1 million members become more profitable and successful. We believe that building a strong team is the only way to accomplish this goal. Our most successful staffers embody our core values (excellence, respect, trust and creativity) and are committed to:", "National Association of REALTORS is an Equal Opportunity Employer and does not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.", "No phone calls, please.", "The National Association of REALTORS® is America's largest trade association, representing 1.2 million members, including NAR's institutes, societies, and councils, involved in all aspects of the residential and commercial real estate industries."]},
{"url": "https://www.python.org/jobs/2656/", "loc": "New York, NY, USA", "title": "Python Full Stack Lead Developer", "job_type": ["Back end", "Database", "Front end", "Lead", "Machine Learning", "Developer / Engineer"], "descrip": ["Python Full Stack Lead Developer", "About the Position", "We are seeking a lead developer to be responsible for a digital fundraising platform and data platform. This platform includes a data warehouse, an identity management system and a recommendation engine.", "Responsibilities", "Qualifications", "Not For Profit Arts Organization located in SoHo NYC"]},
{"url": "https://www.python.org/jobs/2665/", "loc": "London, United Kingdom", "title": "Experienced Software Developer", "job_type": ["Back end", "Big Data", "Cloud", "Database", "Front end", "Machine Learning", "Numeric processing", "Operations", "Testing", "Text Processing", "Web", "Developer / Engineer"], "descrip": ["We’re looking for an experienced full stack developer to join our development team at GrowthIntel building the only machine learning marketing platform of its kind.", "As a developer at GrowthIntel you’ll work on a range of cutting edge tech in a fast paced agile environment. As the 7th member of the dev team, you’ll have a real impact on the business - working on everything from data engineering to DevOps and web app development. You’ll be involved in:", "Area’s you’ll be directly involved in:", "Specific Technologies we work with:", "What we're looking for:", "It'd be great if you:", "GrowthIntel is a VC-funded marketing technology company based in London. We’re the only UK company using machine learning and web-crawled data to build a B2B marketing recommendation system. We’re six years old, with a team of 11 people, including six on the development team. We’re a friendly bunch with a broad range of experience - we put emphasis on sharing knowledge and supporting each other in personal growth.", "Benefits:"]},
{"url": "https://www.python.org/jobs/2662/", "loc": "Betzdorf, Luxembourg", "title": "Python developper", "job_type": ["Back end", "Big Data", "Cloud", "Database", "Developer / Engineer"], "descrip": ["AdwäisEO SA is looking for a talented developer for activities related to production, archiving and dissemination of Earth Observation Data from European Space Agency.", "She/he will contribute to the development and optimization of data flow and data processing in HPC environment along with the management of the archive with SQL database.", "Required:", "Being considered as a plus:", "AdwäisEO is a young fast growing company of ACRI group, acting in the sector of services for data archiving and dissemination with particular focus on remote sensing data. The company is based in Luxemburg, small and dynamic country in the heart of Europe at the top for the quality of life."]},
{"url": "https://www.python.org/jobs/2663/", "loc": "London , Belfast, UK", "title": "Full stack python dev (senior)", "job_type": ["Back end", "Database", "Front end", "Developer / Engineer"], "descrip": ["We're looking for full-stack devs to work on some of our internal projects. We're mostly hiring for the product below but depending on your ability, experience and desire, we may want you to work hands-on with some of our startups or corporate clients projects (usually in the fintech space).", "salary: £75k - £85k", "We're currently building an  Optimicer, a knowledge marketplace for companies. It’s a platform similar to an appstore but on the web, companies sign up and download tools (like apps) for their organization. With tools, companies can perform a range of functions from filling in VAT returns to completing an IPO. What makes this project cool is that we’re designing a simple tool system that allows tools to be built by anyone, including non- technical people. Because of the scale and nature of the project, we’re directly working with huge corporate partners such as Microsoft, Cisco and NEX.", "We're predominantly looking for front end devs working with React with a great experience with Python (since everything else is built with python).\nHowever, we are also looking for developers with a strong python focus.\nWe require you to be able to work with us in person in our London office (based at EC2A 1AF) or Belfast Office (based at BT2 8DN)", "Whitespace Ventures started as a VC firm, investing in early stage startups and helping them grow. The core whitespace team are all developers and were able to help investee companies scale out their products. We got so good at building out software that we started getting approached by established corporates and are having to turn down work. We are now looking to build out our internal dev team to build out various products and work on some larger corporate clients while staying true to helping early stage companies build out their products."]},
{"url": "https://www.python.org/jobs/2664/", "loc": "München, Germany", "title": "Machine Learning Engineer", "job_type": ["Machine Learning", "Developer / Engineer"], "descrip": ["We are looking for an experienced  Machine Learning Engineer who wants to liberate us from manual classification. We’re a fashion and  lifestyle company but you won’t have to wear the latest fashion trends. A hoodie will do just fine. You don’t speak German? No big deal, we use English as our main language.", "Our Tech Stack", "Your Team", "Your Responsibilities", "Your Profile", "Why Join Stylight?", "For more information check out: ", "Looking good? Does this sound like the perfect job for you? Then do not hesitate and apply today on jobs.stylight.com/Jobs/.", "We are looking forward to receiving your application.", "Your contact: Carina Meyer"]},
{"url": "https://www.python.org/jobs/2661/", "loc": "Málaga, Andalusia, Spain", "title": "Senior Python Developer", "job_type": ["Back end", "Big Data", "Cloud", "Developer / Engineer"], "descrip": ["Epuzles is recruiting for a small-medium company immersed in national and international expansion a Senior Python Developer willing to face challenges in big data, cloud and fintech realms.\nAs the office is based in the sunny and welcoming city of Málaga a really good command of Spanish is a must."]},
{"url": "https://www.python.org/jobs/2659/", "loc": "Berlin, Berlin, Germany", "title": "Computer Vision Engineer", "job_type": ["Image Processing", "Machine Learning", "Numeric processing", "Developer / Engineer"], "descrip": ["We are looking to hire a full time Computer Vision engineer to join our team in Berlin.", "You will be a core contributor to Pupil, open source eye tracking platform - ", " - and will be creating new eye tracking tools enabling a  community of researchers and individuals around the world.", "You will be working on improving the existing codebase and collaborating with the research and development team to implement new features. The codebase is written primarily in Python with Cython wrappers to C++ code where speed is essential.", "We are a relatively small team and try to move quickly. This means that the code you write will be put into production and used by the community!", "Send us your CV and links to website, github profile, and/or any published papers to apply!", "We build eye tracking hardware and software.", "We believe in open source. We have formed our business around an open source model, and have grown with our community.", "We work projects that we find challenging and exciting. It is our goal with every aspect of our work to learn something new.", "We are excited about eye tracking. It enables us to work at the intersection of many fields and to interact with a diverse community.", "We are currently focusing our development efforts on Pupil – a mobile eye tracking headset and open source software framework – and on developing open source tools for virtual reality and augmented reality."]},
{"url": "https://www.python.org/jobs/2668/", "loc": "London, United Kingdom", "title": "Mid-Level Back-End developer", "job_type": ["Back end", "Finance", "Web", "Developer / Engineer"], "descrip": ["As Back-End Developer, your key responsibilities will include but will not be limited to:", "Experience:", "Personality:", "Further desired skills:", "SME Capital is an online alternative lending platform which enables profitable and established SMEs to raise long-term strategic debt directly from institutional investors. We are helping businesses access previously unattainable finance in a more streamlined and efficient way by utilising our technology and financial expertise. If you have the ambition to make a big impact in a rapidly growing design and tech team then we are the company for you.", "Our sophisticated platform has been designed to simplify the traditional lending process while enabling collaboration between all parties. Borrowers, their advisors and institutional investors each have a tailored experience with full visibility of the transaction at every stage.", "We are a rapidly expanding company – the size of our team has almost doubled to 20 people since September and as we enter the next stage of growth we are looking to further improve our expert team to help develop our continuously evolving platform.", "OUR TECH TEAM", "We are a team of 6 developers, designers and project managers who are passionate about building a game changing fintech platform and we are hoping to double the size of this team within the next 6 months. You will be a part of a friendly, highly collaborative and expert team who work closely with the business team to deliver the right product for our customers. Ensuring a diverse and inclusive workplace where we learn from each other is core to our values.", "OUR TECH STACK", "Our front-end primarily uses Vue JS, along with utility libraries such as Underscore.js and is in the process of replacing the legacy jQuery code. The CSS is built out from LESS using a centralised style guide. The back-end uses Django and Django Rest Framework as well as Fabric and Gulp as our main deployment frameworks. With regards to our ‘environment’, we are gradually moving to Docker, so any experience with virtualised environments would be a plus. Our design process includes lean ux methodologies, prototyping and a lot of time in Sketch."]},
{"url": "https://www.python.org/jobs/2666/", "loc": "Bethesda, MD, USA", "title": "Software Engineer", "job_type": ["Back end", "Big Data", "Cloud", "Database", "Finance", "Front end", "Machine Learning", "Systems", "Testing", "Web", "Developer / Engineer"], "descrip": ["Design, develop, test, deploy, maintain and improve software in the Python programming language and development frameworks.", "Develop solutions for IFG Platform that use the best in architectural design and product best practices.", "Identify technical dependencies and roadblocks for the product proactively and work with cross-functional teams to remove them. Learn new technologies very quickly and apply them in real-world, non-trivial situations", "Identify feature gaps, provide guidance on existing product issues, and collaborate with Solutions Architects and Engineers to influence the growth of IFG Platform", "Develop solutions for IFG Platform that use the best in architectural design and product best practices.", "Work with popular open source software and Enterprise Content Management or Business Applications.", "Implementing scalable cloud based solution architectures for PaaS, IaaS or SaaS. In-depth experience operating with cross-functional teams (Product, Engineering, Network Operations, Sales, Marketing, Developer Relations, and Business Development).", "Manage individual project priorities, deadlines and deliverables.", "BS degree in similar in or a related technical field, or equivalent practical experience..\nSoftware development experience in one or more general purpose programming languages. Experience in software development as well as with developing web-based applications.\nExperience working with two or more from the following: web application development, Unix/Linux environments, mobile application development, distributed and parallel systems, machine learning, information retrieval, natural language processing, networking, developing large software systems, and/or security software development.\nWorking proficiency and communication skills in verbal and written English.\nExperience with one or more general purpose programming languages including but not limited to: Java, PHP, C#, Python, JavaScript.\nStrong understanding of web development protocols.\nInterest and ability to learn other coding languages as needed.", "The Interface Financial Group's Invoice Finance Marketplace provides select invoice finance services which can be a beneficial tool for SMEs in times of financial need. Stop waiting 30-90 days for your customers payments, request IFG's early payment service for your selected invoice or invoices, your chosen date of payment and get the cash directly to your bank account."]}
]